[Killed] PublicVisibility
DtoPropertyData.php:24:2
 	/**
 	 * @return bool
 	 */
-	public function isRequired(): bool
+	protected function isRequired() : bool
 	{
 		return $this->required;
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                                               
  [Error] Call to protected method OpenApi\DtoPropertyData::isRequired() from scope OpenApi\RequestDataHelper

[Killed] PublicVisibility
DtoPropertyData.php:32:2
 	/**
 	 * @param bool $required
 	 */
-	public function setRequired(bool $required): void
+	protected function setRequired(bool $required) : void
 	{
 		$this->required = $required;
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                                                                 
  [Error] Call to protected method OpenApi\DtoPropertyData::setRequired() from scope OpenApi\RulesResolver\AbstractRuleResolver

[Killed] PublicVisibility
DtoPropertyData.php:40:2
 	/**
 	 * @return string
 	 */
-	public function getArrayType(): string
+	protected function getArrayType() : string
 	{
 		return $this->arrayType;
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                                                 
  [Error] Call to protected method OpenApi\DtoPropertyData::getArrayType() from scope OpenApi\RequestDataHelper

[Killed] PublicVisibility
DtoPropertyData.php:48:2
 	/**
 	 * @param string $arrayType
 	 */
-	public function setArrayType(string $arrayType): void
+	protected function setArrayType(string $arrayType) : void
 	{
 		$this->arrayType = $arrayType;
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                                                                  
  [Error] Call to protected method OpenApi\DtoPropertyData::setArrayType() from scope OpenApi\RulesResolver\IndexedArrayResolver

[Killed] PublicVisibility
DtoPropertyData.php:56:2
 	/**
 	 * @return iterable
 	 */
-	public function getEnumItems(): iterable
+	protected function getEnumItems() : iterable
 	{
 		return $this->enumItems;
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                                                 
  [Error] Call to protected method OpenApi\DtoPropertyData::getEnumItems() from scope OpenApi\RequestDataHelper

[Killed] PublicVisibility
DtoPropertyData.php:64:2
 	/**
 	 * @param iterable $enumItems
 	 */
-	public function setEnumItems(iterable $enumItems): void
+	protected function setEnumItems(iterable $enumItems) : void
 	{
 		$this->enumItems = $enumItems;
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                                                        
  [Error] Call to protected method OpenApi\DtoPropertyData::setEnumItems() from scope OpenApi\RulesResolver\InResolver

[Killed] PublicVisibility
DtoPropertyData.php:72:2
 	/**
 	 * @return array
 	 */
-	public function getMessages(): array
+	protected function getMessages() : array
 	{
 		return $this->messages;
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                                                
  [Error] Call to protected method OpenApi\DtoPropertyData::getMessages() from scope OpenApi\RequestDataHelper

[NoCoverage] PublicVisibility
DtoPropertyData.php:80:2
 	/**
 	 * @param array $messages
 	 */
-	public function setMessages(array $messages): void
+	protected function setMessages(array $messages) : void
 	{
 		$this->messages = array_merge($this->messages, $messages);

[Killed] PublicVisibility
DtoPropertyData.php:85:2
 		$this->messages = array_merge($this->messages, $messages);
 	}
 
-	public function addMessage(string $message): void
+	protected function addMessage(string $message) : void
 	{
 		$this->messages[] = $message;
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                                                                  
  [Error] Call to protected method OpenApi\DtoPropertyData::addMessage() from scope OpenApi\RulesResolver\DefaultMessageResolver

[Killed] PublicVisibility
DtoPropertyData.php:94:2
 	/**
 	 * @return string
 	 */
-	public function getType(): string|Schema
+	protected function getType() : string|Schema
 	{
 		return $this->type;
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                                            
  [Error] Call to protected method OpenApi\DtoPropertyData::getType() from scope OpenApi\RequestDataHelper

[Killed] PublicVisibility
DtoPropertyData.php:102:2
 	/**
 	 * @param string $type
 	 */
-	public function setType(string|Schema $type): void
+	protected function setType(string|Schema $type) : void
 	{
 		$this->type = $type;
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                                            
  [Error] Call to protected method OpenApi\DtoPropertyData::setType() from scope OpenApi\RequestDataHelper

[Killed] PublicVisibility
DtoPropertyData.php:110:2
 	/**
 	 * @return bool
 	 */
-	public function isNullable(): bool
+	protected function isNullable() : bool
 	{
 		return $this->isNullable;
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                                               
  [Error] Call to protected method OpenApi\DtoPropertyData::isNullable() from scope OpenApi\RequestDataHelper

[Killed] PublicVisibility
DtoPropertyData.php:118:2
 	/**
 	 * @param bool $isNullable
 	 */
-	public function setIsNullable(bool $isNullable): void
+	protected function setIsNullable(bool $isNullable) : void
 	{
 		$this->isNullable = $isNullable;
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                                                  
  [Error] Call to protected method OpenApi\DtoPropertyData::setIsNullable() from scope OpenApi\RequestDataHelper
