[NoCoverage] ConcatOperandRemoval
OpenApiGenerator.php:43:3
 		$this->appConfig = require_once $appConfigPath;
 		$appConfigDefinitions = (require_once $appConfigDefinitions)($this->appConfig);
 		$appDefinitions = (require_once $appDefinitionsPath);
-		$kernelDefinitions = (require_once __DIR__ . '/../Kernel/Definitions/definitions.php')($this->appConfig);
+		$kernelDefinitions = (require_once '/../Kernel/Definitions/definitions.php')($this->appConfig);
 		$definitions = $appDefinitions + $appConfigDefinitions + $kernelDefinitions;
 		$this->container = new Container($definitions);

[NoCoverage] Concat
OpenApiGenerator.php:43:3
 		$this->appConfig = require_once $appConfigPath;
 		$appConfigDefinitions = (require_once $appConfigDefinitions)($this->appConfig);
 		$appDefinitions = (require_once $appDefinitionsPath);
-		$kernelDefinitions = (require_once __DIR__ . '/../Kernel/Definitions/definitions.php')($this->appConfig);
+		$kernelDefinitions = (require_once '/../Kernel/Definitions/definitions.php' . __DIR__)($this->appConfig);
 		$definitions = $appDefinitions + $appConfigDefinitions + $kernelDefinitions;
 		$this->container = new Container($definitions);

[NoCoverage] Plus
OpenApiGenerator.php:44:3
 		$appConfigDefinitions = (require_once $appConfigDefinitions)($this->appConfig);
 		$appDefinitions = (require_once $appDefinitionsPath);
 		$kernelDefinitions = (require_once __DIR__ . '/../Kernel/Definitions/definitions.php')($this->appConfig);
-		$definitions = $appDefinitions + $appConfigDefinitions + $kernelDefinitions;
+		$definitions = $appDefinitions - $appConfigDefinitions + $kernelDefinitions;
 		$this->container = new Container($definitions);
 	}

[NoCoverage] Plus
OpenApiGenerator.php:44:3
 		$appConfigDefinitions = (require_once $appConfigDefinitions)($this->appConfig);
 		$appDefinitions = (require_once $appDefinitionsPath);
 		$kernelDefinitions = (require_once __DIR__ . '/../Kernel/Definitions/definitions.php')($this->appConfig);
-		$definitions = $appDefinitions + $appConfigDefinitions + $kernelDefinitions;
+		$definitions = $appDefinitions + $appConfigDefinitions - $kernelDefinitions;
 		$this->container = new Container($definitions);
 	}

[NoCoverage] IfNegation
OpenApiGenerator.php:59:3
 			'components' => $this->getComponents($schemaRefs),
 			'servers' => $this->getServers()
 		]);
-		if ($openApi->validate()) {
-			$json = \cebe\openapi\Writer::writeToJson($openApi);
-		} else {
-			throw new \Exception('Спецификация сгенерировалась не валидной!');
-		}
+		if (!$openApi->validate()) {
 		$this->saveFileToRuntime($json);
 		$this->sendFileToYouTrackArticle();

[NoCoverage] Throw_
OpenApiGenerator.php:62:4
 		if ($openApi->validate()) {
 			$json = \cebe\openapi\Writer::writeToJson($openApi);
 		} else {
-			throw new \Exception('Спецификация сгенерировалась не валидной!');
+			new \Exception('Спецификация сгенерировалась не валидной!');
 		}
 		$this->saveFileToRuntime($json);

[NoCoverage] MethodCallRemoval
OpenApiGenerator.php:64:3
 		} else {
 			throw new \Exception('Спецификация сгенерировалась не валидной!');
 		}
-		$this->saveFileToRuntime($json);
+		
 		$this->sendFileToYouTrackArticle();
 	}

[NoCoverage] MethodCallRemoval
OpenApiGenerator.php:65:3
 			throw new \Exception('Спецификация сгенерировалась не валидной!');
 		}
 		$this->saveFileToRuntime($json);
-		$this->sendFileToYouTrackArticle();
+		
 	}
 

[NoCoverage] ConcatOperandRemoval
OpenApiGenerator.php:70:3
 
 	private function saveFileToRuntime(string $data)
 	{
-		$file = fopen($this->runtimeFolder . 'openApi_' . $this->environment . '.json', "w");
+		$file = fopen('openApi_' . $this->environment . '.json', "w");
 		fwrite($file, $data);
 		fclose($file);

[NoCoverage] Concat
OpenApiGenerator.php:70:3
 
 	private function saveFileToRuntime(string $data)
 	{
-		$file = fopen($this->runtimeFolder . 'openApi_' . $this->environment . '.json', "w");
+		$file = fopen($this->runtimeFolder . $this->environment . 'openApi_' . '.json', "w");
 		fwrite($file, $data);
 		fclose($file);

[NoCoverage] FunctionCallRemoval
OpenApiGenerator.php:71:3
 	private function saveFileToRuntime(string $data)
 	{
 		$file = fopen($this->runtimeFolder . 'openApi_' . $this->environment . '.json', "w");
-		fwrite($file, $data);
+		
 		fclose($file);
 	}

[NoCoverage] FalseValue
OpenApiGenerator.php:78:3
 	private function sendFileToYouTrackArticle()
 	{
 		$attachments = $this->getArticleAttachments();
-		$existAttachment = false;
+		$existAttachment = true;
 		foreach ($attachments as $attachment) {
 			$attachment = $this->getAttachmentInfo($attachment['id']);

[NoCoverage] Foreach_
OpenApiGenerator.php:79:3
 	{
 		$attachments = $this->getArticleAttachments();
 		$existAttachment = false;
-		foreach ($attachments as $attachment) {
-			$attachment = $this->getAttachmentInfo($attachment['id']);
-			if ($attachment['name'] == 'openApi_' . $this->environment . '.json') {
-				$client = new Client();
-				$result = $client->request('DELETE',
-					'https://youtrack.wooppay.com/api/articles/' . $this->articleId . '/attachments/' . $attachment['id'],
-					[
-						'headers' => [
-							'Authorization' => 'Bearer perm:dnNoaXNoa2lu.NjItMzg=.0akfHwan5g4MsLfA0TDa0EKd6udRtT',
-							'Content-Type' => 'application/json'
-						]
-					])->getBody()->getContents();
-			}
-		}
+		foreach (array() as $attachment) {
 		$boundary = 'my_custom_boundary';
 		$client = new Client();

[NoCoverage] Concat
OpenApiGenerator.php:81:4
 		$existAttachment = false;
 		foreach ($attachments as $attachment) {
 			$attachment = $this->getAttachmentInfo($attachment['id']);
-			if ($attachment['name'] == 'openApi_' . $this->environment . '.json') {
+			if ($attachment['name'] == 'openApi_' . '.json' . $this->environment) {
 				$client = new Client();
 				$result = $client->request('DELETE',

[NoCoverage] ConcatOperandRemoval
OpenApiGenerator.php:81:4
 		$existAttachment = false;
 		foreach ($attachments as $attachment) {
 			$attachment = $this->getAttachmentInfo($attachment['id']);
-			if ($attachment['name'] == 'openApi_' . $this->environment . '.json') {
+			if ($attachment['name'] == $this->environment . '.json') {
 				$client = new Client();
 				$result = $client->request('DELETE',

[NoCoverage] Equal
OpenApiGenerator.php:141:3
 
 	private function getInfo(): Info
 	{
-		if (ENVIRONMENT == 'dev') {
+		if (ENVIRONMENT != 'dev') {
 			$version = 'dev';
 		} else {

[NoCoverage] Foreach_
OpenApiGenerator.php:157:3
 	private function getProjectDescription(): string
 	{
 		$permissions = [];
-		foreach ($this->appConfig['allowedUserPermissions'] as $permission) {
-			$permissions[] = $permission->value;
-		}
+		foreach (array() as $permission) {
 		$permissions = implode(', ', $permissions);
 		$subjectTypes = [];

[NoCoverage] Foreach_
OpenApiGenerator.php:162:3
 		}
 		$permissions = implode(', ', $permissions);
 		$subjectTypes = [];
-		foreach ($this->appConfig['allowedUserTypes'] as $subjectType) {
-			$subjectTypes[] = $subjectType->value;
-		}
+		foreach (array() as $subjectType) {
 		$subjectTypes = implode(', ', $subjectTypes);
 		return "Вход в приложение доступно типам субьектов: " . $subjectTypes . " c правами: " . $permissions;

[NoCoverage] ConcatOperandRemoval
OpenApiGenerator.php:166:3
 			$subjectTypes[] = $subjectType->value;
 		}
 		$subjectTypes = implode(', ', $subjectTypes);
-		return "Вход в приложение доступно типам субьектов: " . $subjectTypes . " c правами: " . $permissions;
+		return "Вход в приложение доступно типам субьектов: " . $subjectTypes . $permissions;
 	}
 

[NoCoverage] ConcatOperandRemoval
OpenApiGenerator.php:166:3
 			$subjectTypes[] = $subjectType->value;
 		}
 		$subjectTypes = implode(', ', $subjectTypes);
-		return "Вход в приложение доступно типам субьектов: " . $subjectTypes . " c правами: " . $permissions;
+		return "Вход в приложение доступно типам субьектов: " . " c правами: " . $permissions;
 	}
 

[NoCoverage] PublicVisibility
OpenApiGenerator.php:172:2
 	/**
 	 * @return array{paths:Paths,components:Components}
 	 */
-	public function getPathsData(array $methodsNamespaces, ReferenceCollection $schemaRefs): Paths
+	protected function getPathsData(array $methodsNamespaces, ReferenceCollection $schemaRefs) : Paths
 	{
 		$data = [];

[NoCoverage] Foreach_
OpenApiGenerator.php:175:3
 	public function getPathsData(array $methodsNamespaces, ReferenceCollection $schemaRefs): Paths
 	{
 		$data = [];
-		foreach ($methodsNamespaces as $namespace) {
-			$data[$this->parseMethodUrl($namespace)] = $this->getPathItem($namespace, $schemaRefs);
-		}
+		foreach (array() as $namespace) {
 		return new Paths($data);
 	}

[NoCoverage] UnwrapStrReplace
OpenApiGenerator.php:183:3
 
 	private function parseMethodUrl(string $methodNameSpace): string
 	{
-		$preparedString = str_replace('App\Modules\\', '', $methodNameSpace);
+		$preparedString = $methodNameSpace;
 		$array = explode('\\', $preparedString);
 		foreach ($array as $key => $value) {

[NoCoverage] Foreach_
OpenApiGenerator.php:185:3
 	{
 		$preparedString = str_replace('App\Modules\\', '', $methodNameSpace);
 		$array = explode('\\', $preparedString);
-		foreach ($array as $key => $value) {
-			if ($value == 'Methods') {
-				unset($array[$key]);
-				continue;
-			}
-			$array[$key] = lcfirst($value);
-		}
+		foreach (array() as $key => $value) {
 		return '/' . implode('/', $array);
 	}

[NoCoverage] AssignmentEqual
OpenApiGenerator.php:186:4
 		$preparedString = str_replace('App\Modules\\', '', $methodNameSpace);
 		$array = explode('\\', $preparedString);
 		foreach ($array as $key => $value) {
-			if ($value == 'Methods') {
+			if ($value = 'Methods') {
 				unset($array[$key]);
 				continue;

[NoCoverage] Equal
OpenApiGenerator.php:186:4
 		$preparedString = str_replace('App\Modules\\', '', $methodNameSpace);
 		$array = explode('\\', $preparedString);
 		foreach ($array as $key => $value) {
-			if ($value == 'Methods') {
+			if ($value != 'Methods') {
 				unset($array[$key]);
 				continue;

[NoCoverage] Continue_
OpenApiGenerator.php:188:5
 		foreach ($array as $key => $value) {
 			if ($value == 'Methods') {
 				unset($array[$key]);
-				continue;
+				break;
 			}
 			$array[$key] = lcfirst($value);

[NoCoverage] UnwrapLcFirst
OpenApiGenerator.php:190:4
 				unset($array[$key]);
 				continue;
 			}
-			$array[$key] = lcfirst($value);
+			$array[$key] = $value;
 		}
 		return '/' . implode('/', $array);

[NoCoverage] ConcatOperandRemoval
OpenApiGenerator.php:192:3
 			}
 			$array[$key] = lcfirst($value);
 		}
-		return '/' . implode('/', $array);
+		return implode('/', $array);
 	}
 

[NoCoverage] Concat
OpenApiGenerator.php:192:3
 			}
 			$array[$key] = lcfirst($value);
 		}
-		return '/' . implode('/', $array);
+		return implode('/', $array) . '/';
 	}
 

[NoCoverage] LogicalNot
OpenApiGenerator.php:203:3
 		$exceptionsResponses = $this->getExceptionsResponses($methodsNamespace, $schemaRefs);
 		$responses = ['200' => $successResponse] + $exceptionsResponses;
 		$responses = new Responses($responses);
-		if (!empty(implode(', ', $requestData['permissions']))) {
+		if (empty(implode(', ', $requestData['permissions']))) {
 			$permissions = implode(', ', $requestData['permissions']);
 		} else {

[NoCoverage] ConcatOperandRemoval
OpenApiGenerator.php:212:5
 			'post' => new Operation([
 				'responses' => $responses,
 				'requestBody' => $requestData['request'],
-				'description' => 'Необходимые права: ' . $permissions,
+				return new PathItem(['post' => new Operation(['responses' => $responses, 'requestBody' => $requestData['request'], 'description' => 'Необходимые права: '])]);
 			])
 		]);

[NoCoverage] Concat
OpenApiGenerator.php:212:5
 			'post' => new Operation([
 				'responses' => $responses,
 				'requestBody' => $requestData['request'],
-				'description' => 'Необходимые права: ' . $permissions,
+				return new PathItem(['post' => new Operation(['responses' => $responses, 'requestBody' => $requestData['request'], 'description' => $permissions . 'Необходимые права: '])]);
 			])
 		]);

[NoCoverage] Foreach_
OpenApiGenerator.php:226:3
 	private function getComponents(ReferenceCollection $schemaRefs): Components
 	{
 		$finalSchema = [];
-		foreach ($schemaRefs as $path => $item) {
-			$paths = explode('/', $path);
-			$finalSchema[array_pop($paths)] = $item;
-		}
+		foreach (array() as $path => $item) {
 		return new Components(['schemas' => $finalSchema]);
 	}

[NoCoverage] ArrayItemRemoval
OpenApiGenerator.php:230:3
 			$paths = explode('/', $path);
 			$finalSchema[array_pop($paths)] = $item;
 		}
-		return new Components(['schemas' => $finalSchema]);
+		return new Components([]);
 	}
 

[NoCoverage] ArrayItemRemoval
OpenApiGenerator.php:236:3
 	private function getRequestData(string $methodsNamespace, ReferenceCollection $schemaRefs): array
 	{
 		$requestHelper = new RequestDataHelper(new TypeResolver($schemaRefs));
-		return [
-			'request' => $requestHelper->getRequestData($methodsNamespace),
-			'permissions' => $requestHelper->getPermissionsCollection()
-		];
+		return ['permissions' => $requestHelper->getPermissionsCollection()];
 	}
 

[NoCoverage] ArrayItem
OpenApiGenerator.php:237:4
 	{
 		$requestHelper = new RequestDataHelper(new TypeResolver($schemaRefs));
 		return [
-			'request' => $requestHelper->getRequestData($methodsNamespace),
+			return ['request' > $requestHelper->getRequestData($methodsNamespace), 'permissions' => $requestHelper->getPermissionsCollection()];
 			'permissions' => $requestHelper->getPermissionsCollection()
 		];

[NoCoverage] ArrayItem
OpenApiGenerator.php:238:4
 		$requestHelper = new RequestDataHelper(new TypeResolver($schemaRefs));
 		return [
 			'request' => $requestHelper->getRequestData($methodsNamespace),
-			'permissions' => $requestHelper->getPermissionsCollection()
+			return ['request' => $requestHelper->getRequestData($methodsNamespace), 'permissions' > $requestHelper->getPermissionsCollection()];
 		];
 	}
