[Killed] PublicVisibility
ExceptionsHelper/FunctionsCollection.php:17:2
 	private array $exceptionCollection = [];
 	private array $scannedFunction = [];
 
-	public function resolve(
+	protected function resolve(string $objectClassName, array $data, Container $container) : void
 		string $objectClassName,
 		array $data,
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
                                                                                                                                         
  [Error] Call to protected method OpenApi\ExceptionsHelper\FunctionsCollection::resolve() from scope OpenApi\ExceptionsRespons

[Killed] UnwrapTrim
ExceptionsHelper/FunctionsCollection.php:22:3
 		array $data,
 		Container $container
 	): void {
-		$objectClassName = trim($objectClassName);
+		$objectClassName = $objectClassName;
 		if (class_exists($objectClassName) && !enum_exists($objectClassName) && $this->objectIsNotSpl($objectClassName)) {
 			$current = array_shift($data);
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 4 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] LogicalAndSingleSubExprNegation
ExceptionsHelper/FunctionsCollection.php:23:3
 		Container $container
 	): void {
 		$objectClassName = trim($objectClassName);
-		if (class_exists($objectClassName) && !enum_exists($objectClassName) && $this->objectIsNotSpl($objectClassName)) {
+		if (class_exists($objectClassName) && !enum_exists($objectClassName) && !$this->objectIsNotSpl($objectClassName)) {
 			$current = array_shift($data);
 			if (!isset($this->scannedFunction[$objectClassName]) || (isset($this->scannedFunction[$objectClassName]) && !in_array($current,
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 0 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] LogicalAndNegation
ExceptionsHelper/FunctionsCollection.php:23:3
 		Container $container
 	): void {
 		$objectClassName = trim($objectClassName);
-		if (class_exists($objectClassName) && !enum_exists($objectClassName) && $this->objectIsNotSpl($objectClassName)) {
+		if (!(class_exists($objectClassName) && !enum_exists($objectClassName) && $this->objectIsNotSpl($objectClassName))) {
 			$current = array_shift($data);
 			if (!isset($this->scannedFunction[$objectClassName]) || (isset($this->scannedFunction[$objectClassName]) && !in_array($current,
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 0 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] LogicalOr
ExceptionsHelper/FunctionsCollection.php:25:4
 		$objectClassName = trim($objectClassName);
 		if (class_exists($objectClassName) && !enum_exists($objectClassName) && $this->objectIsNotSpl($objectClassName)) {
 			$current = array_shift($data);
-			if (!isset($this->scannedFunction[$objectClassName]) || (isset($this->scannedFunction[$objectClassName]) && !in_array($current,
-						$this->scannedFunction[$objectClassName]))) {
+			if (!isset($this->scannedFunction[$objectClassName]) && (isset($this->scannedFunction[$objectClassName]) && !in_array($current, $this->scannedFunction[$objectClassName]))) {
 				$this->scannedFunction[$objectClassName][] = $current;
 				try {
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 0 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] LogicalOrNegation
ExceptionsHelper/FunctionsCollection.php:25:4
 		$objectClassName = trim($objectClassName);
 		if (class_exists($objectClassName) && !enum_exists($objectClassName) && $this->objectIsNotSpl($objectClassName)) {
 			$current = array_shift($data);
-			if (!isset($this->scannedFunction[$objectClassName]) || (isset($this->scannedFunction[$objectClassName]) && !in_array($current,
-						$this->scannedFunction[$objectClassName]))) {
+			if (!(!isset($this->scannedFunction[$objectClassName]) || isset($this->scannedFunction[$objectClassName]) && !in_array($current, $this->scannedFunction[$objectClassName]))) {
 				$this->scannedFunction[$objectClassName][] = $current;
 				try {
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 0 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] IfNegation
ExceptionsHelper/FunctionsCollection.php:36:5
 					$reflection = new \ReflectionClass($contextRealObject);
 				}
 
-				if ($reflection->hasProperty($current)) {
-					$property = $reflection->getProperty($current);
-					$property->setAccessible(true);
-					if ($property->getType() instanceof ReflectionNamedType) {
-						try {
-							$object = $container->get($property->getValue($contextRealObject)::class);
-						} catch (\Throwable $exception) {
-							try {
-								$object = $container->get($property->getType()->getName());
-							} catch (\Throwable $exception) {
-								return;
-							}
-						}
-						$this->resolve($object::class, $data, $container);
-					} else {
-						throw new \Exception("Тип должен быть только один!");
-					}
-				} elseif ($reflection->hasMethod($current)) {
-					$this->collectExceptions($objectClassName, $current);
-					$functionCode = $this->findFunctionsCode($current, $objectClassName);
-					$this->parseFunctionsUsedInFunction($functionCode, $objectClassName, $container);
-				}
+				if (!$reflection->hasProperty($current)) {
 			}
 		}
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
                                                                                                                               
  [ReflectionException] Property Unit\OpenApi\ExceptionsResponsesExample\TestMethodExceptionsExample::$execute does not exist

[Survived] MethodCallRemoval
ExceptionsHelper/FunctionsCollection.php:38:6
 
 				if ($reflection->hasProperty($current)) {
 					$property = $reflection->getProperty($current);
-					$property->setAccessible(true);
+					
 					if ($property->getType() instanceof ReflectionNamedType) {
 						try {

[Survived] TrueValue
ExceptionsHelper/FunctionsCollection.php:38:6
 
 				if ($reflection->hasProperty($current)) {
 					$property = $reflection->getProperty($current);
-					$property->setAccessible(true);
+					$property->setAccessible(false);
 					if ($property->getType() instanceof ReflectionNamedType) {
 						try {

[Killed] InstanceOf_
ExceptionsHelper/FunctionsCollection.php:39:6
 				if ($reflection->hasProperty($current)) {
 					$property = $reflection->getProperty($current);
 					$property->setAccessible(true);
-					if ($property->getType() instanceof ReflectionNamedType) {
+					if (false) {
 						try {
 							$object = $container->get($property->getValue($contextRealObject)::class);
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
                                            
  [Exception] Тип должен быть только один!  
                                            
#1  /var/www/kernel-api-framework/OpenApi/ExceptionsHelper/FunctionsCollection.php:43
#2  /var/www/kernel-api-framework/OpenApi/Ex

[Survived] InstanceOf_
ExceptionsHelper/FunctionsCollection.php:39:6
 				if ($reflection->hasProperty($current)) {
 					$property = $reflection->getProperty($current);
 					$property->setAccessible(true);
-					if ($property->getType() instanceof ReflectionNamedType) {
+					if (true) {
 						try {
 							$object = $container->get($property->getValue($contextRealObject)::class);

[Killed] MethodCallRemoval
ExceptionsHelper/FunctionsCollection.php:49:7
 								return;
 							}
 						}
-						$this->resolve($object::class, $data, $container);
+						
 					} else {
 						throw new \Exception("Тип должен быть только один!");
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 5 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[NoCoverage] Throw_
ExceptionsHelper/FunctionsCollection.php:51:7
 						}
 						$this->resolve($object::class, $data, $container);
 					} else {
-						throw new \Exception("Тип должен быть только один!");
+						new \Exception("Тип должен быть только один!");
 					}
 				} elseif ($reflection->hasMethod($current)) {

[Killed] ElseIfNegation
ExceptionsHelper/FunctionsCollection.php:53:5
 					} else {
 						throw new \Exception("Тип должен быть только один!");
 					}
-				} elseif ($reflection->hasMethod($current)) {
-					$this->collectExceptions($objectClassName, $current);
-					$functionCode = $this->findFunctionsCode($current, $objectClassName);
-					$this->parseFunctionsUsedInFunction($functionCode, $objectClassName, $container);
-				}
+				} elseif (!$reflection->hasMethod($current)) {
 			}
 		}
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 0 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] MethodCallRemoval
ExceptionsHelper/FunctionsCollection.php:54:6
 						throw new \Exception("Тип должен быть только один!");
 					}
 				} elseif ($reflection->hasMethod($current)) {
-					$this->collectExceptions($objectClassName, $current);
+					
 					$functionCode = $this->findFunctionsCode($current, $objectClassName);
 					$this->parseFunctionsUsedInFunction($functionCode, $objectClassName, $container);
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 0 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] MethodCallRemoval
ExceptionsHelper/FunctionsCollection.php:56:6
 				} elseif ($reflection->hasMethod($current)) {
 					$this->collectExceptions($objectClassName, $current);
 					$functionCode = $this->findFunctionsCode($current, $objectClassName);
-					$this->parseFunctionsUsedInFunction($functionCode, $objectClassName, $container);
+					
 				}
 			}
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 2 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] GreaterThanNegotiation
ExceptionsHelper/FunctionsCollection.php:65:3
 	private function objectIsNotSpl(string $className)
 	{
 		$exploded = explode('\\', $className);
-		return count($exploded) > 1;
+		return count($exploded) <= 1;
 	}
 
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 0 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Survived] GreaterThan
ExceptionsHelper/FunctionsCollection.php:65:3
 	private function objectIsNotSpl(string $className)
 	{
 		$exploded = explode('\\', $className);
-		return count($exploded) > 1;
+		return count($exploded) >= 1;
 	}
 

[Killed] MethodCallRemoval
ExceptionsHelper/FunctionsCollection.php:72:3
 		string $analasingClassName,
 		string $analasingFunctionName
 	): void {
-		$this->getMethodThrowsByDocBlock($analasingClassName, $analasingFunctionName);
+		
 	}
 
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 0 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[NoCoverage] DecrementInteger
ExceptionsHelper/FunctionsCollection.php:81:4
 		try {
 			$docs = $parser->getMethodDocs($functionName);
 		} catch (\Throwable $exception) {
-			$abc = 123;
+			$abc = 122;
 		}
 

[NoCoverage] IncrementInteger
ExceptionsHelper/FunctionsCollection.php:81:4
 		try {
 			$docs = $parser->getMethodDocs($functionName);
 		} catch (\Throwable $exception) {
-			$abc = 123;
+			$abc = 124;
 		}
 

[Killed] NotIdentical
ExceptionsHelper/FunctionsCollection.php:84:3
 			$abc = 123;
 		}
 
-		if ($docs !== false) {
+		if ($docs === false) {
 			$phpDocNode = $parser->getPhpDocNode($docs);
 			if (!empty($phpDocNode->getThrowsTagValues())) {
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 0 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Survived] FalseValue
ExceptionsHelper/FunctionsCollection.php:84:3
 			$abc = 123;
 		}
 
-		if ($docs !== false) {
+		if ($docs !== true) {
 			$phpDocNode = $parser->getPhpDocNode($docs);
 			if (!empty($phpDocNode->getThrowsTagValues())) {

[Killed] LogicalNot
ExceptionsHelper/FunctionsCollection.php:86:4
 
 		if ($docs !== false) {
 			$phpDocNode = $parser->getPhpDocNode($docs);
-			if (!empty($phpDocNode->getThrowsTagValues())) {
+			if (empty($phpDocNode->getThrowsTagValues())) {
 				$node = $phpDocNode->getThrowsTagValues();
 				foreach ($node as $item) {
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 0 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] Foreach_
ExceptionsHelper/FunctionsCollection.php:88:5
 			$phpDocNode = $parser->getPhpDocNode($docs);
 			if (!empty($phpDocNode->getThrowsTagValues())) {
 				$node = $phpDocNode->getThrowsTagValues();
-				foreach ($node as $item) {
-					$this->exceptionCollection = array_merge($this->exceptionCollection,
-						explode('|', $parser->convert($item)));
-				}
+				foreach (array() as $item) {
 			}
 		}
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 0 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Survived] FalseValue
ExceptionsHelper/FunctionsCollection.php:106:4
 	): array {
 		try {
 			$objectCode = file($this->resolveClassFilePath($objectNameSpace, $functionName));
-			$insideFunction = false;
+			$insideFunction = true;
 			$functionLines = [];
 			$regex = "/.*(?<!->)$functionName\s*\(/";

[Killed] Foreach_
ExceptionsHelper/FunctionsCollection.php:110:4
 			$functionLines = [];
 			$regex = "/.*(?<!->)$functionName\s*\(/";
 			$exitLine = count($objectCode);
-			foreach ($objectCode as $key => $line) {
-				if (
-					!empty(preg_match($regex, $line, $matches))
-					&& !empty(preg_match('/(.*)function(.*)/', $line, $matches))
-					&& !empty(preg_match('/(.*){(.*)/', $objectCode[$key + 1], $matches))
-					&& !$insideFunction
-				) {
-					// Начало функции execute
-					$insideFunction = true;
-					$exitLine = $this->findFunctionEndLine($key, $objectCode);
-				}
-				if ($insideFunction && !empty($line)) {
-					$functionLines[] = trim($line);
-				}
-				if ($key == $exitLine) {
-					break;
-				}
-			}
+			foreach (array() as $key => $line) {
 			return $functionLines;
 		} catch (\Throwable $exception) {
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 2 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] PregMatchMatches
ExceptionsHelper/FunctionsCollection.php:112:6
 			$exitLine = count($objectCode);
 			foreach ($objectCode as $key => $line) {
 				if (
-					!empty(preg_match($regex, $line, $matches))
+					if (!empty((int) ($matches = array())) && !empty(preg_match('/(.*)function(.*)/', $line, $matches)) && !empty(preg_match('/(.*){(.*)/', $objectCode[$key + 1], $matches)) && !$insideFunction) {
 					&& !empty(preg_match('/(.*)function(.*)/', $line, $matches))
 					&& !empty(preg_match('/(.*){(.*)/', $objectCode[$key + 1], $matches))
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 2 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] PregMatchMatches
ExceptionsHelper/FunctionsCollection.php:113:6
 			foreach ($objectCode as $key => $line) {
 				if (
 					!empty(preg_match($regex, $line, $matches))
-					&& !empty(preg_match('/(.*)function(.*)/', $line, $matches))
+					if (!empty(preg_match($regex, $line, $matches)) && !empty((int) ($matches = array())) && !empty(preg_match('/(.*){(.*)/', $objectCode[$key + 1], $matches)) && !$insideFunction) {
 					&& !empty(preg_match('/(.*){(.*)/', $objectCode[$key + 1], $matches))
 					&& !$insideFunction
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 2 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] PregMatchMatches
ExceptionsHelper/FunctionsCollection.php:114:6
 				if (
 					!empty(preg_match($regex, $line, $matches))
 					&& !empty(preg_match('/(.*)function(.*)/', $line, $matches))
-					&& !empty(preg_match('/(.*){(.*)/', $objectCode[$key + 1], $matches))
+					if (!empty(preg_match($regex, $line, $matches)) && !empty(preg_match('/(.*)function(.*)/', $line, $matches)) && !empty((int) ($matches = array())) && !$insideFunction) {
 					&& !$insideFunction
 				) {
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 2 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] TrueValue
ExceptionsHelper/FunctionsCollection.php:118:6
 					&& !$insideFunction
 				) {
 					// Начало функции execute
-					$insideFunction = true;
+					$insideFunction = false;
 					$exitLine = $this->findFunctionEndLine($key, $objectCode);
 				}
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 2 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] LogicalAndSingleSubExprNegation
ExceptionsHelper/FunctionsCollection.php:121:5
 					$insideFunction = true;
 					$exitLine = $this->findFunctionEndLine($key, $objectCode);
 				}
-				if ($insideFunction && !empty($line)) {
+				if (!$insideFunction && !empty($line)) {
 					$functionLines[] = trim($line);
 				}
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 2 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] LogicalNot
ExceptionsHelper/FunctionsCollection.php:121:5
 					$insideFunction = true;
 					$exitLine = $this->findFunctionEndLine($key, $objectCode);
 				}
-				if ($insideFunction && !empty($line)) {
+				if ($insideFunction && empty($line)) {
 					$functionLines[] = trim($line);
 				}
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 2 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Survived] UnwrapTrim
ExceptionsHelper/FunctionsCollection.php:122:6
 					$exitLine = $this->findFunctionEndLine($key, $objectCode);
 				}
 				if ($insideFunction && !empty($line)) {
-					$functionLines[] = trim($line);
+					$functionLines[] = $line;
 				}
 				if ($key == $exitLine) {

[Killed] AssignmentEqual
ExceptionsHelper/FunctionsCollection.php:124:5
 				if ($insideFunction && !empty($line)) {
 					$functionLines[] = trim($line);
 				}
-				if ($key == $exitLine) {
+				if ($key = $exitLine) {
 					break;
 				}
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 2 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] Equal
ExceptionsHelper/FunctionsCollection.php:124:5
 				if ($insideFunction && !empty($line)) {
 					$functionLines[] = trim($line);
 				}
-				if ($key == $exitLine) {
+				if ($key != $exitLine) {
 					break;
 				}
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 2 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Survived] Break_
ExceptionsHelper/FunctionsCollection.php:125:6
 					$functionLines[] = trim($line);
 				}
 				if ($key == $exitLine) {
-					break;
+					continue;
 				}
 			}

[Killed] DecrementInteger
ExceptionsHelper/FunctionsCollection.php:143:3
 		int $startLine,
 		array $objectCode
 	): int {
-		$curlyBrace = 0;
+		$curlyBrace = -1;
 		$countStarted = false;
 		for ($i = $startLine; $i < count($objectCode); ++$i) {
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 2 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] FalseValue
ExceptionsHelper/FunctionsCollection.php:144:3
 		array $objectCode
 	): int {
 		$curlyBrace = 0;
-		$countStarted = false;
+		$countStarted = true;
 		for ($i = $startLine; $i < count($objectCode); ++$i) {
 			$str = $objectCode[$i];
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 2 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] LessThanNegotiation
ExceptionsHelper/FunctionsCollection.php:145:3
 	): int {
 		$curlyBrace = 0;
 		$countStarted = false;
-		for ($i = $startLine; $i < count($objectCode); ++$i) {
+		for ($i = $startLine; $i >= count($objectCode); ++$i) {
 			$str = $objectCode[$i];
 			$strLength = strlen($str);
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
                                                                                                                                    
  [TypeError] OpenApi\ExceptionsHelper\FunctionsCollection::findFunctionsCode(): Return value must be of type array, none returned

[Killed] For_
ExceptionsHelper/FunctionsCollection.php:145:3
 	): int {
 		$curlyBrace = 0;
 		$countStarted = false;
-		for ($i = $startLine; $i < count($objectCode); ++$i) {
-			$str = $objectCode[$i];
-			$strLength = strlen($str);
-			for ($symbolCount = 0; $symbolCount < $strLength; $symbolCount++) {
-				$char = $str[$symbolCount];
-				if ($char == '{') {
-					$curlyBrace++;
-					$countStarted = true;
-				}
-				if ($char == '}') {
-					$curlyBrace--;
-				}
-				if ($countStarted && $curlyBrace === 0) {
-					return $i;
-				}
-			}
-		}
+		for ($i = $startLine; false; ++$i) {
 		throw new \Exception('Ошибка синтаксиса файла');
 	}
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
                                                                                                                                    
  [TypeError] OpenApi\ExceptionsHelper\FunctionsCollection::findFunctionsCode(): Return value must be of type array, none returned

[Killed] For_
ExceptionsHelper/FunctionsCollection.php:148:4
 		for ($i = $startLine; $i < count($objectCode); ++$i) {
 			$str = $objectCode[$i];
 			$strLength = strlen($str);
-			for ($symbolCount = 0; $symbolCount < $strLength; $symbolCount++) {
-				$char = $str[$symbolCount];
-				if ($char == '{') {
-					$curlyBrace++;
-					$countStarted = true;
-				}
-				if ($char == '}') {
-					$curlyBrace--;
-				}
-				if ($countStarted && $curlyBrace === 0) {
-					return $i;
-				}
-			}
+			for ($symbolCount = 0; false; $symbolCount++) {
 		}
 		throw new \Exception('Ошибка синтаксиса файла');
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
                                                                                                                                    
  [TypeError] OpenApi\ExceptionsHelper\FunctionsCollection::findFunctionsCode(): Return value must be of type array, none returned
