[Killed] LessThanNegotiation
ExceptionsHelper/FunctionsCollection.php:148:4
 		for ($i = $startLine; $i < count($objectCode); ++$i) {
 			$str = $objectCode[$i];
 			$strLength = strlen($str);
-			for ($symbolCount = 0; $symbolCount < $strLength; $symbolCount++) {
+			for ($symbolCount = 0; $symbolCount >= $strLength; $symbolCount++) {
 				$char = $str[$symbolCount];
 				if ($char == '{') {
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
                                                                                                                                    
  [TypeError] OpenApi\ExceptionsHelper\FunctionsCollection::findFunctionsCode(): Return value must be of type array, none returned

[Killed] Equal
ExceptionsHelper/FunctionsCollection.php:150:5
 			$strLength = strlen($str);
 			for ($symbolCount = 0; $symbolCount < $strLength; $symbolCount++) {
 				$char = $str[$symbolCount];
-				if ($char == '{') {
+				if ($char != '{') {
 					$curlyBrace++;
 					$countStarted = true;
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
                                                                                                                                    
  [TypeError] OpenApi\ExceptionsHelper\FunctionsCollection::findFunctionsCode(): Return value must be of type array, none returned

[Killed] AssignmentEqual
ExceptionsHelper/FunctionsCollection.php:150:5
 			$strLength = strlen($str);
 			for ($symbolCount = 0; $symbolCount < $strLength; $symbolCount++) {
 				$char = $str[$symbolCount];
-				if ($char == '{') {
+				if ($char = '{') {
 					$curlyBrace++;
 					$countStarted = true;
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
                                                                                                                                    
  [TypeError] OpenApi\ExceptionsHelper\FunctionsCollection::findFunctionsCode(): Return value must be of type array, none returned

[Killed] Increment
ExceptionsHelper/FunctionsCollection.php:151:6
 			for ($symbolCount = 0; $symbolCount < $strLength; $symbolCount++) {
 				$char = $str[$symbolCount];
 				if ($char == '{') {
-					$curlyBrace++;
+					$curlyBrace--;
 					$countStarted = true;
 				}
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
                                                                                                                                    
  [TypeError] OpenApi\ExceptionsHelper\FunctionsCollection::findFunctionsCode(): Return value must be of type array, none returned

[Killed] TrueValue
ExceptionsHelper/FunctionsCollection.php:152:6
 				$char = $str[$symbolCount];
 				if ($char == '{') {
 					$curlyBrace++;
-					$countStarted = true;
+					$countStarted = false;
 				}
 				if ($char == '}') {
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
                                                                                                                                    
  [TypeError] OpenApi\ExceptionsHelper\FunctionsCollection::findFunctionsCode(): Return value must be of type array, none returned

[Killed] Equal
ExceptionsHelper/FunctionsCollection.php:154:5
 					$curlyBrace++;
 					$countStarted = true;
 				}
-				if ($char == '}') {
+				if ($char != '}') {
 					$curlyBrace--;
 				}
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
                                                                                                                                    
  [TypeError] OpenApi\ExceptionsHelper\FunctionsCollection::findFunctionsCode(): Return value must be of type array, none returned

[Killed] AssignmentEqual
ExceptionsHelper/FunctionsCollection.php:154:5
 					$curlyBrace++;
 					$countStarted = true;
 				}
-				if ($char == '}') {
+				if ($char = '}') {
 					$curlyBrace--;
 				}
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
                                                                                                                                    
  [TypeError] OpenApi\ExceptionsHelper\FunctionsCollection::findFunctionsCode(): Return value must be of type array, none returned

[Killed] Decrement
ExceptionsHelper/FunctionsCollection.php:155:6
 					$countStarted = true;
 				}
 				if ($char == '}') {
-					$curlyBrace--;
+					$curlyBrace++;
 				}
 				if ($countStarted && $curlyBrace === 0) {
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
                                                                                                                                    
  [TypeError] OpenApi\ExceptionsHelper\FunctionsCollection::findFunctionsCode(): Return value must be of type array, none returned

[Killed] LogicalAndAllSubExprNegation
ExceptionsHelper/FunctionsCollection.php:157:5
 				if ($char == '}') {
 					$curlyBrace--;
 				}
-				if ($countStarted && $curlyBrace === 0) {
+				if (!$countStarted && !($curlyBrace === 0)) {
 					return $i;
 				}
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
                                                                                                                                    
  [TypeError] OpenApi\ExceptionsHelper\FunctionsCollection::findFunctionsCode(): Return value must be of type array, none returned

[Killed] Identical
ExceptionsHelper/FunctionsCollection.php:157:5
 				if ($char == '}') {
 					$curlyBrace--;
 				}
-				if ($countStarted && $curlyBrace === 0) {
+				if ($countStarted && $curlyBrace !== 0) {
 					return $i;
 				}
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 2 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[NoCoverage] Throw_
ExceptionsHelper/FunctionsCollection.php:162:3
 				}
 			}
 		}
-		throw new \Exception('Ошибка синтаксиса файла');
+		new \Exception('Ошибка синтаксиса файла');
 	}
 

[Killed] PregMatchMatches
ExceptionsHelper/FunctionsCollection.php:174:4
 		Container $container
 	): void {
 		foreach ($functionCode as $line) {
-			if (preg_match('/\$this->(?:\w+->)*\w+(?=\()/', $line, $matches)) {
+			if ((int) ($matches = array())) {
 				$callsTrace = explode('->', $matches[0]);
 				unset($callsTrace[0]);
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 5 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] IfNegation
ExceptionsHelper/FunctionsCollection.php:174:4
 		Container $container
 	): void {
 		foreach ($functionCode as $line) {
-			if (preg_match('/\$this->(?:\w+->)*\w+(?=\()/', $line, $matches)) {
-				$callsTrace = explode('->', $matches[0]);
-				unset($callsTrace[0]);
-				$this->resolve($contextClassName, $callsTrace, $container);
-			}
+			if (!preg_match('/\\$this->(?:\\w+->)*\\w+(?=\\()/', $line, $matches)) {
 			if (preg_match('/self::\w+(?=\()/', $line, $matches)) {
 				$callsTrace = explode('::', $matches[0]);
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 5 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] IncrementInteger
ExceptionsHelper/FunctionsCollection.php:175:5
 	): void {
 		foreach ($functionCode as $line) {
 			if (preg_match('/\$this->(?:\w+->)*\w+(?=\()/', $line, $matches)) {
-				$callsTrace = explode('->', $matches[0]);
+				$callsTrace = explode('->', $matches[1]);
 				unset($callsTrace[0]);
 				$this->resolve($contextClassName, $callsTrace, $container);
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 5 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] IncrementInteger
ExceptionsHelper/FunctionsCollection.php:176:5
 		foreach ($functionCode as $line) {
 			if (preg_match('/\$this->(?:\w+->)*\w+(?=\()/', $line, $matches)) {
 				$callsTrace = explode('->', $matches[0]);
-				unset($callsTrace[0]);
+				unset($callsTrace[1]);
 				$this->resolve($contextClassName, $callsTrace, $container);
 			}
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 5 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] MethodCallRemoval
ExceptionsHelper/FunctionsCollection.php:177:5
 			if (preg_match('/\$this->(?:\w+->)*\w+(?=\()/', $line, $matches)) {
 				$callsTrace = explode('->', $matches[0]);
 				unset($callsTrace[0]);
-				$this->resolve($contextClassName, $callsTrace, $container);
+				
 			}
 			if (preg_match('/self::\w+(?=\()/', $line, $matches)) {
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 5 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] IfNegation
ExceptionsHelper/FunctionsCollection.php:179:4
 				unset($callsTrace[0]);
 				$this->resolve($contextClassName, $callsTrace, $container);
 			}
-			if (preg_match('/self::\w+(?=\()/', $line, $matches)) {
-				$callsTrace = explode('::', $matches[0]);
-				unset($callsTrace[0]);
-				$this->resolve($contextClassName, $callsTrace, $container);
-			}
+			if (!preg_match('/self::\\w+(?=\\()/', $line, $matches)) {
 			if (preg_match('/\$(?!\s*this\s*\b)\w+->(?:\w+->)*\w+(?=\()/', $line, $matches)) {
 				$callsTrace = explode('->', $matches[0]);
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 5 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] PregMatchMatches
ExceptionsHelper/FunctionsCollection.php:179:4
 				unset($callsTrace[0]);
 				$this->resolve($contextClassName, $callsTrace, $container);
 			}
-			if (preg_match('/self::\w+(?=\()/', $line, $matches)) {
+			if ((int) ($matches = array())) {
 				$callsTrace = explode('::', $matches[0]);
 				unset($callsTrace[0]);
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 5 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] IncrementInteger
ExceptionsHelper/FunctionsCollection.php:180:5
 				$this->resolve($contextClassName, $callsTrace, $container);
 			}
 			if (preg_match('/self::\w+(?=\()/', $line, $matches)) {
-				$callsTrace = explode('::', $matches[0]);
+				$callsTrace = explode('::', $matches[1]);
 				unset($callsTrace[0]);
 				$this->resolve($contextClassName, $callsTrace, $container);
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 5 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] IncrementInteger
ExceptionsHelper/FunctionsCollection.php:181:5
 			}
 			if (preg_match('/self::\w+(?=\()/', $line, $matches)) {
 				$callsTrace = explode('::', $matches[0]);
-				unset($callsTrace[0]);
+				unset($callsTrace[1]);
 				$this->resolve($contextClassName, $callsTrace, $container);
 			}
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 5 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] PregMatchMatches
ExceptionsHelper/FunctionsCollection.php:184:4
 				unset($callsTrace[0]);
 				$this->resolve($contextClassName, $callsTrace, $container);
 			}
-			if (preg_match('/\$(?!\s*this\s*\b)\w+->(?:\w+->)*\w+(?=\()/', $line, $matches)) {
+			if ((int) ($matches = array())) {
 				$callsTrace = explode('->', $matches[0]);
 				$className = $this->getClassNameByVariableInCode($callsTrace[0], $functionCode, $contextClassName);
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 5 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] IfNegation
ExceptionsHelper/FunctionsCollection.php:184:4
 				unset($callsTrace[0]);
 				$this->resolve($contextClassName, $callsTrace, $container);
 			}
-			if (preg_match('/\$(?!\s*this\s*\b)\w+->(?:\w+->)*\w+(?=\()/', $line, $matches)) {
-				$callsTrace = explode('->', $matches[0]);
-				$className = $this->getClassNameByVariableInCode($callsTrace[0], $functionCode, $contextClassName);
-				if (!empty($className)) {
-					unset($callsTrace[0]);
-					$this->resolve($className, $callsTrace, $container);
-				}
-			}
+			if (!preg_match('/\\$(?!\\s*this\\s*\\b)\\w+->(?:\\w+->)*\\w+(?=\\()/', $line, $matches)) {
 			if (preg_match('/\$[a-zA-Z_][a-zA-Z0-9_]*::\w+\(/', $line, $matches)) {
 				$callsTrace = explode('::', $matches[0]);
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 5 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] IncrementInteger
ExceptionsHelper/FunctionsCollection.php:185:5
 				$this->resolve($contextClassName, $callsTrace, $container);
 			}
 			if (preg_match('/\$(?!\s*this\s*\b)\w+->(?:\w+->)*\w+(?=\()/', $line, $matches)) {
-				$callsTrace = explode('->', $matches[0]);
+				$callsTrace = explode('->', $matches[1]);
 				$className = $this->getClassNameByVariableInCode($callsTrace[0], $functionCode, $contextClassName);
 				if (!empty($className)) {
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 5 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] IncrementInteger
ExceptionsHelper/FunctionsCollection.php:186:5
 			}
 			if (preg_match('/\$(?!\s*this\s*\b)\w+->(?:\w+->)*\w+(?=\()/', $line, $matches)) {
 				$callsTrace = explode('->', $matches[0]);
-				$className = $this->getClassNameByVariableInCode($callsTrace[0], $functionCode, $contextClassName);
+				$className = $this->getClassNameByVariableInCode($callsTrace[1], $functionCode, $contextClassName);
 				if (!empty($className)) {
 					unset($callsTrace[0]);
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 5 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] LogicalNot
ExceptionsHelper/FunctionsCollection.php:187:5
 			if (preg_match('/\$(?!\s*this\s*\b)\w+->(?:\w+->)*\w+(?=\()/', $line, $matches)) {
 				$callsTrace = explode('->', $matches[0]);
 				$className = $this->getClassNameByVariableInCode($callsTrace[0], $functionCode, $contextClassName);
-				if (!empty($className)) {
+				if (empty($className)) {
 					unset($callsTrace[0]);
 					$this->resolve($className, $callsTrace, $container);
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 5 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] IncrementInteger
ExceptionsHelper/FunctionsCollection.php:188:6
 				$callsTrace = explode('->', $matches[0]);
 				$className = $this->getClassNameByVariableInCode($callsTrace[0], $functionCode, $contextClassName);
 				if (!empty($className)) {
-					unset($callsTrace[0]);
+					unset($callsTrace[1]);
 					$this->resolve($className, $callsTrace, $container);
 				}
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 5 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] MethodCallRemoval
ExceptionsHelper/FunctionsCollection.php:189:6
 				$className = $this->getClassNameByVariableInCode($callsTrace[0], $functionCode, $contextClassName);
 				if (!empty($className)) {
 					unset($callsTrace[0]);
-					$this->resolve($className, $callsTrace, $container);
+					
 				}
 			}
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 5 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Survived] PregMatchMatches
ExceptionsHelper/FunctionsCollection.php:192:4
 					$this->resolve($className, $callsTrace, $container);
 				}
 			}
-			if (preg_match('/\$[a-zA-Z_][a-zA-Z0-9_]*::\w+\(/', $line, $matches)) {
+			if ((int) ($matches = array())) {
 				$callsTrace = explode('::', $matches[0]);
 				$className = $this->getClassNameByVariableInCode($callsTrace[0], $functionCode, $contextClassName);

[Survived] IfNegation
ExceptionsHelper/FunctionsCollection.php:192:4
 					$this->resolve($className, $callsTrace, $container);
 				}
 			}
-			if (preg_match('/\$[a-zA-Z_][a-zA-Z0-9_]*::\w+\(/', $line, $matches)) {
-				$callsTrace = explode('::', $matches[0]);
-				$className = $this->getClassNameByVariableInCode($callsTrace[0], $functionCode, $contextClassName);
-				if (!empty($className)) {
-					unset($callsTrace[0]);
-					$this->resolve($className, $callsTrace, $container);
-				}
-			}
+			if (!preg_match('/\\$[a-zA-Z_][a-zA-Z0-9_]*::\\w+\\(/', $line, $matches)) {
 			if (preg_match('/((?<![\$a-zA-Z0-9_])(?!self::|static::|parent::)\b[a-zA-Z_][a-zA-Z0-9_]*)::(\w+\b)/',
 				$line,

[Survived] IncrementInteger
ExceptionsHelper/FunctionsCollection.php:193:5
 				}
 			}
 			if (preg_match('/\$[a-zA-Z_][a-zA-Z0-9_]*::\w+\(/', $line, $matches)) {
-				$callsTrace = explode('::', $matches[0]);
+				$callsTrace = explode('::', $matches[1]);
 				$className = $this->getClassNameByVariableInCode($callsTrace[0], $functionCode, $contextClassName);
 				if (!empty($className)) {

[Survived] IncrementInteger
ExceptionsHelper/FunctionsCollection.php:194:5
 			}
 			if (preg_match('/\$[a-zA-Z_][a-zA-Z0-9_]*::\w+\(/', $line, $matches)) {
 				$callsTrace = explode('::', $matches[0]);
-				$className = $this->getClassNameByVariableInCode($callsTrace[0], $functionCode, $contextClassName);
+				$className = $this->getClassNameByVariableInCode($callsTrace[1], $functionCode, $contextClassName);
 				if (!empty($className)) {
 					unset($callsTrace[0]);

[Killed] IfNegation
ExceptionsHelper/FunctionsCollection.php:200:4
 					$this->resolve($className, $callsTrace, $container);
 				}
 			}
-			if (preg_match('/((?<![\$a-zA-Z0-9_])(?!self::|static::|parent::)\b[a-zA-Z_][a-zA-Z0-9_]*)::(\w+\b)/',
-				$line,
-				$matches)) {
-				$nameSpace = $this->getNameSpaceFromVariableClass($contextClassName, $matches[1]);
-				if (!empty($nameSpace)) {
-					$this->resolve($nameSpace, [$matches[2]], $container);
-				}
-			}
+			if (!preg_match('/((?<![\\$a-zA-Z0-9_])(?!self::|static::|parent::)\\b[a-zA-Z_][a-zA-Z0-9_]*)::(\\w+\\b)/', $line, $matches)) {
 			if (preg_match('/static::\w+\(/', $line, $matches)) {
 				$abc = 123;
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
                                                                                                                                                                                                                                                                    
  [T

[Killed] PregMatchMatches
ExceptionsHelper/FunctionsCollection.php:200:4
 					$this->resolve($className, $callsTrace, $container);
 				}
 			}
-			if (preg_match('/((?<![\$a-zA-Z0-9_])(?!self::|static::|parent::)\b[a-zA-Z_][a-zA-Z0-9_]*)::(\w+\b)/',
-				$line,
-				$matches)) {
+			if ((int) ($matches = array())) {
 				$nameSpace = $this->getNameSpaceFromVariableClass($contextClassName, $matches[1]);
 				if (!empty($nameSpace)) {
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 5 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] IncrementInteger
ExceptionsHelper/FunctionsCollection.php:203:5
 			if (preg_match('/((?<![\$a-zA-Z0-9_])(?!self::|static::|parent::)\b[a-zA-Z_][a-zA-Z0-9_]*)::(\w+\b)/',
 				$line,
 				$matches)) {
-				$nameSpace = $this->getNameSpaceFromVariableClass($contextClassName, $matches[1]);
+				$nameSpace = $this->getNameSpaceFromVariableClass($contextClassName, $matches[2]);
 				if (!empty($nameSpace)) {
 					$this->resolve($nameSpace, [$matches[2]], $container);
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 5 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] DecrementInteger
ExceptionsHelper/FunctionsCollection.php:203:5
 			if (preg_match('/((?<![\$a-zA-Z0-9_])(?!self::|static::|parent::)\b[a-zA-Z_][a-zA-Z0-9_]*)::(\w+\b)/',
 				$line,
 				$matches)) {
-				$nameSpace = $this->getNameSpaceFromVariableClass($contextClassName, $matches[1]);
+				$nameSpace = $this->getNameSpaceFromVariableClass($contextClassName, $matches[0]);
 				if (!empty($nameSpace)) {
 					$this->resolve($nameSpace, [$matches[2]], $container);
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 5 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] LogicalNot
ExceptionsHelper/FunctionsCollection.php:204:5
 				$line,
 				$matches)) {
 				$nameSpace = $this->getNameSpaceFromVariableClass($contextClassName, $matches[1]);
-				if (!empty($nameSpace)) {
+				if (empty($nameSpace)) {
 					$this->resolve($nameSpace, [$matches[2]], $container);
 				}
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 5 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] IncrementInteger
ExceptionsHelper/FunctionsCollection.php:205:6
 				$matches)) {
 				$nameSpace = $this->getNameSpaceFromVariableClass($contextClassName, $matches[1]);
 				if (!empty($nameSpace)) {
-					$this->resolve($nameSpace, [$matches[2]], $container);
+					$this->resolve($nameSpace, [$matches[3]], $container);
 				}
 			}
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 5 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] DecrementInteger
ExceptionsHelper/FunctionsCollection.php:205:6
 				$matches)) {
 				$nameSpace = $this->getNameSpaceFromVariableClass($contextClassName, $matches[1]);
 				if (!empty($nameSpace)) {
-					$this->resolve($nameSpace, [$matches[2]], $container);
+					$this->resolve($nameSpace, [$matches[1]], $container);
 				}
 			}
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 5 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] IfNegation
ExceptionsHelper/FunctionsCollection.php:208:4
 					$this->resolve($nameSpace, [$matches[2]], $container);
 				}
 			}
-			if (preg_match('/static::\w+\(/', $line, $matches)) {
-				$abc = 123;
-				throw new \Exception();
-			}
+			if (!preg_match('/static::\\w+\\(/', $line, $matches)) {
 			if (preg_match('/parent::\w+\(/', $line, $matches)) {
 				$abc = 123;
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
                
  [Exception]   
                
#1  /var/www/kernel-api-framework/OpenApi/ExceptionsHelper/FunctionsCollection.php:177
#2  /var/www/kernel-api-framework/OpenApi/ExceptionsHelper/FunctionsCollection.php:48
#3  /var/www/kernel-api-framework/OpenApi

[Survived] PregMatchMatches
ExceptionsHelper/FunctionsCollection.php:208:4
 					$this->resolve($nameSpace, [$matches[2]], $container);
 				}
 			}
-			if (preg_match('/static::\w+\(/', $line, $matches)) {
+			if ((int) ($matches = array())) {
 				$abc = 123;
 				throw new \Exception();

[NoCoverage] DecrementInteger
ExceptionsHelper/FunctionsCollection.php:209:5
 				}
 			}
 			if (preg_match('/static::\w+\(/', $line, $matches)) {
-				$abc = 123;
+				$abc = 122;
 				throw new \Exception();
 			}

[NoCoverage] IncrementInteger
ExceptionsHelper/FunctionsCollection.php:209:5
 				}
 			}
 			if (preg_match('/static::\w+\(/', $line, $matches)) {
-				$abc = 123;
+				$abc = 124;
 				throw new \Exception();
 			}
