[NoCoverage] Throw_
ExceptionsHelper/FunctionsCollection.php:210:5
 			}
 			if (preg_match('/static::\w+\(/', $line, $matches)) {
 				$abc = 123;
-				throw new \Exception();
+				new \Exception();
 			}
 			if (preg_match('/parent::\w+\(/', $line, $matches)) {

[Killed] IfNegation
ExceptionsHelper/FunctionsCollection.php:212:4
 				$abc = 123;
 				throw new \Exception();
 			}
-			if (preg_match('/parent::\w+\(/', $line, $matches)) {
-				$abc = 123;
-				throw new \Exception();
-			}
+			if (!preg_match('/parent::\\w+\\(/', $line, $matches)) {
 		}
 	}
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
                
  [Exception]   
                
#1  /var/www/kernel-api-framework/OpenApi/ExceptionsHelper/FunctionsCollection.php:181
#2  /var/www/kernel-api-framework/OpenApi/ExceptionsHelper/FunctionsCollection.php:48
#3  /var/www/kernel-api-framework/OpenApi

[Survived] PregMatchMatches
ExceptionsHelper/FunctionsCollection.php:212:4
 				$abc = 123;
 				throw new \Exception();
 			}
-			if (preg_match('/parent::\w+\(/', $line, $matches)) {
+			if ((int) ($matches = array())) {
 				$abc = 123;
 				throw new \Exception();

[NoCoverage] IncrementInteger
ExceptionsHelper/FunctionsCollection.php:213:5
 				throw new \Exception();
 			}
 			if (preg_match('/parent::\w+\(/', $line, $matches)) {
-				$abc = 123;
+				$abc = 124;
 				throw new \Exception();
 			}

[NoCoverage] DecrementInteger
ExceptionsHelper/FunctionsCollection.php:213:5
 				throw new \Exception();
 			}
 			if (preg_match('/parent::\w+\(/', $line, $matches)) {
-				$abc = 123;
+				$abc = 122;
 				throw new \Exception();
 			}

[Killed] Concat
ExceptionsHelper/FunctionsCollection.php:225:3
 		string $contextObjectNameSpace
 	): string {
 		$variableClass = '';
-		$regex = '/\\' . $variable . '\s*=\s*new\s(.*)\(/';
+		$regex = '/\\' . '\\s*=\\s*new\\s(.*)\\(/' . $variable;
 		foreach ($functionCode as $line) {
 			if (preg_match($regex, $line, $matches)) {
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 5 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] ConcatOperandRemoval
ExceptionsHelper/FunctionsCollection.php:225:3
 		string $contextObjectNameSpace
 	): string {
 		$variableClass = '';
-		$regex = '/\\' . $variable . '\s*=\s*new\s(.*)\(/';
+		$regex = '/\\' . '\\s*=\\s*new\\s(.*)\\(/';
 		foreach ($functionCode as $line) {
 			if (preg_match($regex, $line, $matches)) {
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 5 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] Foreach_
ExceptionsHelper/FunctionsCollection.php:226:3
 	): string {
 		$variableClass = '';
 		$regex = '/\\' . $variable . '\s*=\s*new\s(.*)\(/';
-		foreach ($functionCode as $line) {
-			if (preg_match($regex, $line, $matches)) {
-				$variableClass = $matches[1];
-				break;
-			}
-		}
+		foreach (array() as $line) {
 		if (empty($variableClass)) {
 			return '';
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 5 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] PregMatchMatches
ExceptionsHelper/FunctionsCollection.php:227:4
 		$variableClass = '';
 		$regex = '/\\' . $variable . '\s*=\s*new\s(.*)\(/';
 		foreach ($functionCode as $line) {
-			if (preg_match($regex, $line, $matches)) {
+			if ((int) ($matches = array())) {
 				$variableClass = $matches[1];
 				break;
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 5 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] IfNegation
ExceptionsHelper/FunctionsCollection.php:227:4
 		$variableClass = '';
 		$regex = '/\\' . $variable . '\s*=\s*new\s(.*)\(/';
 		foreach ($functionCode as $line) {
-			if (preg_match($regex, $line, $matches)) {
-				$variableClass = $matches[1];
-				break;
-			}
+			if (!preg_match($regex, $line, $matches)) {
 		}
 		if (empty($variableClass)) {
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 5 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] DecrementInteger
ExceptionsHelper/FunctionsCollection.php:228:5
 		$regex = '/\\' . $variable . '\s*=\s*new\s(.*)\(/';
 		foreach ($functionCode as $line) {
 			if (preg_match($regex, $line, $matches)) {
-				$variableClass = $matches[1];
+				$variableClass = $matches[0];
 				break;
 			}
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 5 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] IncrementInteger
ExceptionsHelper/FunctionsCollection.php:228:5
 		$regex = '/\\' . $variable . '\s*=\s*new\s(.*)\(/';
 		foreach ($functionCode as $line) {
 			if (preg_match($regex, $line, $matches)) {
-				$variableClass = $matches[1];
+				$variableClass = $matches[2];
 				break;
 			}
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 5 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Survived] Break_
ExceptionsHelper/FunctionsCollection.php:229:5
 		foreach ($functionCode as $line) {
 			if (preg_match($regex, $line, $matches)) {
 				$variableClass = $matches[1];
-				break;
+				continue;
 			}
 		}

[Killed] Concat
ExceptionsHelper/FunctionsCollection.php:243:3
 		$reflectionClass = new ReflectionClass($contextObjectNameSpace);
 		$filename = $reflectionClass->getFileName();
 		$code = explode(PHP_EOL, file_get_contents($filename));
-		$regex = '/.*use(.*\\\\' . $variableClass . ')/';
+		$regex = '/.*use(.*\\\\' . ')/' . $variableClass;
 		$namespace = '';
 		foreach ($code as $line) {
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 4 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] ConcatOperandRemoval
ExceptionsHelper/FunctionsCollection.php:243:3
 		$reflectionClass = new ReflectionClass($contextObjectNameSpace);
 		$filename = $reflectionClass->getFileName();
 		$code = explode(PHP_EOL, file_get_contents($filename));
-		$regex = '/.*use(.*\\\\' . $variableClass . ')/';
+		$regex = '/.*use(.*\\\\' . ')/';
 		$namespace = '';
 		foreach ($code as $line) {
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 4 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] Foreach_
ExceptionsHelper/FunctionsCollection.php:245:3
 		$code = explode(PHP_EOL, file_get_contents($filename));
 		$regex = '/.*use(.*\\\\' . $variableClass . ')/';
 		$namespace = '';
-		foreach ($code as $line) {
-			if (preg_match($regex, $line, $matches)) {
-				$namespace = $matches[1];
-			}
-		}
+		foreach (array() as $line) {
 		if (empty($namespace)) {
 			$explodedNamespace = explode('\\', $contextObjectNameSpace);
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 4 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] PregMatchMatches
ExceptionsHelper/FunctionsCollection.php:246:4
 		$regex = '/.*use(.*\\\\' . $variableClass . ')/';
 		$namespace = '';
 		foreach ($code as $line) {
-			if (preg_match($regex, $line, $matches)) {
+			if ((int) ($matches = array())) {
 				$namespace = $matches[1];
 			}
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 4 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] IfNegation
ExceptionsHelper/FunctionsCollection.php:246:4
 		$regex = '/.*use(.*\\\\' . $variableClass . ')/';
 		$namespace = '';
 		foreach ($code as $line) {
-			if (preg_match($regex, $line, $matches)) {
-				$namespace = $matches[1];
-			}
+			if (!preg_match($regex, $line, $matches)) {
 		}
 		if (empty($namespace)) {
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
                                                                                                                                                 
  [TypeError] OpenApi\ExceptionsHelper\FunctionsCollection::getNameSpaceFromVariableClass(): Return value must be of ty

[Killed] DecrementInteger
ExceptionsHelper/FunctionsCollection.php:247:5
 		$namespace = '';
 		foreach ($code as $line) {
 			if (preg_match($regex, $line, $matches)) {
-				$namespace = $matches[1];
+				$namespace = $matches[0];
 			}
 		}
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 4 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] IncrementInteger
ExceptionsHelper/FunctionsCollection.php:247:5
 		$namespace = '';
 		foreach ($code as $line) {
 			if (preg_match($regex, $line, $matches)) {
-				$namespace = $matches[1];
+				$namespace = $matches[2];
 			}
 		}
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
                                                                                                                                                 
  [TypeError] OpenApi\ExceptionsHelper\FunctionsCollection::getNameSpaceFromVariableClass(): Return value must be of ty

[NoCoverage] IfNegation
ExceptionsHelper/FunctionsCollection.php:253:4
 		if (empty($namespace)) {
 			$explodedNamespace = explode('\\', $contextObjectNameSpace);
 			$explodedNamespace[array_key_last($explodedNamespace)] = $variableClass;
-			if(class_exists(implode('\\', $explodedNamespace))){
-				$namespace = implode('\\', $explodedNamespace);
-			}
+			if (!class_exists(implode('\\', $explodedNamespace))) {
 		}
 		return $namespace;

[Killed] PublicVisibility
ExceptionsHelper/FunctionsCollection.php:272:2
 	/**
 	 * @return array
 	 */
-	public function getExceptionCollection(): array
+	protected function getExceptionCollection() : array
 	{
 		return $this->exceptionCollection;
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
                                                                                                                                                        
  [Error] Call to protected method OpenApi\ExceptionsHelper\FunctionsCollection::getExceptionCollection() from s
