[Killed] PublicVisibility
ExceptionsResponsesHelper.php:29:2
 	/**
 	 * @return array<int,Response>
 	 */
-	public function getExceptionsResponses(string $methodNamespace, Container $container): array
+	protected function getExceptionsResponses(string $methodNamespace, Container $container) : array
 	{
 		$exceptions = $this->resolveFunctionExceptions($methodNamespace, 'execute', $container);
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
                                                                                                                                                      
  [Error] Call to protected method OpenApi\ExceptionsResponsesHelper::getExceptionsResponses() from scope Unit\Ope

[Killed] Foreach_
ExceptionsResponsesHelper.php:35:4
 		$exceptions = array_unique($exceptions);
 		$collectedExceptions = [];
 		try {
-			foreach ($exceptions as $exception) {
-				if (is_subclass_of($exception,
-						Exception::class) && $this->objectIsNotSpl($exception) && (new ReflectionClass($exception))->isInstantiable()) {
-					$ref = $this->convertClassNameToRef($exception);
-					if (isset($this->collection[$ref])) {
-						$schema = $this->collection[$ref];
-					} else {
-						$schema = $this->resolveClass($exception, $ref);
-					}
-					$exception = new $exception();
-					$collectedExceptions[$exception->getHttpStatusCode()][$exception::class] = $schema;
-				}
-			}
+			foreach (array() as $exception) {
 		} catch (\Throwable $e) {
 			$abc = 123;
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 0 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[NoCoverage] IncrementInteger
ExceptionsResponsesHelper.php:49:4
 				}
 			}
 		} catch (\Throwable $e) {
-			$abc = 123;
+			$abc = 124;
 		}
 		$result = [];

[NoCoverage] DecrementInteger
ExceptionsResponsesHelper.php:49:4
 				}
 			}
 		} catch (\Throwable $e) {
-			$abc = 123;
+			$abc = 122;
 		}
 		$result = [];

[Killed] Foreach_
ExceptionsResponsesHelper.php:52:3
 			$abc = 123;
 		}
 		$result = [];
-		foreach ($collectedExceptions as $code => $refs) {
-			$oneOfs = [];
-			foreach ($refs as $exceptionClassName => $ref) {
-				$oneOfs[] = new Schema(['$ref' => $ref]);
-			}
-			if (count($oneOfs) > 1) {
-				$resultByCode = new Schema(['oneOf' => $oneOfs]);
-			} else {
-				$resultByCode = $oneOfs[0];
-			}
-			$mediaType = new MediaType(['schema' => $resultByCode]);
-			$response = new Response(['content' => ['application/json' => $mediaType], 'description' => 'exception']);
-			$result[$code] = $response;
-		}
+		foreach (array() as $code => $refs) {
 		return $result;
 	}
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 0 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] Foreach_
ExceptionsResponsesHelper.php:54:4
 		$result = [];
 		foreach ($collectedExceptions as $code => $refs) {
 			$oneOfs = [];
-			foreach ($refs as $exceptionClassName => $ref) {
-				$oneOfs[] = new Schema(['$ref' => $ref]);
-			}
+			foreach (array() as $exceptionClassName => $ref) {
 			if (count($oneOfs) > 1) {
 				$resultByCode = new Schema(['oneOf' => $oneOfs]);
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
                                                                                                                                                                                                                                                 
  [TypeError] PHPUnit\F

[Killed] GreaterThanNegotiation
ExceptionsResponsesHelper.php:57:4
 			foreach ($refs as $exceptionClassName => $ref) {
 				$oneOfs[] = new Schema(['$ref' => $ref]);
 			}
-			if (count($oneOfs) > 1) {
+			if (count($oneOfs) <= 1) {
 				$resultByCode = new Schema(['oneOf' => $oneOfs]);
 			} else {
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
                                                                                                                                                                                                                                                 
  [TypeError] PHPUnit\F

[Survived] GreaterThan
ExceptionsResponsesHelper.php:57:4
 			foreach ($refs as $exceptionClassName => $ref) {
 				$oneOfs[] = new Schema(['$ref' => $ref]);
 			}
-			if (count($oneOfs) > 1) {
+			if (count($oneOfs) >= 1) {
 				$resultByCode = new Schema(['oneOf' => $oneOfs]);
 			} else {

[Killed] ArrayItemRemoval
ExceptionsResponsesHelper.php:58:5
 				$oneOfs[] = new Schema(['$ref' => $ref]);
 			}
 			if (count($oneOfs) > 1) {
-				$resultByCode = new Schema(['oneOf' => $oneOfs]);
+				$resultByCode = new Schema([]);
 			} else {
 				$resultByCode = $oneOfs[0];
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
                                                                                                                                                                                                                                                 
  [TypeError] PHPUnit\F

[Survived] IncrementInteger
ExceptionsResponsesHelper.php:60:5
 			if (count($oneOfs) > 1) {
 				$resultByCode = new Schema(['oneOf' => $oneOfs]);
 			} else {
-				$resultByCode = $oneOfs[0];
+				$resultByCode = $oneOfs[1];
 			}
 			$mediaType = new MediaType(['schema' => $resultByCode]);

[Killed] ArrayItemRemoval
ExceptionsResponsesHelper.php:62:4
 			} else {
 				$resultByCode = $oneOfs[0];
 			}
-			$mediaType = new MediaType(['schema' => $resultByCode]);
+			$mediaType = new MediaType([]);
 			$response = new Response(['content' => ['application/json' => $mediaType], 'description' => 'exception']);
 			$result[$code] = $response;
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
                                                                                                                                                                                                                                                 
  [TypeError] PHPUnit\F

[Killed] ArrayItemRemoval
ExceptionsResponsesHelper.php:63:4
 				$resultByCode = $oneOfs[0];
 			}
 			$mediaType = new MediaType(['schema' => $resultByCode]);
-			$response = new Response(['content' => ['application/json' => $mediaType], 'description' => 'exception']);
+			$response = new Response(['content' => [], 'description' => 'exception']);
 			$result[$code] = $response;
 		}
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
                                                                                                                                                                                                                                                 
  [TypeError] PHPUnit\F

[Killed] ArrayItemRemoval
ExceptionsResponsesHelper.php:63:4
 				$resultByCode = $oneOfs[0];
 			}
 			$mediaType = new MediaType(['schema' => $resultByCode]);
-			$response = new Response(['content' => ['application/json' => $mediaType], 'description' => 'exception']);
+			$response = new Response(['description' => 'exception']);
 			$result[$code] = $response;
 		}
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
                                                                                                                                                                                                                                                 
  [TypeError] PHPUnit\F

[Killed] Concat
ExceptionsResponsesHelper.php:74:3
 		$array = explode('\\', $className);
 		$class = array_pop($array);
 		$folder = array_pop($array);
-		return '#/components/schemas/' . $folder . '_' . $class;
+		return '#/components/schemas/' . $folder . $class . '_';
 	}
 
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'#/components/schemas/AppEmptyDataException_'
+'#/components/schemas/App_EmptyDataException'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:36

[Killed] Concat
ExceptionsResponsesHelper.php:74:3
 		$array = explode('\\', $className);
 		$class = array_pop($array);
 		$folder = array_pop($array);
-		return '#/components/schemas/' . $folder . '_' . $class;
+		return $folder . '#/components/schemas/' . '_' . $class;
 	}
 
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'App#/components/schemas/_EmptyDataException'
+'#/components/schemas/App_EmptyDataException'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:36

[Survived] IncrementInteger
ExceptionsResponsesHelper.php:80:3
 	private function objectIsNotSpl(string $className)
 	{
 		$exploded = explode('\\', $className);
-		if (empty($exploded[0])) {
+		if (empty($exploded[1])) {
 			unset($exploded[0]);
 		}

[NoCoverage] IncrementInteger
ExceptionsResponsesHelper.php:81:4
 	{
 		$exploded = explode('\\', $className);
 		if (empty($exploded[0])) {
-			unset($exploded[0]);
+			unset($exploded[1]);
 		}
 		return count($exploded) > 1;

[Killed] GreaterThanNegotiation
ExceptionsResponsesHelper.php:83:3
 		if (empty($exploded[0])) {
 			unset($exploded[0]);
 		}
-		return count($exploded) > 1;
+		return count($exploded) <= 1;
 	}
 
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 0 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Survived] GreaterThan
ExceptionsResponsesHelper.php:83:3
 		if (empty($exploded[0])) {
 			unset($exploded[0]);
 		}
-		return count($exploded) > 1;
+		return count($exploded) >= 1;
 	}
 

[Killed] MethodCallRemoval
ExceptionsResponsesHelper.php:92:3
 		Container $container
 	): array {
 		$collection = new FunctionsCollection();
-		$collection->resolve($objectNamespace, [$functionName], $container);
+		
 		return $collection->getExceptionCollection();
 	}
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 0 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] ArrayItemRemoval
ExceptionsResponsesHelper.php:92:3
 		Container $container
 	): array {
 		$collection = new FunctionsCollection();
-		$collection->resolve($objectNamespace, [$functionName], $container);
+		$collection->resolve($objectNamespace, [], $container);
 		return $collection->getExceptionCollection();
 	}
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 0 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Survived] ArrayItemRemoval
ExceptionsResponsesHelper.php:105:3
 		$result = [];
 		$result['code'] = new Schema(['type' => Type::INTEGER, 'example' => (string)$exception->getCode()]);
 		$result['message'] = new Schema(['type' => Type::STRING, 'example' => $exception->getMessage()]);
-		$result = new Schema(['type' => Type::OBJECT, 'properties' => $result]);
+		$result = new Schema(['properties' => $result]);
 		$this->refs->add($ref, $result);
 		return $ref;

[Survived] MethodCallRemoval
ExceptionsResponsesHelper.php:106:3
 		$result['code'] = new Schema(['type' => Type::INTEGER, 'example' => (string)$exception->getCode()]);
 		$result['message'] = new Schema(['type' => Type::STRING, 'example' => $exception->getMessage()]);
 		$result = new Schema(['type' => Type::OBJECT, 'properties' => $result]);
-		$this->refs->add($ref, $result);
+		
 		return $ref;
 	}
