[NoCoverage] PublicVisibility
MethodHelper.php:12:2
 	/**
 	 * @return list<string>
 	 */
-	public function getMethods(string $projectDir): array
+	protected function getMethods(string $projectDir) : array
 	{
 		$files = $this->scanProjectDirForFiles($projectDir);

[NoCoverage] Foreach_
MethodHelper.php:27:3
 	private function scanProjectDirForFiles(string $dir): array
 	{
 		$result = [];
-		foreach (scandir($dir) as $filename) {
-			if ($filename[0] === '.') {
-				continue;
-			}
-			$filePath = $dir . '/' . $filename;
-			if (is_dir($filePath)) {
-				foreach ($this->scanProjectDirForFiles($filePath) as $childFilename) {
-					$result[] = $filename . '/' . $childFilename;
-				}
-			} else {
-				$result[] = $filename;
-			}
-		}
+		foreach (array() as $filename) {
 		return $result;
 	}

[NoCoverage] IncrementInteger
MethodHelper.php:28:4
 	{
 		$result = [];
 		foreach (scandir($dir) as $filename) {
-			if ($filename[0] === '.') {
+			if ($filename[1] === '.') {
 				continue;
 			}

[NoCoverage] Identical
MethodHelper.php:28:4
 	{
 		$result = [];
 		foreach (scandir($dir) as $filename) {
-			if ($filename[0] === '.') {
+			if ($filename[0] !== '.') {
 				continue;
 			}

[NoCoverage] Continue_
MethodHelper.php:29:5
 		$result = [];
 		foreach (scandir($dir) as $filename) {
 			if ($filename[0] === '.') {
-				continue;
+				break;
 			}
 			$filePath = $dir . '/' . $filename;

[NoCoverage] ConcatOperandRemoval
MethodHelper.php:31:4
 			if ($filename[0] === '.') {
 				continue;
 			}
-			$filePath = $dir . '/' . $filename;
+			$filePath = '/' . $filename;
 			if (is_dir($filePath)) {
 				foreach ($this->scanProjectDirForFiles($filePath) as $childFilename) {

[NoCoverage] Concat
MethodHelper.php:31:4
 			if ($filename[0] === '.') {
 				continue;
 			}
-			$filePath = $dir . '/' . $filename;
+			$filePath = $dir . $filename . '/';
 			if (is_dir($filePath)) {
 				foreach ($this->scanProjectDirForFiles($filePath) as $childFilename) {

[NoCoverage] IfNegation
MethodHelper.php:32:4
 				continue;
 			}
 			$filePath = $dir . '/' . $filename;
-			if (is_dir($filePath)) {
-				foreach ($this->scanProjectDirForFiles($filePath) as $childFilename) {
-					$result[] = $filename . '/' . $childFilename;
-				}
-			} else {
-				$result[] = $filename;
-			}
+			if (!is_dir($filePath)) {
 		}
 		return $result;

[NoCoverage] Foreach_
MethodHelper.php:33:5
 			}
 			$filePath = $dir . '/' . $filename;
 			if (is_dir($filePath)) {
-				foreach ($this->scanProjectDirForFiles($filePath) as $childFilename) {
-					$result[] = $filename . '/' . $childFilename;
-				}
+				foreach (array() as $childFilename) {
 			} else {
 				$result[] = $filename;

[NoCoverage] ConcatOperandRemoval
MethodHelper.php:34:6
 			$filePath = $dir . '/' . $filename;
 			if (is_dir($filePath)) {
 				foreach ($this->scanProjectDirForFiles($filePath) as $childFilename) {
-					$result[] = $filename . '/' . $childFilename;
+					$result[] = $filename . '/';
 				}
 			} else {

[NoCoverage] ConcatOperandRemoval
MethodHelper.php:34:6
 			$filePath = $dir . '/' . $filename;
 			if (is_dir($filePath)) {
 				foreach ($this->scanProjectDirForFiles($filePath) as $childFilename) {
-					$result[] = $filename . '/' . $childFilename;
+					$result[] = $filename . $childFilename;
 				}
 			} else {

[NoCoverage] Foreach_
MethodHelper.php:50:3
 	private function prepareRealPath(array $files, string $projectDir): array
 	{
 		$result = [];
-		foreach ($files as $file) {
-			$result[] = $projectDir . '/' . $file;
-		}
+		foreach (array() as $file) {
 		return $result;
 	}

[NoCoverage] ConcatOperandRemoval
MethodHelper.php:51:4
 	{
 		$result = [];
 		foreach ($files as $file) {
-			$result[] = $projectDir . '/' . $file;
+			$result[] = $projectDir . $file;
 		}
 		return $result;

[NoCoverage] Concat
MethodHelper.php:51:4
 	{
 		$result = [];
 		foreach ($files as $file) {
-			$result[] = $projectDir . '/' . $file;
+			$result[] = $projectDir . $file . '/';
 		}
 		return $result;

[NoCoverage] Foreach_
MethodHelper.php:63:3
 	private function getNamespaces(array $files): array
 	{
 		$namespaces = [];
-		foreach ($files as $file) {
-			$className = $this->getClassName($file);
-			if ($className) {
-				$namespaces[] = $this->getClassName($file);
-			}
-		}
+		foreach (array() as $file) {
 		return $namespaces;
 	}

[NoCoverage] IfNegation
MethodHelper.php:65:4
 		$namespaces = [];
 		foreach ($files as $file) {
 			$className = $this->getClassName($file);
-			if ($className) {
-				$namespaces[] = $this->getClassName($file);
-			}
+			if (!$className) {
 		}
 		return $namespaces;

[NoCoverage] IfNegation
MethodHelper.php:77:3
 		$fileContents = file_get_contents($path, true);
 		$namespaceParts = explode('/', $path);
 		$namespacePattern = '/namespace\s+([^\s;]+)/';
-		if (preg_match($namespacePattern, $fileContents, $matches)) {
-			$prepared = $matches[1] . '\\' . end($namespaceParts);
-			$namespace = str_replace('.php', '', $prepared);
-		} else {
-			return null;
-		}
+		if (!preg_match($namespacePattern, $fileContents, $matches)) {
 		return $namespace;
 	}

[NoCoverage] PregMatchMatches
MethodHelper.php:77:3
 		$fileContents = file_get_contents($path, true);
 		$namespaceParts = explode('/', $path);
 		$namespacePattern = '/namespace\s+([^\s;]+)/';
-		if (preg_match($namespacePattern, $fileContents, $matches)) {
+		if ((int) ($matches = array())) {
 			$prepared = $matches[1] . '\\' . end($namespaceParts);
 			$namespace = str_replace('.php', '', $prepared);

[NoCoverage] ConcatOperandRemoval
MethodHelper.php:78:4
 		$namespaceParts = explode('/', $path);
 		$namespacePattern = '/namespace\s+([^\s;]+)/';
 		if (preg_match($namespacePattern, $fileContents, $matches)) {
-			$prepared = $matches[1] . '\\' . end($namespaceParts);
+			$prepared = $matches[1] . '\\';
 			$namespace = str_replace('.php', '', $prepared);
 		} else {

[NoCoverage] Concat
MethodHelper.php:78:4
 		$namespaceParts = explode('/', $path);
 		$namespacePattern = '/namespace\s+([^\s;]+)/';
 		if (preg_match($namespacePattern, $fileContents, $matches)) {
-			$prepared = $matches[1] . '\\' . end($namespaceParts);
+			$prepared = $matches[1] . end($namespaceParts) . '\\';
 			$namespace = str_replace('.php', '', $prepared);
 		} else {

[NoCoverage] UnwrapStrReplace
MethodHelper.php:79:4
 		$namespacePattern = '/namespace\s+([^\s;]+)/';
 		if (preg_match($namespacePattern, $fileContents, $matches)) {
 			$prepared = $matches[1] . '\\' . end($namespaceParts);
-			$namespace = str_replace('.php', '', $prepared);
+			$namespace = $prepared;
 		} else {
 			return null;

[NoCoverage] Foreach_
MethodHelper.php:93:3
 	private function getMethodNamespaces(array $namespaces): array
 	{
 		$methods = [];
-		foreach ($namespaces as $namespace) {
-			$interfaces = class_implements($namespace);
-			if (isset($interfaces[ExecuteInterface::class])) {
-				$methods[] = $namespace;
-			}
-		}
+		foreach (array() as $namespace) {
 		return $methods;
 	}

[NoCoverage] ArrayOneItem
MethodHelper.php:99:3
 				$methods[] = $namespace;
 			}
 		}
-		return $methods;
+		return count($methods) > 1 ? array_slice($methods, 0, 1, true) : $methods;
 	}
 }
