[Killed] MethodCallRemoval
PhpDocParser.php:62:3
 
 	public function __construct(private readonly ?string $object = null)
 	{
-		$this->createParser();
+		
 		$this->useStatements = $this->parseUseStatements($this->object);
 	}
statusReason: 1) SuccessResponseDataHelperTest: Int return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testIntReturn
                                                                                                   
  [Error] Typed property OpenApi\PhpDocParser::$parser must not be accessed before initialization

[Killed] PublicVisibility
PhpDocParser.php:73:2
 		$this->parser = new StanPhpDocParser($typeParser, $constExprParser);
 	}
 
-	public function getMethodDocs(string $methodName): string|false
+	protected function getMethodDocs(string $methodName) : string|false
 	{
 		return $this->getMethodRecursive($this->object, $methodName)->getDocComment();
statusReason: 1) SuccessResponseDataHelperTest: Int return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testIntReturn
                                                                                                                       
  [Error] Call to protected method OpenApi\PhpDocParser::getMethodDocs() from scope OpenApi\SuccessResponseDataHelper

[Survived] Coalesce
PhpDocParser.php:84:4
 		?string $currentClass = null
 	): ReflectionMethod {
 		try {
-			$reflectionProperty = new ReflectionClass($currentClass ?? $class);
+			$reflectionProperty = new ReflectionClass($class ?? $currentClass);
 			return $reflectionProperty->getMethod($methodName);
 		} catch (ReflectionException $exception) {

[NoCoverage] Coalesce
PhpDocParser.php:87:4
 			$reflectionProperty = new ReflectionClass($currentClass ?? $class);
 			return $reflectionProperty->getMethod($methodName);
 		} catch (ReflectionException $exception) {
-			$reflection = new ReflectionClass($currentClass ?? $class);
+			$reflection = new ReflectionClass($class ?? $currentClass);
 			if ($parent = $reflection->getParentClass()) {
 				return $this->getMethodRecursive($class, $methodName, $parent->getName());

[NoCoverage] ConcatOperandRemoval
PhpDocParser.php:92:3
 				return $this->getMethodRecursive($class, $methodName, $parent->getName());
 			}
 		}
-		throw new ReflectionException("Unable to find property: $methodName recursively in class: " . $class);
+		throw new ReflectionException($class);
 	}
 

[NoCoverage] Throw_
PhpDocParser.php:92:3
 				return $this->getMethodRecursive($class, $methodName, $parent->getName());
 			}
 		}
-		throw new ReflectionException("Unable to find property: $methodName recursively in class: " . $class);
+		new ReflectionException("Unable to find property: {$methodName} recursively in class: " . $class);
 	}
 

[Killed] PublicVisibility
PhpDocParser.php:95:2
 		throw new ReflectionException("Unable to find property: $methodName recursively in class: " . $class);
 	}
 
-	public function getPhpDocNode(string $docComment): PhpDocNode
+	protected function getPhpDocNode(string $docComment) : PhpDocNode
 	{
 		if (empty($docComment)) {
statusReason: 1) SuccessResponseDataHelperTest: List of enum values return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testListOfEnumValuesReturn
                                                                                                                       
  [Error] Call to protected method OpenApi\PhpDocParser::getPhpDocNode() from scope OpenApi\SuccessResponseDataHelper

[Killed] Throw_
PhpDocParser.php:98:4
 	public function getPhpDocNode(string $docComment): PhpDocNode
 	{
 		if (empty($docComment)) {
-			throw new Exception('Метод не содержит docBlock!');
+			new Exception('Метод не содержит docBlock!');
 		}
 		$lexer = new Lexer();
statusReason: 1) SuccessResponseDataHelperTest: Method without doc blocks will fail
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testMethodWithoutDocBlocksWillFail
Failed asserting that exception message 'Unexpected token "", expected '/**' at offset 0 on line 1' contains 'Метод не содержит docBlock!'.
#1  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 19, Assertions: 62,

[Killed] PublicVisibility
PhpDocParser.php:111:2
 	 *
 	 * Точка входа для парсинга доков.
 	 */
-	public function convert(PhpDocTagValueNode $node): array|string
+	protected function convert(PhpDocTagValueNode $node) : array|string
 	{
 		try {
statusReason: 1) SuccessResponseDataHelperTest: Keys is constants return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testKeysIsConstantsReturn
                                                                                                                 
  [Error] Call to protected method OpenApi\PhpDocParser::convert() from scope OpenApi\SuccessResponseDataHelper

[Killed] IfNegation
PhpDocParser.php:114:4
 	public function convert(PhpDocTagValueNode $node): array|string
 	{
 		try {
-			if ($this->isNested($node->type)) {
-				$result = $this->convertNestedToArray($node->type);
-			} elseif ($this->isPrimitive($node->type)) {
-				$result = $this->getPrimitiveValueOrProperties($node->type);
-			}
+			if (!$this->isNested($node->type)) {
 			return $result ?? [];
 		} catch (Throwable $exception) {
statusReason: 1) SuccessResponseDataHelperTest: Object collection return will fail
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testObjectCollectionReturnWillFail
Failed asserting that exception with message "Допустим только один тип или набор значений(исключение null)" is thrown
#1  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] ElseIfNegation
PhpDocParser.php:116:4
 		try {
 			if ($this->isNested($node->type)) {
 				$result = $this->convertNestedToArray($node->type);
-			} elseif ($this->isPrimitive($node->type)) {
-				$result = $this->getPrimitiveValueOrProperties($node->type);
-			}
+			} elseif (!$this->isPrimitive($node->type)) {
 			return $result ?? [];
 		} catch (Throwable $exception) {
statusReason: 1) SuccessResponseDataHelperTest: Enum value return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testEnumValueReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'array'
+'string'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:178

[Killed] Coalesce
PhpDocParser.php:119:4
 			} elseif ($this->isPrimitive($node->type)) {
 				$result = $this->getPrimitiveValueOrProperties($node->type);
 			}
-			return $result ?? [];
+			return [] ?? $result;
 		} catch (Throwable $exception) {
 			return ['При создании примера ответа произошла ошибка! Ошибка: ' . $exception->getMessage()];
statusReason: 1) SuccessResponseDataHelperTest: Object const return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testObjectConstReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'array'
+'string'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:233

[NoCoverage] Concat
PhpDocParser.php:121:4
 			}
 			return $result ?? [];
 		} catch (Throwable $exception) {
-			return ['При создании примера ответа произошла ошибка! Ошибка: ' . $exception->getMessage()];
+			return [$exception->getMessage() . 'При создании примера ответа произошла ошибка! Ошибка: '];
 		}
 	}

[NoCoverage] ConcatOperandRemoval
PhpDocParser.php:121:4
 			}
 			return $result ?? [];
 		} catch (Throwable $exception) {
-			return ['При создании примера ответа произошла ошибка! Ошибка: ' . $exception->getMessage()];
+			return ['При создании примера ответа произошла ошибка! Ошибка: '];
 		}
 	}

[Killed] Identical
PhpDocParser.php:130:3
 	 */
 	private function parseUseStatements(?string $className): array
 	{
-		if ($className === null) {
+		if ($className !== null) {
 			return [];
 		}
statusReason: 1) SuccessResponseDataHelperTest: Indexed array return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testIndexedArrayReturn
Failed asserting that '#/components/schemas/entities_TestObject' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:130
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Asse

[Killed] Identical
PhpDocParser.php:134:3
 			return [];
 		}
 		$file = (new ReflectionClass($className))->getFileName();
-		if ($file === false) {
+		if ($file !== false) {
 			return [];
 		}
statusReason: 1) SuccessResponseDataHelperTest: Enum value return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testEnumValueReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'Permissions'
+'oAccessBookmakerCabinet'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:179

[Survived] FalseValue
PhpDocParser.php:134:3
 			return [];
 		}
 		$file = (new ReflectionClass($className))->getFileName();
-		if ($file === false) {
+		if ($file === true) {
 			return [];
 		}

[Killed] Foreach_
PhpDocParser.php:139:3
 		}
 		$tokens = token_get_all(file_get_contents($file));
 		$statements = [];
-		foreach ($tokens as $key => $token) {
-			if ($token[0] === T_NAME_QUALIFIED) {
-				$statements['uses'][$token[1]] = ['className' => $token[1]];
-				if (isset($tokens[$key + 2]) && $tokens[$key + 2][1] === 'as') {
-					$statements['uses'][$token[1]]['as'] = $tokens[$key + 4][1];
-				}
-			} elseif ($token[0] === T_NAMESPACE) {
-				$statements['namespace'] = $tokens[$key + 2][1];
-			}
-		}
+		foreach (array() as $key => $token) {
 		return $statements;
 	}
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 0 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] IncrementInteger
PhpDocParser.php:140:4
 		$tokens = token_get_all(file_get_contents($file));
 		$statements = [];
 		foreach ($tokens as $key => $token) {
-			if ($token[0] === T_NAME_QUALIFIED) {
+			if ($token[1] === T_NAME_QUALIFIED) {
 				$statements['uses'][$token[1]] = ['className' => $token[1]];
 				if (isset($tokens[$key + 2]) && $tokens[$key + 2][1] === 'as') {
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 0 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] Identical
PhpDocParser.php:140:4
 		$tokens = token_get_all(file_get_contents($file));
 		$statements = [];
 		foreach ($tokens as $key => $token) {
-			if ($token[0] === T_NAME_QUALIFIED) {
+			if ($token[0] !== T_NAME_QUALIFIED) {
 				$statements['uses'][$token[1]] = ['className' => $token[1]];
 				if (isset($tokens[$key + 2]) && $tokens[$key + 2][1] === 'as') {
statusReason: 1) SuccessResponseDataHelperTest: Array shape return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testArrayShapeReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'array'
+'object'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:200

[Killed] DecrementInteger
PhpDocParser.php:141:5
 		$statements = [];
 		foreach ($tokens as $key => $token) {
 			if ($token[0] === T_NAME_QUALIFIED) {
-				$statements['uses'][$token[1]] = ['className' => $token[1]];
+				$statements['uses'][$token[1]] = ['className' => $token[0]];
 				if (isset($tokens[$key + 2]) && $tokens[$key + 2][1] === 'as') {
 					$statements['uses'][$token[1]]['as'] = $tokens[$key + 4][1];
statusReason: 1) SuccessResponseDataHelperTest: Object collection return will fail
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testObjectCollectionReturnWillFail
Failed asserting that exception with message "Допустим только один тип или набор значений(исключение null)" is thrown
#1  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] IncrementInteger
PhpDocParser.php:141:5
 		$statements = [];
 		foreach ($tokens as $key => $token) {
 			if ($token[0] === T_NAME_QUALIFIED) {
-				$statements['uses'][$token[1]] = ['className' => $token[1]];
+				$statements['uses'][$token[1]] = ['className' => $token[2]];
 				if (isset($tokens[$key + 2]) && $tokens[$key + 2][1] === 'as') {
 					$statements['uses'][$token[1]]['as'] = $tokens[$key + 4][1];
statusReason: 1) SuccessResponseDataHelperTest: Enum value return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testEnumValueReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'array'
+'string'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:178

[Survived] DecrementInteger
PhpDocParser.php:142:5
 		foreach ($tokens as $key => $token) {
 			if ($token[0] === T_NAME_QUALIFIED) {
 				$statements['uses'][$token[1]] = ['className' => $token[1]];
-				if (isset($tokens[$key + 2]) && $tokens[$key + 2][1] === 'as') {
+				if (isset($tokens[$key + 2]) && $tokens[$key + 2][0] === 'as') {
 					$statements['uses'][$token[1]]['as'] = $tokens[$key + 4][1];
 				}

[Survived] LogicalAnd
PhpDocParser.php:142:5
 		foreach ($tokens as $key => $token) {
 			if ($token[0] === T_NAME_QUALIFIED) {
 				$statements['uses'][$token[1]] = ['className' => $token[1]];
-				if (isset($tokens[$key + 2]) && $tokens[$key + 2][1] === 'as') {
+				if (isset($tokens[$key + 2]) || $tokens[$key + 2][1] === 'as') {
 					$statements['uses'][$token[1]]['as'] = $tokens[$key + 4][1];
 				}

[NoCoverage] IncrementInteger
PhpDocParser.php:143:6
 			if ($token[0] === T_NAME_QUALIFIED) {
 				$statements['uses'][$token[1]] = ['className' => $token[1]];
 				if (isset($tokens[$key + 2]) && $tokens[$key + 2][1] === 'as') {
-					$statements['uses'][$token[1]]['as'] = $tokens[$key + 4][1];
+					$statements['uses'][$token[1]]['as'] = $tokens[$key + 5][1];
 				}
 			} elseif ($token[0] === T_NAMESPACE) {

[NoCoverage] DecrementInteger
PhpDocParser.php:143:6
 			if ($token[0] === T_NAME_QUALIFIED) {
 				$statements['uses'][$token[1]] = ['className' => $token[1]];
 				if (isset($tokens[$key + 2]) && $tokens[$key + 2][1] === 'as') {
-					$statements['uses'][$token[1]]['as'] = $tokens[$key + 4][1];
+					$statements['uses'][$token[1]]['as'] = $tokens[$key + 3][1];
 				}
 			} elseif ($token[0] === T_NAMESPACE) {

[Survived] Identical
PhpDocParser.php:145:4
 				if (isset($tokens[$key + 2]) && $tokens[$key + 2][1] === 'as') {
 					$statements['uses'][$token[1]]['as'] = $tokens[$key + 4][1];
 				}
-			} elseif ($token[0] === T_NAMESPACE) {
+			} elseif ($token[0] !== T_NAMESPACE) {
 				$statements['namespace'] = $tokens[$key + 2][1];
 			}

[Survived] IncrementInteger
PhpDocParser.php:145:4
 				if (isset($tokens[$key + 2]) && $tokens[$key + 2][1] === 'as') {
 					$statements['uses'][$token[1]]['as'] = $tokens[$key + 4][1];
 				}
-			} elseif ($token[0] === T_NAMESPACE) {
+			} elseif ($token[1] === T_NAMESPACE) {
 				$statements['namespace'] = $tokens[$key + 2][1];
 			}

[Survived] IncrementInteger
PhpDocParser.php:146:5
 					$statements['uses'][$token[1]]['as'] = $tokens[$key + 4][1];
 				}
 			} elseif ($token[0] === T_NAMESPACE) {
-				$statements['namespace'] = $tokens[$key + 2][1];
+				$statements['namespace'] = $tokens[$key + 2][2];
 			}
 		}

[Survived] DecrementInteger
PhpDocParser.php:146:5
 					$statements['uses'][$token[1]]['as'] = $tokens[$key + 4][1];
 				}
 			} elseif ($token[0] === T_NAMESPACE) {
-				$statements['namespace'] = $tokens[$key + 2][1];
+				$statements['namespace'] = $tokens[$key + 2][0];
 			}
 		}

[Killed] LogicalOr
PhpDocParser.php:159:3
 
 	private function isPrimitive(Node $node): bool
 	{
-		return $this->isConst($node) || in_array($node::class, self::PRIMITIVE_NODES, true);
+		return $this->isConst($node) && in_array($node::class, self::PRIMITIVE_NODES, true);
 	}
 
statusReason: 1) SuccessResponseDataHelperTest: Float return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testFloatReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'array'
+'number'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:90

[Killed] LogicalOrSingleSubExprNegation
PhpDocParser.php:159:3
 
 	private function isPrimitive(Node $node): bool
 	{
-		return $this->isConst($node) || in_array($node::class, self::PRIMITIVE_NODES, true);
+		return $this->isConst($node) || !in_array($node::class, self::PRIMITIVE_NODES, true);
 	}
 
statusReason: 1) SuccessResponseDataHelperTest: Array shape return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testArrayShapeReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'array'
+'object'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:200

[Killed] InstanceOf_
PhpDocParser.php:165:3
 	/** Зачем-то в некоторых местах вместо ConstTypeNode используется ConstExprNode */
 	private function isConst(Node $node): bool
 	{
-		return $node instanceof ConstExprNode;
+		return false;
 	}
 
statusReason: 1) SuccessResponseDataHelperTest: Array shape return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testArrayShapeReturn
Failed asserting that 'string' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:210
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 20, Assertions: 57, Failures: 1.

[Killed] InstanceOf_
PhpDocParser.php:165:3
 	/** Зачем-то в некоторых местах вместо ConstTypeNode используется ConstExprNode */
 	private function isConst(Node $node): bool
 	{
-		return $node instanceof ConstExprNode;
+		return true;
 	}
 
statusReason: 1) SuccessResponseDataHelperTest: Keys is constants return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testKeysIsConstantsReturn
Failed asserting that two arrays are equal.
- Expected | + Actual
@@ @@
Array (
-    0 => 'oAccessBookmakerCabinet'
-    1 => 'oAccessPartnerCabinet'

[Killed] NotIdentical
PhpDocParser.php:171:3
 	/** Метод для попытки найти полное имя класса */
 	private function tryToGetClassString(string $name, array $statements): string
 	{
-		if (ucfirst($name) !== $name) {
+		if (ucfirst($name) === $name) {
 			return $name;
 		}
statusReason: 1) SuccessResponseDataHelperTest: Associative array return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testAssociativeArrayReturn
Failed asserting that '#/components/schemas/entities_TestObject' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:118
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests:

[Survived] UnwrapUcFirst
PhpDocParser.php:171:3
 	/** Метод для попытки найти полное имя класса */
 	private function tryToGetClassString(string $name, array $statements): string
 	{
-		if (ucfirst($name) !== $name) {
+		if ($name !== $name) {
 			return $name;
 		}

[Killed] Foreach_
PhpDocParser.php:175:3
 			return $name;
 		}
 
-		foreach ($statements['uses'] as $statement) {
-			if (isset($statement['as']) && $name === $statement['as']) {
-				return $statement['className'];
-			}
-			if (preg_match("/\\\\" . $name . '$/', $statement['className']) || $name === $statement['className']) {
-				return $statement['className'];
-			}
-		}
+		foreach (array() as $statement) {
 		if ($this->isEntityExists($statements['namespace'] . '\\' . $name)) {
 			return $statements['namespace'] . '\\' . $name;
statusReason: 1) SuccessResponseDataHelperTest: Associative array return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testAssociativeArrayReturn
Failed asserting that '#/components/schemas/entities_TestObject' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:118
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests:

[Killed] LogicalAndNegation
PhpDocParser.php:176:4
 		}
 
 		foreach ($statements['uses'] as $statement) {
-			if (isset($statement['as']) && $name === $statement['as']) {
+			if (!(isset($statement['as']) && $name === $statement['as'])) {
 				return $statement['className'];
 			}
statusReason: 1) SuccessResponseDataHelperTest: Nullable return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testNullableReturn
Failed asserting that '#/components/schemas/entities_TestObject' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:222
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0

[Killed] LogicalAndAllSubExprNegation
PhpDocParser.php:176:4
 		}
 
 		foreach ($statements['uses'] as $statement) {
-			if (isset($statement['as']) && $name === $statement['as']) {
+			if (!isset($statement['as']) && !($name === $statement['as'])) {
 				return $statement['className'];
 			}
statusReason: 1) SuccessResponseDataHelperTest: List of objects return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testListOfObjectsReturn
Failed asserting that '#/components/schemas/entities_TestObject' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:142
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, A

[Killed] ConcatOperandRemoval
PhpDocParser.php:179:4
 			if (isset($statement['as']) && $name === $statement['as']) {
 				return $statement['className'];
 			}
-			if (preg_match("/\\\\" . $name . '$/', $statement['className']) || $name === $statement['className']) {
+			if (preg_match("/\\\\" . $name, $statement['className']) || $name === $statement['className']) {
 				return $statement['className'];
 			}
statusReason: 1) SuccessResponseDataHelperTest: Array shape return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testArrayShapeReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'array'
+'object'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:200

[Killed] ConcatOperandRemoval
PhpDocParser.php:179:4
 			if (isset($statement['as']) && $name === $statement['as']) {
 				return $statement['className'];
 			}
-			if (preg_match("/\\\\" . $name . '$/', $statement['className']) || $name === $statement['className']) {
+			if (preg_match($name . '$/', $statement['className']) || $name === $statement['className']) {
 				return $statement['className'];
 			}
statusReason: 1) SuccessResponseDataHelperTest: Associative array return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testAssociativeArrayReturn
Failed asserting that '#/components/schemas/entities_TestObject' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:118
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests:

[NoCoverage] ConcatOperandRemoval
PhpDocParser.php:183:3
 				return $statement['className'];
 			}
 		}
-		if ($this->isEntityExists($statements['namespace'] . '\\' . $name)) {
+		if ($this->isEntityExists('\\' . $name)) {
 			return $statements['namespace'] . '\\' . $name;
 		}

[NoCoverage] ConcatOperandRemoval
PhpDocParser.php:183:3
 				return $statement['className'];
 			}
 		}
-		if ($this->isEntityExists($statements['namespace'] . '\\' . $name)) {
+		if ($this->isEntityExists($statements['namespace'] . '\\')) {
 			return $statements['namespace'] . '\\' . $name;
 		}

[NoCoverage] ConcatOperandRemoval
PhpDocParser.php:184:4
 			}
 		}
 		if ($this->isEntityExists($statements['namespace'] . '\\' . $name)) {
-			return $statements['namespace'] . '\\' . $name;
+			return '\\' . $name;
 		}
 

[NoCoverage] Concat
PhpDocParser.php:184:4
 			}
 		}
 		if ($this->isEntityExists($statements['namespace'] . '\\' . $name)) {
-			return $statements['namespace'] . '\\' . $name;
+			return '\\' . $statements['namespace'] . $name;
 		}
 

[NoCoverage] Identical
PhpDocParser.php:187:3
 			return $statements['namespace'] . '\\' . $name;
 		}
 
-		if ($name === DateTimeImmutable::class || $name === DateTime::class) {
+		if ($name === DateTimeImmutable::class || $name !== DateTime::class) {
 			return 'date/time строка';
 		}

[NoCoverage] LogicalOrNegation
PhpDocParser.php:187:3
 			return $statements['namespace'] . '\\' . $name;
 		}
 
-		if ($name === DateTimeImmutable::class || $name === DateTime::class) {
+		if (!($name === DateTimeImmutable::class || $name === DateTime::class)) {
 			return 'date/time строка';
 		}

[Killed] IfNegation
PhpDocParser.php:198:3
 	/** @param "value"|"name" $type */
 	private function getAllConstValuesOrNames(string $class, string $type = 'value'): string
 	{
-		if (enum_exists($class)) {
-			/** @var BackedEnum $class */
-			return implode('|', array_column($class::cases(), $type));
-		} elseif (class_exists($class)) {
-			$result = [];
-			foreach ((new ReflectionClass($class))->getConstants() as $name => $value) {
-				$result[] = $type === 'value' ? $value : $name;
-			}
-			return implode('|', array_unique($result));
-		}
+		if (!enum_exists($class)) {
 
 		throw new Exception('Значение констант или их имена можно получить только у классов и enum\'ов');
statusReason: 1) SuccessResponseDataHelperTest: Object all constants return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testObjectAllConstantsReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'array'
+'string'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:244

[NoCoverage] UnwrapArrayColumn
PhpDocParser.php:200:4
 	{
 		if (enum_exists($class)) {
 			/** @var BackedEnum $class */
-			return implode('|', array_column($class::cases(), $type));
+			return implode('|', $class::cases());
 		} elseif (class_exists($class)) {
 			$result = [];

[Killed] ElseIfNegation
PhpDocParser.php:201:3
 		if (enum_exists($class)) {
 			/** @var BackedEnum $class */
 			return implode('|', array_column($class::cases(), $type));
-		} elseif (class_exists($class)) {
-			$result = [];
-			foreach ((new ReflectionClass($class))->getConstants() as $name => $value) {
-				$result[] = $type === 'value' ? $value : $name;
-			}
-			return implode('|', array_unique($result));
-		}
+		} elseif (!class_exists($class)) {
 
 		throw new Exception('Значение констант или их имена можно получить только у классов и enum\'ов');
statusReason: 1) SuccessResponseDataHelperTest: Object all constants return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testObjectAllConstantsReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'array'
+'string'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:244

[Killed] Foreach_
PhpDocParser.php:203:4
 			return implode('|', array_column($class::cases(), $type));
 		} elseif (class_exists($class)) {
 			$result = [];
-			foreach ((new ReflectionClass($class))->getConstants() as $name => $value) {
-				$result[] = $type === 'value' ? $value : $name;
-			}
+			foreach (array() as $name => $value) {
 			return implode('|', array_unique($result));
 		}
statusReason: 1) SuccessResponseDataHelperTest: Object all constants return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testObjectAllConstantsReturn
Failed asserting that two arrays are equal.
- Expected | + Actual
@@ @@
Array (
-    0 => ''
+    0 => 'abc'

[Killed] Ternary
PhpDocParser.php:204:5
 		} elseif (class_exists($class)) {
 			$result = [];
 			foreach ((new ReflectionClass($class))->getConstants() as $name => $value) {
-				$result[] = $type === 'value' ? $value : $name;
+				$result[] = $type === 'value' ? $name : $value;
 			}
 			return implode('|', array_unique($result));
statusReason: 1) SuccessResponseDataHelperTest: Object all constants return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testObjectAllConstantsReturn
Failed asserting that two arrays are equal.
- Expected | + Actual
@@ @@
Array (
-    0 => 'ABC'
-    1 => 'BCA'

[Killed] Identical
PhpDocParser.php:204:5
 		} elseif (class_exists($class)) {
 			$result = [];
 			foreach ((new ReflectionClass($class))->getConstants() as $name => $value) {
-				$result[] = $type === 'value' ? $value : $name;
+				$result[] = $type !== 'value' ? $value : $name;
 			}
 			return implode('|', array_unique($result));
statusReason: 1) SuccessResponseDataHelperTest: Object all constants return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testObjectAllConstantsReturn
Failed asserting that two arrays are equal.
- Expected | + Actual
@@ @@
Array (
-    0 => 'ABC'
-    1 => 'BCA'

[NoCoverage] Throw_
PhpDocParser.php:209:3
 			return implode('|', array_unique($result));
 		}
 
-		throw new Exception('Значение констант или их имена можно получить только у классов и enum\'ов');
+		new Exception('Значение констант или их имена можно получить только у классов и enum\'ов');
 	}
 

[Killed] InstanceOf_
PhpDocParser.php:214:3
 
 	private function getPrimitiveValue(Node $node): string
 	{
-		if ($node instanceof IdentifierTypeNode) {
+		if (true) {
 			if ($node->name === 'array-key') {
 				return 'int|string';
statusReason: 1) SuccessResponseDataHelperTest: Array shape return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testArrayShapeReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'array'
+'object'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:200
