[Killed] InstanceOf_
PhpDocParser.php:214:3
 
 	private function getPrimitiveValue(Node $node): string
 	{
-		if ($node instanceof IdentifierTypeNode) {
+		if (false) {
 			if ($node->name === 'array-key') {
 				return 'int|string';
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 0 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 4, Assertions: 7, Failures: 1.

[Killed] Identical
PhpDocParser.php:215:4
 	private function getPrimitiveValue(Node $node): string
 	{
 		if ($node instanceof IdentifierTypeNode) {
-			if ($node->name === 'array-key') {
+			if ($node->name !== 'array-key') {
 				return 'int|string';
 			}
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 0 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 3, Assertions: 4, Failures: 1.

[Killed] InstanceOf_
PhpDocParser.php:221:3
 			return $this->tryToGetClassString($node->name, $this->useStatements);
 		}
 
-		if ($node instanceof ConstExprNode) {
+		if (false) {
 			return $node->value;
 		}
statusReason: 1) SuccessResponseDataHelperTest: Array shape return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testArrayShapeReturn
Failed asserting that 'string' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:202
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 17, Assertions: 42, Failures: 1.

[Killed] InstanceOf_
PhpDocParser.php:221:3
 			return $this->tryToGetClassString($node->name, $this->useStatements);
 		}
 
-		if ($node instanceof ConstExprNode) {
+		if (true) {
 			return $node->value;
 		}
statusReason: 1) SuccessResponseDataHelperTest: Object const return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testObjectConstReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'array'
+'string'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:233

[Killed] InstanceOf_
PhpDocParser.php:225:3
 			return $node->value;
 		}
 
-		if ($node instanceof ConstTypeNode) {
+		if (false) {
 			if (!$node->constExpr instanceof ConstFetchNode) {
 				return $node->constExpr->value;
statusReason: 1) SuccessResponseDataHelperTest: Object all constants return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testObjectAllConstantsReturn
Failed asserting that two arrays are equal.
- Expected | + Actual
@@ @@
Array (
-    0 => 'Unknown type'
+    0 => 'abc'

[Survived] InstanceOf_
PhpDocParser.php:225:3
 			return $node->value;
 		}
 
-		if ($node instanceof ConstTypeNode) {
+		if (true) {
 			if (!$node->constExpr instanceof ConstFetchNode) {
 				return $node->constExpr->value;

[Killed] LogicalNot
PhpDocParser.php:226:4
 		}
 
 		if ($node instanceof ConstTypeNode) {
-			if (!$node->constExpr instanceof ConstFetchNode) {
+			if ($node->constExpr instanceof ConstFetchNode) {
 				return $node->constExpr->value;
 			}
statusReason: 1) SuccessResponseDataHelperTest: Array shape return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testArrayShapeReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'array'
+'object'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:200

[Killed] InstanceOf_
PhpDocParser.php:226:4
 		}
 
 		if ($node instanceof ConstTypeNode) {
-			if (!$node->constExpr instanceof ConstFetchNode) {
+			if (!false) {
 				return $node->constExpr->value;
 			}
statusReason: 1) SuccessResponseDataHelperTest: Object all constants return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testObjectAllConstantsReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'array'
+'string'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:244

[Killed] LogicalNot
PhpDocParser.php:231:4
 			}
 
 			$class = $this->tryToGetClassString($node->constExpr->className, $this->useStatements);
-			if (!$this->isEnumOrClass($class)) {
+			if ($this->isEnumOrClass($class)) {
 				return $node->constExpr->className;
 			}
statusReason: 1) SuccessResponseDataHelperTest: Object const return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testObjectConstReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'TestObject'
+'abc'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:234

[Killed] NotIdentical
PhpDocParser.php:235:4
 				return $node->constExpr->className;
 			}
 
-			if (enum_exists($class) && $node->constExpr->name !== "*") {
+			if (enum_exists($class) && $node->constExpr->name === "*") {
 				return (string)constant($class . '::' . $node->constExpr->name)->value;
 			}
statusReason: 1) SuccessResponseDataHelperTest: Enum value return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testEnumValueReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'array'
+'string'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:178

[Killed] LogicalAnd
PhpDocParser.php:235:4
 				return $node->constExpr->className;
 			}
 
-			if (enum_exists($class) && $node->constExpr->name !== "*") {
+			if (enum_exists($class) || $node->constExpr->name !== "*") {
 				return (string)constant($class . '::' . $node->constExpr->name)->value;
 			}
statusReason: 1) SuccessResponseDataHelperTest: List of enum values with astrix return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testListOfEnumValuesWithAstrixReturn
Failed asserting that '#/components/schemas/RBAC_Permissions' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:168
#2  /var/www/kernel-api-framework/vendor/bin/codecept:

[Killed] ConcatOperandRemoval
PhpDocParser.php:236:5
 			}
 
 			if (enum_exists($class) && $node->constExpr->name !== "*") {
-				return (string)constant($class . '::' . $node->constExpr->name)->value;
+				return (string) constant($class . '::')->value;
 			}
 
statusReason: 1) SuccessResponseDataHelperTest: Array shape return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testArrayShapeReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'array'
+'object'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:200

[Killed] Concat
PhpDocParser.php:236:5
 			}
 
 			if (enum_exists($class) && $node->constExpr->name !== "*") {
-				return (string)constant($class . '::' . $node->constExpr->name)->value;
+				return (string) constant('::' . $class . $node->constExpr->name)->value;
 			}
 
statusReason: 1) SuccessResponseDataHelperTest: Enum value return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testEnumValueReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'array'
+'string'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:178

[Killed] Identical
PhpDocParser.php:240:4
 			}
 
 			//Если нужно получить массив констант - возвращает имя класса
-			if ((enum_exists($class) || class_exists($class)) && $node->constExpr->name === '*') {
+			if ((enum_exists($class) || class_exists($class)) && $node->constExpr->name !== '*') {
 				return $class;
 			}
statusReason: 1) SuccessResponseDataHelperTest: List of enum values with astrix return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testListOfEnumValuesWithAstrixReturn
Failed asserting that '#/components/schemas/RBAC_Permissions' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:168
#2  /var/www/kernel-api-framework/vendor/bin/codecept:

[Killed] LogicalOrAllSubExprNegation
PhpDocParser.php:240:4
 			}
 
 			//Если нужно получить массив констант - возвращает имя класса
-			if ((enum_exists($class) || class_exists($class)) && $node->constExpr->name === '*') {
+			if ((!enum_exists($class) || !class_exists($class)) && $node->constExpr->name === '*') {
 				return $class;
 			}
statusReason: 1) SuccessResponseDataHelperTest: List of enum values with astrix return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testListOfEnumValuesWithAstrixReturn
Failed asserting that '#/components/schemas/RBAC_Permissions' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:168
#2  /var/www/kernel-api-framework/vendor/bin/codecept:

[Killed] ConcatOperandRemoval
PhpDocParser.php:243:4
 			if ((enum_exists($class) || class_exists($class)) && $node->constExpr->name === '*') {
 				return $class;
 			}
-			return (string)constant($class . '::' . $node->constExpr->name);
+			return (string) constant('::' . $node->constExpr->name);
 		}
 		return 'Unknown type';
statusReason: 1) SuccessResponseDataHelperTest: Object const return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testObjectConstReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'array'
+'string'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:233

[Killed] ConcatOperandRemoval
PhpDocParser.php:243:4
 			if ((enum_exists($class) || class_exists($class)) && $node->constExpr->name === '*') {
 				return $class;
 			}
-			return (string)constant($class . '::' . $node->constExpr->name);
+			return (string) constant($class . '::');
 		}
 		return 'Unknown type';
statusReason: 1) SuccessResponseDataHelperTest: Object const return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testObjectConstReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'array'
+'string'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:233

[Killed] LogicalOrAllSubExprNegation
PhpDocParser.php:254:3
 	private function getPrimitiveValueOrProperties(Node $node): array|string
 	{
 		$value = $this->getPrimitiveValue($node);
-		if (!class_exists($value) || enum_exists($value)) {
+		if (class_exists($value) || !enum_exists($value)) {
 			return $value;
 		}
statusReason: 1) SuccessResponseDataHelperTest: Object all constants return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testObjectAllConstantsReturn
Failed asserting that 'string' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:244
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 21, Assertions: 72, Failures

[Killed] LogicalOr
PhpDocParser.php:254:3
 	private function getPrimitiveValueOrProperties(Node $node): array|string
 	{
 		$value = $this->getPrimitiveValue($node);
-		if (!class_exists($value) || enum_exists($value)) {
+		if (!class_exists($value) && enum_exists($value)) {
 			return $value;
 		}
statusReason: 1) SuccessResponseDataHelperTest: List of enum values with astrix return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testListOfEnumValuesWithAstrixReturn
Failed asserting that '#/components/schemas/RBAC_Permissions' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:168
#2  /var/www/kernel-api-framework/vendor/bin/codecept:

[Killed] LogicalAndAllSubExprNegation
PhpDocParser.php:259:4
 		}
 
 		if (
-			$node instanceof ConstTypeNode
-			&& $node->constExpr instanceof ConstFetchNode
-			&& $node->constExpr->name === '*'
+			if (!$node instanceof ConstTypeNode && !$node->constExpr instanceof ConstFetchNode && !($node->constExpr->name === '*')) {'*'
 		) {
 			return $this->getAllConstValuesOrNames($value);
statusReason: 1) SuccessResponseDataHelperTest: Object return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testObjectReturn
Failed asserting that '#/components/schemas/entities_TestObject' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:99
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 2, Assertions: 2, Fai

[Killed] LogicalAndNegation
PhpDocParser.php:259:4
 		}
 
 		if (
-			$node instanceof ConstTypeNode
-			&& $node->constExpr instanceof ConstFetchNode
-			&& $node->constExpr->name === '*'
+			if (!($node instanceof ConstTypeNode && $node->constExpr instanceof ConstFetchNode && $node->constExpr->name === '*')) {'*'
 		) {
 			return $this->getAllConstValuesOrNames($value);
statusReason: 1) SuccessResponseDataHelperTest: Object return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testObjectReturn
Failed asserting that '#/components/schemas/entities_TestObject' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:99
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 2, Assertions: 3, Fai

[Killed] InstanceOf_
PhpDocParser.php:260:4
 
 		if (
 			$node instanceof ConstTypeNode
-			&& $node->constExpr instanceof ConstFetchNode
+			if ($node instanceof ConstTypeNode && false && $node->constExpr->name === '*') {
 			&& $node->constExpr->name === '*'
 		) {
statusReason: 1) SuccessResponseDataHelperTest: Object all constants return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testObjectAllConstantsReturn
Failed asserting that 'string' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:244
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 19, Assertions: 65, Failures

[Survived] InstanceOf_
PhpDocParser.php:260:4
 
 		if (
 			$node instanceof ConstTypeNode
-			&& $node->constExpr instanceof ConstFetchNode
+			if ($node instanceof ConstTypeNode && true && $node->constExpr->name === '*') {
 			&& $node->constExpr->name === '*'
 		) {

[Killed] Identical
PhpDocParser.php:261:4
 		if (
 			$node instanceof ConstTypeNode
 			&& $node->constExpr instanceof ConstFetchNode
-			&& $node->constExpr->name === '*'
+			if ($node instanceof ConstTypeNode && $node->constExpr instanceof ConstFetchNode && $node->constExpr->name !== '*') {
 		) {
 			return $this->getAllConstValuesOrNames($value);
statusReason: 1) SuccessResponseDataHelperTest: Object all constants return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testObjectAllConstantsReturn
Failed asserting that 'string' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:244
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 12, Assertions: 31, Failures

[NoCoverage] LogicalOr
PhpDocParser.php:273:3
 
 	private function isEntityExists(string $className): bool
 	{
-		return $this->isEnumOrClass($className) || interface_exists($className);
+		return $this->isEnumOrClass($className) && interface_exists($className);
 	}
 

[NoCoverage] LogicalOrNegation
PhpDocParser.php:273:3
 
 	private function isEntityExists(string $className): bool
 	{
-		return $this->isEnumOrClass($className) || interface_exists($className);
+		return !($this->isEnumOrClass($className) || interface_exists($className));
 	}
 

[Killed] LogicalOrNegation
PhpDocParser.php:278:3
 
 	private function isEnumOrClass(string $className): bool
 	{
-		return class_exists($className) || enum_exists($className);
+		return !(class_exists($className) || enum_exists($className));
 	}
 
statusReason: 1) SuccessResponseDataHelperTest: Object all constants return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testObjectAllConstantsReturn
Failed asserting that two arrays are equal.
- Expected | + Actual
@@ @@
Array (
-    0 => 'TestObject'
+    0 => 'abc'

[Killed] LogicalOr
PhpDocParser.php:278:3
 
 	private function isEnumOrClass(string $className): bool
 	{
-		return class_exists($className) || enum_exists($className);
+		return class_exists($className) && enum_exists($className);
 	}
 
statusReason: 1) SuccessResponseDataHelperTest: Object all constants return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testObjectAllConstantsReturn
Failed asserting that two arrays are equal.
- Expected | + Actual
@@ @@
Array (
-    0 => 'TestObject'
+    0 => 'abc'

[Killed] MatchArmRemoval
PhpDocParser.php:283:3
 
 	private function convertNestedToArray(TypeNode $node): array|string
 	{
-		return match (true) {
-			$node instanceof ArrayShapeNode => $this->convertArrayShapeTypeToArray($node),
-			$node instanceof ArrayTypeNode => $this->convertArrayType($node),
-			$node instanceof GenericTypeNode => $this->convertGenericType($node),
-			$node instanceof UnionTypeNode => $this->convertUnionTypeToArray($node),
-			$node instanceof ThrowsTagValueNode => $this->convertThrowsTypeToClassNames($node)
-		};
+		
 	}
 
statusReason: 1) SuccessResponseDataHelperTest: Array shape return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testArrayShapeReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'array'
+'object'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:200

[Killed] InstanceOf_
PhpDocParser.php:284:4
 	private function convertNestedToArray(TypeNode $node): array|string
 	{
 		return match (true) {
-			$node instanceof ArrayShapeNode => $this->convertArrayShapeTypeToArray($node),
+			false => $this->convertArrayShapeTypeToArray($node),
 			$node instanceof ArrayTypeNode => $this->convertArrayType($node),
 			$node instanceof GenericTypeNode => $this->convertGenericType($node),
statusReason: 1) SuccessResponseDataHelperTest: Array shape return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testArrayShapeReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'array'
+'object'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:200

[Killed] InstanceOf_
PhpDocParser.php:284:4
 	private function convertNestedToArray(TypeNode $node): array|string
 	{
 		return match (true) {
-			$node instanceof ArrayShapeNode => $this->convertArrayShapeTypeToArray($node),
+			true => $this->convertArrayShapeTypeToArray($node),
 			$node instanceof ArrayTypeNode => $this->convertArrayType($node),
 			$node instanceof GenericTypeNode => $this->convertGenericType($node),
statusReason: 1) SuccessResponseDataHelperTest: Associative array return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testAssociativeArrayReturn
Failed asserting that '#/components/schemas/entities_TestObject' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:118
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests:

[Killed] InstanceOf_
PhpDocParser.php:285:4
 	{
 		return match (true) {
 			$node instanceof ArrayShapeNode => $this->convertArrayShapeTypeToArray($node),
-			$node instanceof ArrayTypeNode => $this->convertArrayType($node),
+			false => $this->convertArrayType($node),
 			$node instanceof GenericTypeNode => $this->convertGenericType($node),
 			$node instanceof UnionTypeNode => $this->convertUnionTypeToArray($node),
statusReason: 1) SuccessResponseDataHelperTest: Object collection return will fail
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testObjectCollectionReturnWillFail
Failed asserting that exception with message "Допустим только один тип или набор значений(исключение null)" is thrown
#1  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 7, Assertions: 29, Failures: 1.

[Killed] InstanceOf_
PhpDocParser.php:285:4
 	{
 		return match (true) {
 			$node instanceof ArrayShapeNode => $this->convertArrayShapeTypeToArray($node),
-			$node instanceof ArrayTypeNode => $this->convertArrayType($node),
+			true => $this->convertArrayType($node),
 			$node instanceof GenericTypeNode => $this->convertGenericType($node),
 			$node instanceof UnionTypeNode => $this->convertUnionTypeToArray($node),
statusReason: 1) SuccessResponseDataHelperTest: List of enum values with astrix return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testListOfEnumValuesWithAstrixReturn
Failed asserting that '#/components/schemas/RBAC_Permissions' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:168
#2  /var/www/kernel-api-framework/vendor/bin/codecept:

[Killed] InstanceOf_
PhpDocParser.php:286:4
 		return match (true) {
 			$node instanceof ArrayShapeNode => $this->convertArrayShapeTypeToArray($node),
 			$node instanceof ArrayTypeNode => $this->convertArrayType($node),
-			$node instanceof GenericTypeNode => $this->convertGenericType($node),
+			false => $this->convertGenericType($node),
 			$node instanceof UnionTypeNode => $this->convertUnionTypeToArray($node),
 			$node instanceof ThrowsTagValueNode => $this->convertThrowsTypeToClassNames($node)
statusReason: 1) SuccessResponseDataHelperTest: Array shape return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testArrayShapeReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'array'
+'object'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:200

[Killed] InstanceOf_
PhpDocParser.php:286:4
 		return match (true) {
 			$node instanceof ArrayShapeNode => $this->convertArrayShapeTypeToArray($node),
 			$node instanceof ArrayTypeNode => $this->convertArrayType($node),
-			$node instanceof GenericTypeNode => $this->convertGenericType($node),
+			true => $this->convertGenericType($node),
 			$node instanceof UnionTypeNode => $this->convertUnionTypeToArray($node),
 			$node instanceof ThrowsTagValueNode => $this->convertThrowsTypeToClassNames($node)
statusReason: 1) SuccessResponseDataHelperTest: Nullable return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testNullableReturn
Failed asserting that '#/components/schemas/entities_TestObject' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:222
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0

[Killed] InstanceOf_
PhpDocParser.php:287:4
 			$node instanceof ArrayShapeNode => $this->convertArrayShapeTypeToArray($node),
 			$node instanceof ArrayTypeNode => $this->convertArrayType($node),
 			$node instanceof GenericTypeNode => $this->convertGenericType($node),
-			$node instanceof UnionTypeNode => $this->convertUnionTypeToArray($node),
+			false => $this->convertUnionTypeToArray($node),
 			$node instanceof ThrowsTagValueNode => $this->convertThrowsTypeToClassNames($node)
 		};
statusReason: 1) SuccessResponseDataHelperTest: Array shape return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testArrayShapeReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'array'
+'object'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:200

[Survived] InstanceOf_
PhpDocParser.php:287:4
 			$node instanceof ArrayShapeNode => $this->convertArrayShapeTypeToArray($node),
 			$node instanceof ArrayTypeNode => $this->convertArrayType($node),
 			$node instanceof GenericTypeNode => $this->convertGenericType($node),
-			$node instanceof UnionTypeNode => $this->convertUnionTypeToArray($node),
+			true => $this->convertUnionTypeToArray($node),
 			$node instanceof ThrowsTagValueNode => $this->convertThrowsTypeToClassNames($node)
 		};

[Survived] InstanceOf_
PhpDocParser.php:288:4
 			$node instanceof ArrayTypeNode => $this->convertArrayType($node),
 			$node instanceof GenericTypeNode => $this->convertGenericType($node),
 			$node instanceof UnionTypeNode => $this->convertUnionTypeToArray($node),
-			$node instanceof ThrowsTagValueNode => $this->convertThrowsTypeToClassNames($node)
+			false => $this->convertThrowsTypeToClassNames($node),
 		};
 	}

[Survived] InstanceOf_
PhpDocParser.php:288:4
 			$node instanceof ArrayTypeNode => $this->convertArrayType($node),
 			$node instanceof GenericTypeNode => $this->convertGenericType($node),
 			$node instanceof UnionTypeNode => $this->convertUnionTypeToArray($node),
-			$node instanceof ThrowsTagValueNode => $this->convertThrowsTypeToClassNames($node)
+			true => $this->convertThrowsTypeToClassNames($node),
 		};
 	}

[Killed] NotIdentical
PhpDocParser.php:298:4
 
 		foreach ($node->items as $item) {
 			$key = null;
-			if ($item->keyName !== null) {
+			if ($item->keyName === null) {
 				if ($this->isPrimitive($item->keyName)) {
 					$key = $this->getPrimitiveValue($item->keyName);
statusReason: 1) SuccessResponseDataHelperTest: Array shape return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testArrayShapeReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'array'
+'object'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:200

[Killed] IfNegation
PhpDocParser.php:299:5
 		foreach ($node->items as $item) {
 			$key = null;
 			if ($item->keyName !== null) {
-				if ($this->isPrimitive($item->keyName)) {
-					$key = $this->getPrimitiveValue($item->keyName);
-				} elseif ($item->keyName instanceof GenericTypeNode) {
-					$converted = $this->convertGenericTypeToKey($item->keyName);
-					if ($converted !== null) {
-						$key = $converted;
-					}
-				}
+				if (!$this->isPrimitive($item->keyName)) {
 			}
 
statusReason: 1) SuccessResponseDataHelperTest: Array shape return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testArrayShapeReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'array'
+'object'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:200

[NoCoverage] InstanceOf_
PhpDocParser.php:301:5
 			if ($item->keyName !== null) {
 				if ($this->isPrimitive($item->keyName)) {
 					$key = $this->getPrimitiveValue($item->keyName);
-				} elseif ($item->keyName instanceof GenericTypeNode) {
+				} elseif (false) {
 					$converted = $this->convertGenericTypeToKey($item->keyName);
 					if ($converted !== null) {

[NoCoverage] InstanceOf_
PhpDocParser.php:301:5
 			if ($item->keyName !== null) {
 				if ($this->isPrimitive($item->keyName)) {
 					$key = $this->getPrimitiveValue($item->keyName);
-				} elseif ($item->keyName instanceof GenericTypeNode) {
+				} elseif (true) {
 					$converted = $this->convertGenericTypeToKey($item->keyName);
 					if ($converted !== null) {

[NoCoverage] NotIdentical
PhpDocParser.php:303:6
 					$key = $this->getPrimitiveValue($item->keyName);
 				} elseif ($item->keyName instanceof GenericTypeNode) {
 					$converted = $this->convertGenericTypeToKey($item->keyName);
-					if ($converted !== null) {
+					if ($converted === null) {
 						$key = $converted;
 					}

[Killed] IfNegation
PhpDocParser.php:309:4
 				}
 			}
 
-			if ($this->isPrimitive($item->valueType)) {
-				$value = $this->getPrimitiveValueOrProperties($item->valueType);
-			} else {
-				$value = $this->convertNestedToArray($item->valueType);
-			}
+			if (!$this->isPrimitive($item->valueType)) {
 
 			if ($item->optional && $key !== null) {
statusReason: 1) SuccessResponseDataHelperTest: Array shape return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testArrayShapeReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'array'
+'object'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:200

[Killed] LogicalAndAllSubExprNegation
PhpDocParser.php:315:4
 				$value = $this->convertNestedToArray($item->valueType);
 			}
 
-			if ($item->optional && $key !== null) {
+			if (!$item->optional && !($key !== null)) {
 				$key .= '?';
 			}
statusReason: 1) SuccessResponseDataHelperTest: Array shape return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testArrayShapeReturn
Failed asserting that '#/components/schemas/entities_TestObject' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:203
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 9, Assertio

[Killed] LogicalAnd
PhpDocParser.php:315:4
 				$value = $this->convertNestedToArray($item->valueType);
 			}
 
-			if ($item->optional && $key !== null) {
+			if ($item->optional || $key !== null) {
 				$key .= '?';
 			}
statusReason: 1) SuccessResponseDataHelperTest: Array shape return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testArrayShapeReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'test?'
+'test'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:213

[Killed] Assignment
PhpDocParser.php:316:5
 			}
 
 			if ($item->optional && $key !== null) {
-				$key .= '?';
+				$key = '?';
 			}
 
statusReason: 1) SuccessResponseDataHelperTest: Array shape return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testArrayShapeReturn
Failed asserting that '#/components/schemas/entities_TestObject' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:203
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 21, Asserti
