[Killed] LogicalNot
PhpDocParser.php:319:4
 				$key .= '?';
 			}
 
-			if (!empty($key)) {
+			if (empty($key)) {
 				$result[$key] = $value;
 			} else {
statusReason: 1) SuccessResponseDataHelperTest: Array shape return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testArrayShapeReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'array'
+'object'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:200

[Killed] IfNegation
PhpDocParser.php:330:3
 
 	private function convertArrayType(ArrayTypeNode $node): array
 	{
-		if ($this->isPrimitive($node->type)) {
-			return ['int|string' => $this->getPrimitiveValueOrProperties($node->type)];
-		}
+		if (!$this->isPrimitive($node->type)) {
 
 		$result = $this->convertNestedToArray($node->type);
statusReason: 1) SuccessResponseDataHelperTest: Object collection return will fail
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testObjectCollectionReturnWillFail
Failed asserting that exception with message "Допустим только один тип или набор значений(исключение null)" is thrown
#1  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 5, Assertions: 10, Failures: 1.

[Killed] ArrayItemRemoval
PhpDocParser.php:331:4
 	private function convertArrayType(ArrayTypeNode $node): array
 	{
 		if ($this->isPrimitive($node->type)) {
-			return ['int|string' => $this->getPrimitiveValueOrProperties($node->type)];
+			return [];
 		}
 
statusReason: 1) SuccessResponseDataHelperTest: Object collection return will fail
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testObjectCollectionReturnWillFail
Failed asserting that exception with message "Допустим только один тип или набор значений(исключение null)" is thrown
#1  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 3, Assertions: 12, Failures: 1.

[NoCoverage] Ternary
PhpDocParser.php:335:3
 		}
 
 		$result = $this->convertNestedToArray($node->type);
-		return is_string($result) ? [$result] : $result;
+		return is_string($result) ? $result : [$result];
 	}
 

[Killed] MatchArmRemoval
PhpDocParser.php:340:3
 
 	private function convertGenericType(GenericTypeNode $node): array|string
 	{
-		return match ($node->type->name) {
-			'list' => $this->convertList($node),
-			'properties-of' => $this->getPropertiesOf($node),
-			'value-of' => $this->getValueOf($node),
-			'key-of' => $this->getKeyOf($node),
-			'array' => $this->getArray($node),
-			'class-string' => $this->getClassString($node),
-			'int' => $this->getInt($node)
-		};
+		
 	}
 
statusReason: 1) SuccessResponseDataHelperTest: Keys is constants return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testKeysIsConstantsReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'array'
+'object'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:254

[Killed] Ternary
PhpDocParser.php:354:3
 	private function convertGenericTypeToKey(GenericTypeNode $node): ?string
 	{
 		$converted = $this->convertGenericType($node);
-		return is_string($converted) ? $converted : null;
+		return is_string($converted) ? null : $converted;
 	}
 
statusReason: 1) SuccessResponseDataHelperTest: Keys is constants return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testKeysIsConstantsReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'array'
+'object'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:254

[Killed] LogicalNot
PhpDocParser.php:359:3
 
 	private function convertList(GenericTypeNode $node): array
 	{
-		if (!empty($node->genericTypes[0]->types)) {
+		if (empty($node->genericTypes[0]->types)) {
 			$result[self::OR] = [];
 			foreach ($node->genericTypes[0]->types as $item) {
statusReason: 1) SuccessResponseDataHelperTest: List of objects return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testListOfObjectsReturn
Failed asserting that 'array' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:141
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 5, Assertions: 7, Failures: 1.

[Survived] IncrementInteger
PhpDocParser.php:359:3
 
 	private function convertList(GenericTypeNode $node): array
 	{
-		if (!empty($node->genericTypes[0]->types)) {
+		if (!empty($node->genericTypes[1]->types)) {
 			$result[self::OR] = [];
 			foreach ($node->genericTypes[0]->types as $item) {

[NoCoverage] IncrementInteger
PhpDocParser.php:361:4
 	{
 		if (!empty($node->genericTypes[0]->types)) {
 			$result[self::OR] = [];
-			foreach ($node->genericTypes[0]->types as $item) {
+			foreach ($node->genericTypes[1]->types as $item) {
 				if ($this->isPrimitive($item)) {
 					$result[self::OR][] = $this->getPrimitiveValueOrProperties($item);

[NoCoverage] Foreach_
PhpDocParser.php:361:4
 	{
 		if (!empty($node->genericTypes[0]->types)) {
 			$result[self::OR] = [];
-			foreach ($node->genericTypes[0]->types as $item) {
-				if ($this->isPrimitive($item)) {
-					$result[self::OR][] = $this->getPrimitiveValueOrProperties($item);
-				} else {
-					$result[self::OR][] = $this->convertNestedToArray($item);
-				}
-			}
+			foreach (array() as $item) {
 			return $result;
 		}

[NoCoverage] IfNegation
PhpDocParser.php:362:5
 		if (!empty($node->genericTypes[0]->types)) {
 			$result[self::OR] = [];
 			foreach ($node->genericTypes[0]->types as $item) {
-				if ($this->isPrimitive($item)) {
-					$result[self::OR][] = $this->getPrimitiveValueOrProperties($item);
-				} else {
-					$result[self::OR][] = $this->convertNestedToArray($item);
-				}
+				if (!$this->isPrimitive($item)) {
 			}
 			return $result;

[Killed] IncrementInteger
PhpDocParser.php:371:3
 			return $result;
 		}
 
-		if ($this->isPrimitive($node->genericTypes[0])) {
+		if ($this->isPrimitive($node->genericTypes[1])) {
 			return [$this->getPrimitiveValueOrProperties($node->genericTypes[0])];
 		}
statusReason: 1) SuccessResponseDataHelperTest: List of enum values with astrix return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testListOfEnumValuesWithAstrixReturn
Failed asserting that '#/components/schemas/RBAC_Permissions' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:168
#2  /var/www/kernel-api-framework/vendor/bin/codecept:

[Killed] IfNegation
PhpDocParser.php:371:3
 			return $result;
 		}
 
-		if ($this->isPrimitive($node->genericTypes[0])) {
-			return [$this->getPrimitiveValueOrProperties($node->genericTypes[0])];
-		}
+		if (!$this->isPrimitive($node->genericTypes[0])) {
 		return [$this->convertNestedToArray($node->genericTypes[0])];
 	}
statusReason: 1) SuccessResponseDataHelperTest: List of enum values return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testListOfEnumValuesReturn
Failed asserting that '#/components/schemas/RBAC_Permissions' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:190
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests:

[Killed] IncrementInteger
PhpDocParser.php:372:4
 		}
 
 		if ($this->isPrimitive($node->genericTypes[0])) {
-			return [$this->getPrimitiveValueOrProperties($node->genericTypes[0])];
+			return [$this->getPrimitiveValueOrProperties($node->genericTypes[1])];
 		}
 		return [$this->convertNestedToArray($node->genericTypes[0])];
statusReason: 1) SuccessResponseDataHelperTest: List of enum values return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testListOfEnumValuesReturn
Failed asserting that '#/components/schemas/RBAC_Permissions' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:190
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests:

[NoCoverage] IncrementInteger
PhpDocParser.php:374:3
 		if ($this->isPrimitive($node->genericTypes[0])) {
 			return [$this->getPrimitiveValueOrProperties($node->genericTypes[0])];
 		}
-		return [$this->convertNestedToArray($node->genericTypes[0])];
+		return [$this->convertNestedToArray($node->genericTypes[1])];
 	}
 

[NoCoverage] ArrayItemRemoval
PhpDocParser.php:374:3
 		if ($this->isPrimitive($node->genericTypes[0])) {
 			return [$this->getPrimitiveValueOrProperties($node->genericTypes[0])];
 		}
-		return [$this->convertNestedToArray($node->genericTypes[0])];
+		return [];
 	}
 

[NoCoverage] IncrementInteger
PhpDocParser.php:379:3
 
 	private function getPropertiesOf(GenericTypeNode $node): string
 	{
-		if (!$this->isPrimitive($node->genericTypes[0])) {
+		if (!$this->isPrimitive($node->genericTypes[1])) {
 			throw new Exception("Значение properties-of не может иметь вложенности!");
 		}

[NoCoverage] LogicalNot
PhpDocParser.php:379:3
 
 	private function getPropertiesOf(GenericTypeNode $node): string
 	{
-		if (!$this->isPrimitive($node->genericTypes[0])) {
+		if ($this->isPrimitive($node->genericTypes[0])) {
 			throw new Exception("Значение properties-of не может иметь вложенности!");
 		}

[NoCoverage] Throw_
PhpDocParser.php:380:4
 	private function getPropertiesOf(GenericTypeNode $node): string
 	{
 		if (!$this->isPrimitive($node->genericTypes[0])) {
-			throw new Exception("Значение properties-of не может иметь вложенности!");
+			new Exception("Значение properties-of не может иметь вложенности!");
 		}
 

[NoCoverage] IncrementInteger
PhpDocParser.php:383:3
 			throw new Exception("Значение properties-of не может иметь вложенности!");
 		}
 
-		return $this->getPrimitiveValueOrProperties($node->genericTypes[0]);
+		return $this->getPrimitiveValueOrProperties($node->genericTypes[1]);
 	}
 

[NoCoverage] IncrementInteger
PhpDocParser.php:389:4
 	private function getValueOf(GenericTypeNode $node): string
 	{
 		if (!empty($node->genericTypes[0]->types)) {
-			$items = $node->genericTypes[0]->types;
+			$items = $node->genericTypes[1]->types;
 		} else {
 			$items = [$node->genericTypes[0]];

[Killed] IncrementInteger
PhpDocParser.php:391:4
 		if (!empty($node->genericTypes[0]->types)) {
 			$items = $node->genericTypes[0]->types;
 		} else {
-			$items = [$node->genericTypes[0]];
+			$items = [$node->genericTypes[1]];
 		}
 
statusReason: 1) SuccessResponseDataHelperTest: Array shape return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testArrayShapeReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'array'
+'object'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:200

[Killed] Foreach_
PhpDocParser.php:395:3
 		}
 
 		$result = [];
-		foreach ($items as $type) {
-			if ($this->isPrimitive($type)) {
-				$class = $this->getPrimitiveValue($type);
-				if ($type instanceof ConstTypeNode) {
-					if ($type->constExpr instanceof ConstFetchNode && $type->constExpr->name === '*') {
-						$result[] = $this->getAllConstValuesOrNames($class);
-					} else {
-						$result[] = $class;
-					}
-				} elseif ($type instanceof IdentifierTypeNode) {
-					if (!enum_exists($class)) {
-						throw new Exception("Примитивные типы должны быть либо константами класса, либо enum'ами");
-					}
-					/** @var BackedEnum $class */
-					$result = array_merge($result, array_column($class::cases(), 'value'));
-				}
-			} else {
-				$result = array_merge($result, array_values((array)$this->convertNestedToArray($type)));
-			}
-		}
+		foreach (array() as $type) {
 		return implode('|', array_unique($result));
 	}
statusReason: 1) SuccessResponseDataHelperTest: Keys is constants return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testKeysIsConstantsReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'array'
+'object'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:254

[Killed] IfNegation
PhpDocParser.php:396:4
 
 		$result = [];
 		foreach ($items as $type) {
-			if ($this->isPrimitive($type)) {
-				$class = $this->getPrimitiveValue($type);
-				if ($type instanceof ConstTypeNode) {
-					if ($type->constExpr instanceof ConstFetchNode && $type->constExpr->name === '*') {
-						$result[] = $this->getAllConstValuesOrNames($class);
-					} else {
-						$result[] = $class;
-					}
-				} elseif ($type instanceof IdentifierTypeNode) {
-					if (!enum_exists($class)) {
-						throw new Exception("Примитивные типы должны быть либо константами класса, либо enum'ами");
-					}
-					/** @var BackedEnum $class */
-					$result = array_merge($result, array_column($class::cases(), 'value'));
-				}
-			} else {
-				$result = array_merge($result, array_values((array)$this->convertNestedToArray($type)));
-			}
+			if (!$this->isPrimitive($type)) {
 		}
 		return implode('|', array_unique($result));
statusReason: 1) SuccessResponseDataHelperTest: Array shape return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testArrayShapeReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'array'
+'object'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:200

[Killed] InstanceOf_
PhpDocParser.php:398:5
 		foreach ($items as $type) {
 			if ($this->isPrimitive($type)) {
 				$class = $this->getPrimitiveValue($type);
-				if ($type instanceof ConstTypeNode) {
+				if (true) {
 					if ($type->constExpr instanceof ConstFetchNode && $type->constExpr->name === '*') {
 						$result[] = $this->getAllConstValuesOrNames($class);
statusReason: 1) SuccessResponseDataHelperTest: Keys is constants return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testKeysIsConstantsReturn
Failed asserting that two arrays are equal.
- Expected | + Actual
@@ @@
Array (
-    0 => 'oAccessBookmakerCabinet'
-    1 => 'oAccessPartnerCabinet'

[Survived] InstanceOf_
PhpDocParser.php:398:5
 		foreach ($items as $type) {
 			if ($this->isPrimitive($type)) {
 				$class = $this->getPrimitiveValue($type);
-				if ($type instanceof ConstTypeNode) {
+				if (false) {
 					if ($type->constExpr instanceof ConstFetchNode && $type->constExpr->name === '*') {
 						$result[] = $this->getAllConstValuesOrNames($class);

[NoCoverage] Identical
PhpDocParser.php:399:6
 			if ($this->isPrimitive($type)) {
 				$class = $this->getPrimitiveValue($type);
 				if ($type instanceof ConstTypeNode) {
-					if ($type->constExpr instanceof ConstFetchNode && $type->constExpr->name === '*') {
+					if ($type->constExpr instanceof ConstFetchNode && $type->constExpr->name !== '*') {
 						$result[] = $this->getAllConstValuesOrNames($class);
 					} else {

[NoCoverage] LogicalAndNegation
PhpDocParser.php:399:6
 			if ($this->isPrimitive($type)) {
 				$class = $this->getPrimitiveValue($type);
 				if ($type instanceof ConstTypeNode) {
-					if ($type->constExpr instanceof ConstFetchNode && $type->constExpr->name === '*') {
+					if (!($type->constExpr instanceof ConstFetchNode && $type->constExpr->name === '*')) {
 						$result[] = $this->getAllConstValuesOrNames($class);
 					} else {

[Killed] InstanceOf_
PhpDocParser.php:404:5
 					} else {
 						$result[] = $class;
 					}
-				} elseif ($type instanceof IdentifierTypeNode) {
+				} elseif (false) {
 					if (!enum_exists($class)) {
 						throw new Exception("Примитивные типы должны быть либо константами класса, либо enum'ами");
statusReason: 1) SuccessResponseDataHelperTest: Keys is constants return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testKeysIsConstantsReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'array'
+'object'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:254

[Survived] InstanceOf_
PhpDocParser.php:404:5
 					} else {
 						$result[] = $class;
 					}
-				} elseif ($type instanceof IdentifierTypeNode) {
+				} elseif (true) {
 					if (!enum_exists($class)) {
 						throw new Exception("Примитивные типы должны быть либо константами класса, либо enum'ами");

[Killed] LogicalNot
PhpDocParser.php:405:6
 						$result[] = $class;
 					}
 				} elseif ($type instanceof IdentifierTypeNode) {
-					if (!enum_exists($class)) {
+					if (enum_exists($class)) {
 						throw new Exception("Примитивные типы должны быть либо константами класса, либо enum'ами");
 					}
statusReason: 1) SuccessResponseDataHelperTest: Array shape return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testArrayShapeReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'array'
+'object'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:200

[NoCoverage] Throw_
PhpDocParser.php:406:7
 					}
 				} elseif ($type instanceof IdentifierTypeNode) {
 					if (!enum_exists($class)) {
-						throw new Exception("Примитивные типы должны быть либо константами класса, либо enum'ами");
+						new Exception("Примитивные типы должны быть либо константами класса, либо enum'ами");
 					}
 					/** @var BackedEnum $class */

[Killed] UnwrapArrayMerge
PhpDocParser.php:409:6
 						throw new Exception("Примитивные типы должны быть либо константами класса, либо enum'ами");
 					}
 					/** @var BackedEnum $class */
-					$result = array_merge($result, array_column($class::cases(), 'value'));
+					$result = $result;
 				}
 			} else {
statusReason: 1) SuccessResponseDataHelperTest: Array shape return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testArrayShapeReturn
Failed asserting that two arrays are equal.
- Expected | + Actual
@@ @@
Array (
-    0 => ''
+    0 => 'oAccessBookmakerCabinet'

[Killed] ArrayItemRemoval
PhpDocParser.php:423:4
 		if (!empty($node->genericTypes[0]->types)) {
 			$items = $node->genericTypes[0]->types;
 		} else {
-			$items = [$node->genericTypes[0]];
+			$items = [];
 		}
 
statusReason: 1) SuccessResponseDataHelperTest: Array shape return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testArrayShapeReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-''
+'test'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:213

[Killed] Foreach_
PhpDocParser.php:427:3
 		}
 
 		$result = [];
-		foreach ($items as $type) {
-			if ($this->isPrimitive($type)) {
-				$class = $this->getPrimitiveValue($type);
-				if ($type instanceof ConstTypeNode) {
-					if ($type->constExpr instanceof ConstFetchNode && $type->constExpr->name === '*') {
-						$this->getAllConstValuesOrNames($class, 'name');
-					} else {
-						$result[] = $type->constExpr->name;
-					}
-				} elseif ($type instanceof IdentifierTypeNode) {
-					if (!enum_exists($class)) {
-						throw new Exception("Примитивные типы должны быть либо константами класса, либо enum'ами");
-					}
-					/** @var BackedEnum $class */
-					$result = array_merge($result, array_column($class::cases(), 'name'));
-				}
-			} elseif ($type instanceof GenericTypeNode && $type->type->name === 'list') {
-				$result = array_merge($result, ['int']);
-			} elseif (is_array($value = $this->convertNestedToArray($type))) {
-				$result = array_merge($result, array_keys($value));
-			}
-		}
+		foreach (array() as $type) {
 		return implode('|', array_unique($result));
 	}
statusReason: 1) SuccessResponseDataHelperTest: Array shape return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testArrayShapeReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-''
+'test'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:213

[Killed] IfNegation
PhpDocParser.php:428:4
 
 		$result = [];
 		foreach ($items as $type) {
-			if ($this->isPrimitive($type)) {
-				$class = $this->getPrimitiveValue($type);
-				if ($type instanceof ConstTypeNode) {
-					if ($type->constExpr instanceof ConstFetchNode && $type->constExpr->name === '*') {
-						$this->getAllConstValuesOrNames($class, 'name');
-					} else {
-						$result[] = $type->constExpr->name;
-					}
-				} elseif ($type instanceof IdentifierTypeNode) {
-					if (!enum_exists($class)) {
-						throw new Exception("Примитивные типы должны быть либо константами класса, либо enum'ами");
-					}
-					/** @var BackedEnum $class */
-					$result = array_merge($result, array_column($class::cases(), 'name'));
-				}
-			} elseif ($type instanceof GenericTypeNode && $type->type->name === 'list') {
-				$result = array_merge($result, ['int']);
-			} elseif (is_array($value = $this->convertNestedToArray($type))) {
-				$result = array_merge($result, array_keys($value));
-			}
+			if (!$this->isPrimitive($type)) {
 		}
 		return implode('|', array_unique($result));
statusReason: 1) SuccessResponseDataHelperTest: Array shape return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testArrayShapeReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-''
+'test'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:213

[NoCoverage] InstanceOf_
PhpDocParser.php:431:6
 			if ($this->isPrimitive($type)) {
 				$class = $this->getPrimitiveValue($type);
 				if ($type instanceof ConstTypeNode) {
-					if ($type->constExpr instanceof ConstFetchNode && $type->constExpr->name === '*') {
+					if (false && $type->constExpr->name === '*') {
 						$this->getAllConstValuesOrNames($class, 'name');
 					} else {

[NoCoverage] InstanceOf_
PhpDocParser.php:431:6
 			if ($this->isPrimitive($type)) {
 				$class = $this->getPrimitiveValue($type);
 				if ($type instanceof ConstTypeNode) {
-					if ($type->constExpr instanceof ConstFetchNode && $type->constExpr->name === '*') {
+					if (true && $type->constExpr->name === '*') {
 						$this->getAllConstValuesOrNames($class, 'name');
 					} else {

[NoCoverage] MethodCallRemoval
PhpDocParser.php:432:7
 				$class = $this->getPrimitiveValue($type);
 				if ($type instanceof ConstTypeNode) {
 					if ($type->constExpr instanceof ConstFetchNode && $type->constExpr->name === '*') {
-						$this->getAllConstValuesOrNames($class, 'name');
+						
 					} else {
 						$result[] = $type->constExpr->name;

[NoCoverage] UnwrapArrayColumn
PhpDocParser.php:441:6
 						throw new Exception("Примитивные типы должны быть либо константами класса, либо enum'ами");
 					}
 					/** @var BackedEnum $class */
-					$result = array_merge($result, array_column($class::cases(), 'name'));
+					$result = array_merge($result, $class::cases());
 				}
 			} elseif ($type instanceof GenericTypeNode && $type->type->name === 'list') {

[NoCoverage] UnwrapArrayMerge
PhpDocParser.php:441:6
 						throw new Exception("Примитивные типы должны быть либо константами класса, либо enum'ами");
 					}
 					/** @var BackedEnum $class */
-					$result = array_merge($result, array_column($class::cases(), 'name'));
+					$result = array_column($class::cases(), 'name');
 				}
 			} elseif ($type instanceof GenericTypeNode && $type->type->name === 'list') {

[Killed] LogicalAndNegation
PhpDocParser.php:443:4
 					/** @var BackedEnum $class */
 					$result = array_merge($result, array_column($class::cases(), 'name'));
 				}
-			} elseif ($type instanceof GenericTypeNode && $type->type->name === 'list') {
+			} elseif (!($type instanceof GenericTypeNode && $type->type->name === 'list')) {
 				$result = array_merge($result, ['int']);
 			} elseif (is_array($value = $this->convertNestedToArray($type))) {
statusReason: 1) SuccessResponseDataHelperTest: Array shape return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testArrayShapeReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'integer'
+'string'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:212

[Killed] LogicalAndAllSubExprNegation
PhpDocParser.php:443:4
 					/** @var BackedEnum $class */
 					$result = array_merge($result, array_column($class::cases(), 'name'));
 				}
-			} elseif ($type instanceof GenericTypeNode && $type->type->name === 'list') {
+			} elseif (!$type instanceof GenericTypeNode && !($type->type->name === 'list')) {
 				$result = array_merge($result, ['int']);
 			} elseif (is_array($value = $this->convertNestedToArray($type))) {
statusReason: 1) SuccessResponseDataHelperTest: Array shape return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testArrayShapeReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'integer'
+'string'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:212

[NoCoverage] UnwrapArrayMerge
PhpDocParser.php:444:5
 					$result = array_merge($result, array_column($class::cases(), 'name'));
 				}
 			} elseif ($type instanceof GenericTypeNode && $type->type->name === 'list') {
-				$result = array_merge($result, ['int']);
+				$result = $result;
 			} elseif (is_array($value = $this->convertNestedToArray($type))) {
 				$result = array_merge($result, array_keys($value));

[Killed] ElseIfNegation
PhpDocParser.php:445:4
 				}
 			} elseif ($type instanceof GenericTypeNode && $type->type->name === 'list') {
 				$result = array_merge($result, ['int']);
-			} elseif (is_array($value = $this->convertNestedToArray($type))) {
-				$result = array_merge($result, array_keys($value));
-			}
+			} elseif (!is_array($value = $this->convertNestedToArray($type))) {
 		}
 		return implode('|', array_unique($result));
statusReason: 1) SuccessResponseDataHelperTest: Array shape return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testArrayShapeReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-''
+'test'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:213

[Killed] UnwrapArrayMerge
PhpDocParser.php:446:5
 			} elseif ($type instanceof GenericTypeNode && $type->type->name === 'list') {
 				$result = array_merge($result, ['int']);
 			} elseif (is_array($value = $this->convertNestedToArray($type))) {
-				$result = array_merge($result, array_keys($value));
+				$result = $result;
 			}
 		}
statusReason: 1) SuccessResponseDataHelperTest: Array shape return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testArrayShapeReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-''
+'test'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:213

[Killed] LogicalOrAllSubExprNegation
PhpDocParser.php:454:3
 
 	private function getArray(GenericTypeNode $node): array
 	{
-		if (count($node->genericTypes) > 2 || count($node->genericTypes) === 0) {
+		if (!(count($node->genericTypes) > 2) || !(count($node->genericTypes) === 0)) {
 			throw new Exception("В массиве можно указать только ключ и значение!");
 		}
statusReason: 1) SuccessResponseDataHelperTest: Object return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testObjectReturn
Failed asserting that '#/components/schemas/RBAC_Permissions' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:108
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 11, Assertions: 21, Fai

[Killed] LogicalOrNegation
PhpDocParser.php:454:3
 
 	private function getArray(GenericTypeNode $node): array
 	{
-		if (count($node->genericTypes) > 2 || count($node->genericTypes) === 0) {
+		if (!(count($node->genericTypes) > 2 || count($node->genericTypes) === 0)) {
 			throw new Exception("В массиве можно указать только ключ и значение!");
 		}
statusReason: 1) SuccessResponseDataHelperTest: Indexed array return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testIndexedArrayReturn
Failed asserting that '#/components/schemas/entities_TestObject' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:130
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 2, Asse

[NoCoverage] Throw_
PhpDocParser.php:455:4
 	private function getArray(GenericTypeNode $node): array
 	{
 		if (count($node->genericTypes) > 2 || count($node->genericTypes) === 0) {
-			throw new Exception("В массиве можно указать только ключ и значение!");
+			new Exception("В массиве можно указать только ключ и значение!");
 		}
 

[Killed] IncrementInteger
PhpDocParser.php:459:3
 		}
 
 		$keyNode = null;
-		if (count($node->genericTypes) === 1) {
+		if (count($node->genericTypes) === 2) {
 			$itemNode = $node->genericTypes[0];
 		} else {
statusReason: 1) SuccessResponseDataHelperTest: Associative array return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testAssociativeArrayReturn
Failed asserting that '#/components/schemas/entities_TestObject' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:118
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests:

[Killed] Identical
PhpDocParser.php:459:3
 		}
 
 		$keyNode = null;
-		if (count($node->genericTypes) === 1) {
+		if (count($node->genericTypes) !== 1) {
 			$itemNode = $node->genericTypes[0];
 		} else {
statusReason: 1) SuccessResponseDataHelperTest: Indexed array return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testIndexedArrayReturn
Failed asserting that '#/components/schemas/entities_TestObject' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:130
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 3, Asse

[NoCoverage] IncrementInteger
PhpDocParser.php:460:4
 
 		$keyNode = null;
 		if (count($node->genericTypes) === 1) {
-			$itemNode = $node->genericTypes[0];
+			$itemNode = $node->genericTypes[1];
 		} else {
 			$keyNode = $node->genericTypes[0];
