[Killed] IncrementInteger
PhpDocParser.php:462:4
 		if (count($node->genericTypes) === 1) {
 			$itemNode = $node->genericTypes[0];
 		} else {
-			$keyNode = $node->genericTypes[0];
+			$keyNode = $node->genericTypes[1];
 			$itemNode = $node->genericTypes[1];
 		}
statusReason: 1) SuccessResponseDataHelperTest: Indexed array return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testIndexedArrayReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'object'
+'array'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:129

[Killed] IncrementInteger
PhpDocParser.php:463:4
 			$itemNode = $node->genericTypes[0];
 		} else {
 			$keyNode = $node->genericTypes[0];
-			$itemNode = $node->genericTypes[1];
+			$itemNode = $node->genericTypes[2];
 		}
 
statusReason: 1) SuccessResponseDataHelperTest: Keys is constants return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testKeysIsConstantsReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'array'
+'object'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:254

[Killed] DecrementInteger
PhpDocParser.php:463:4
 			$itemNode = $node->genericTypes[0];
 		} else {
 			$keyNode = $node->genericTypes[0];
-			$itemNode = $node->genericTypes[1];
+			$itemNode = $node->genericTypes[0];
 		}
 
statusReason: 1) SuccessResponseDataHelperTest: Indexed array return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testIndexedArrayReturn
Failed asserting that '#/components/schemas/entities_TestObject' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:130
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 2, Asse

[Killed] NotIdentical
PhpDocParser.php:466:3
 			$itemNode = $node->genericTypes[1];
 		}
 
-		if ($keyNode !== null) {
+		if ($keyNode === null) {
 			if ($this->isPrimitive($keyNode)) {
 				$key = $this->getPrimitiveValue($keyNode);
statusReason: 1) SuccessResponseDataHelperTest: Associative array return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testAssociativeArrayReturn
Failed asserting that '#/components/schemas/entities_TestObject' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:118
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests:

[Killed] IfNegation
PhpDocParser.php:467:4
 		}
 
 		if ($keyNode !== null) {
-			if ($this->isPrimitive($keyNode)) {
-				$key = $this->getPrimitiveValue($keyNode);
-			} elseif ($keyNode instanceof GenericTypeNode) {
-				$converted = $this->convertGenericTypeToKey($keyNode);
-				if ($converted !== null) {
-					$key = $converted;
-				}
-			} elseif ($keyNode instanceof UnionTypeNode) {
-				$converted = $this->convertUnionTypeToKey($keyNode);
-				if ($converted !== null) {
-					$key = $converted;
-				}
-			}
+			if (!$this->isPrimitive($keyNode)) {
 		}
 
statusReason: 1) SuccessResponseDataHelperTest: Keys is constants return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testKeysIsConstantsReturn
Failed asserting that two arrays are equal.
- Expected | + Actual
@@ @@
Array (
-    0 => 'oAccessBookmakerCabinet'
-    1 => 'oAccessPartnerCabinet'

[Killed] InstanceOf_
PhpDocParser.php:469:4
 		if ($keyNode !== null) {
 			if ($this->isPrimitive($keyNode)) {
 				$key = $this->getPrimitiveValue($keyNode);
-			} elseif ($keyNode instanceof GenericTypeNode) {
+			} elseif (false) {
 				$converted = $this->convertGenericTypeToKey($keyNode);
 				if ($converted !== null) {
statusReason: 1) SuccessResponseDataHelperTest: Keys is constants return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testKeysIsConstantsReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'array'
+'object'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:254

[Survived] InstanceOf_
PhpDocParser.php:469:4
 		if ($keyNode !== null) {
 			if ($this->isPrimitive($keyNode)) {
 				$key = $this->getPrimitiveValue($keyNode);
-			} elseif ($keyNode instanceof GenericTypeNode) {
+			} elseif (true) {
 				$converted = $this->convertGenericTypeToKey($keyNode);
 				if ($converted !== null) {

[Killed] NotIdentical
PhpDocParser.php:471:5
 				$key = $this->getPrimitiveValue($keyNode);
 			} elseif ($keyNode instanceof GenericTypeNode) {
 				$converted = $this->convertGenericTypeToKey($keyNode);
-				if ($converted !== null) {
+				if ($converted === null) {
 					$key = $converted;
 				}
statusReason: 1) SuccessResponseDataHelperTest: Keys is constants return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testKeysIsConstantsReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'array'
+'object'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:254

[NoCoverage] InstanceOf_
PhpDocParser.php:474:4
 				if ($converted !== null) {
 					$key = $converted;
 				}
-			} elseif ($keyNode instanceof UnionTypeNode) {
+			} elseif (true) {
 				$converted = $this->convertUnionTypeToKey($keyNode);
 				if ($converted !== null) {

[NoCoverage] InstanceOf_
PhpDocParser.php:474:4
 				if ($converted !== null) {
 					$key = $converted;
 				}
-			} elseif ($keyNode instanceof UnionTypeNode) {
+			} elseif (false) {
 				$converted = $this->convertUnionTypeToKey($keyNode);
 				if ($converted !== null) {

[NoCoverage] NotIdentical
PhpDocParser.php:476:5
 				}
 			} elseif ($keyNode instanceof UnionTypeNode) {
 				$converted = $this->convertUnionTypeToKey($keyNode);
-				if ($converted !== null) {
+				if ($converted === null) {
 					$key = $converted;
 				}

[Killed] Ternary
PhpDocParser.php:482:3
 			}
 		}
 
-		$value = $this->isPrimitive($itemNode)
-			? $this->getPrimitiveValueOrProperties($itemNode)
-			: $this->convertNestedToArray($itemNode);
+		$value = $this->isPrimitive($itemNode) ? $this->convertNestedToArray($itemNode) : $this->getPrimitiveValueOrProperties($itemNode);de);
 
 		return !empty($key) ? [$key => $value] : [$value];
statusReason: 1) SuccessResponseDataHelperTest: Associative array return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testAssociativeArrayReturn
Failed asserting that '#/components/schemas/entities_TestObject' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:118
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests:

[Killed] LogicalNot
PhpDocParser.php:486:3
 			? $this->getPrimitiveValueOrProperties($itemNode)
 			: $this->convertNestedToArray($itemNode);
 
-		return !empty($key) ? [$key => $value] : [$value];
+		return empty($key) ? [$key => $value] : [$value];
 	}
 
statusReason: 1) SuccessResponseDataHelperTest: Keys is constants return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testKeysIsConstantsReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'array'
+'object'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:254

[Killed] Ternary
PhpDocParser.php:486:3
 			? $this->getPrimitiveValueOrProperties($itemNode)
 			: $this->convertNestedToArray($itemNode);
 
-		return !empty($key) ? [$key => $value] : [$value];
+		return !empty($key) ? [$value] : [$key => $value];
 	}
 
statusReason: 1) SuccessResponseDataHelperTest: Keys is constants return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testKeysIsConstantsReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'array'
+'object'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:254

[NoCoverage] IncrementInteger
PhpDocParser.php:491:3
 
 	private function getClassString(GenericTypeNode $node): string
 	{
-		$class = $this->getPrimitiveValue($node->genericTypes[0]);
+		$class = $this->getPrimitiveValue($node->genericTypes[1]);
 		if (!$this->isEntityExists($class)) {
 			throw new Exception('Сущность ' . $node->genericTypes[0]->name . ' не найдена!');

[NoCoverage] LogicalNot
PhpDocParser.php:492:3
 	private function getClassString(GenericTypeNode $node): string
 	{
 		$class = $this->getPrimitiveValue($node->genericTypes[0]);
-		if (!$this->isEntityExists($class)) {
+		if ($this->isEntityExists($class)) {
 			throw new Exception('Сущность ' . $node->genericTypes[0]->name . ' не найдена!');
 		}

[NoCoverage] Concat
PhpDocParser.php:493:4
 	{
 		$class = $this->getPrimitiveValue($node->genericTypes[0]);
 		if (!$this->isEntityExists($class)) {
-			throw new Exception('Сущность ' . $node->genericTypes[0]->name . ' не найдена!');
+			throw new Exception('Сущность ' . ' не найдена!' . $node->genericTypes[0]->name);
 		}
 		return 'class-string<' . $class . '>';

[NoCoverage] IncrementInteger
PhpDocParser.php:493:4
 	{
 		$class = $this->getPrimitiveValue($node->genericTypes[0]);
 		if (!$this->isEntityExists($class)) {
-			throw new Exception('Сущность ' . $node->genericTypes[0]->name . ' не найдена!');
+			throw new Exception('Сущность ' . $node->genericTypes[1]->name . ' не найдена!');
 		}
 		return 'class-string<' . $class . '>';

[NoCoverage] ConcatOperandRemoval
PhpDocParser.php:495:3
 		if (!$this->isEntityExists($class)) {
 			throw new Exception('Сущность ' . $node->genericTypes[0]->name . ' не найдена!');
 		}
-		return 'class-string<' . $class . '>';
+		return 'class-string<' . $class;
 	}
 

[NoCoverage] Concat
PhpDocParser.php:495:3
 		if (!$this->isEntityExists($class)) {
 			throw new Exception('Сущность ' . $node->genericTypes[0]->name . ' не найдена!');
 		}
-		return 'class-string<' . $class . '>';
+		return $class . 'class-string<' . '>';
 	}
 

[NoCoverage] DecrementInteger
PhpDocParser.php:501:3
 	private function getInt(GenericTypeNode $node): string
 	{
 		$result = [];
-		if (count($node->genericTypes) !== 2) {
+		if (count($node->genericTypes) !== 1) {
 			throw new Exception('Поддерживается работа только с числами или констатами внутри int (int<12,max>) для min и max значений');
 		}

[NoCoverage] NotIdentical
PhpDocParser.php:501:3
 	private function getInt(GenericTypeNode $node): string
 	{
 		$result = [];
-		if (count($node->genericTypes) !== 2) {
+		if (count($node->genericTypes) === 2) {
 			throw new Exception('Поддерживается работа только с числами или констатами внутри int (int<12,max>) для min и max значений');
 		}

[NoCoverage] Throw_
PhpDocParser.php:502:4
 	{
 		$result = [];
 		if (count($node->genericTypes) !== 2) {
-			throw new Exception('Поддерживается работа только с числами или констатами внутри int (int<12,max>) для min и max значений');
+			new Exception('Поддерживается работа только с числами или констатами внутри int (int<12,max>) для min и max значений');
 		}
 		foreach ($node->genericTypes as $type) {

[NoCoverage] Foreach_
PhpDocParser.php:504:3
 		if (count($node->genericTypes) !== 2) {
 			throw new Exception('Поддерживается работа только с числами или констатами внутри int (int<12,max>) для min и max значений');
 		}
-		foreach ($node->genericTypes as $type) {
-			if ($this->isNested($type)) {
-				throw new Exception('Поддерживается работа только с числами или констатами внутри int (int<12,max>)');
-			}
-			$result[] = $this->getPrimitiveValue($type);
-		}
+		foreach (array() as $type) {
 
 		return "int от " . $result[0] . " до " . $result[1];

[NoCoverage] IfNegation
PhpDocParser.php:505:4
 			throw new Exception('Поддерживается работа только с числами или констатами внутри int (int<12,max>) для min и max значений');
 		}
 		foreach ($node->genericTypes as $type) {
-			if ($this->isNested($type)) {
-				throw new Exception('Поддерживается работа только с числами или констатами внутри int (int<12,max>)');
-			}
+			if (!$this->isNested($type)) {
 			$result[] = $this->getPrimitiveValue($type);
 		}

[NoCoverage] Throw_
PhpDocParser.php:506:5
 		}
 		foreach ($node->genericTypes as $type) {
 			if ($this->isNested($type)) {
-				throw new Exception('Поддерживается работа только с числами или констатами внутри int (int<12,max>)');
+				new Exception('Поддерживается работа только с числами или констатами внутри int (int<12,max>)');
 			}
 			$result[] = $this->getPrimitiveValue($type);

[NoCoverage] Concat
PhpDocParser.php:511:3
 			$result[] = $this->getPrimitiveValue($type);
 		}
 
-		return "int от " . $result[0] . " до " . $result[1];
+		return "int от " . $result[0] . $result[1] . " до ";
 	}
 

[NoCoverage] IncrementInteger
PhpDocParser.php:511:3
 			$result[] = $this->getPrimitiveValue($type);
 		}
 
-		return "int от " . $result[0] . " до " . $result[1];
+		return "int от " . $result[1] . " до " . $result[1];
 	}
 

[Killed] Foreach_
PhpDocParser.php:517:3
 	private function convertUnionTypeToArray(UnionTypeNode $node): array|string
 	{
 		$result = [];
-		foreach ($node->types as $type) {
-			if ($this->isPrimitive($type)) {
-				$result[self::OR][] = $this->getPrimitiveValueOrProperties($type);
-			} else {
-				$result[self::OR][] = $this->convertNestedToArray($type);
-			}
-		}
+		foreach (array() as $type) {
 		$notNested = true;
 		foreach ($result[self::OR] as $item) {
statusReason: 1) SuccessResponseDataHelperTest: Nullable return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testNullableReturn
Failed asserting that '#/components/schemas/entities_TestObject' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:222
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 2, Assertions: 2

[Killed] IfNegation
PhpDocParser.php:518:4
 	{
 		$result = [];
 		foreach ($node->types as $type) {
-			if ($this->isPrimitive($type)) {
-				$result[self::OR][] = $this->getPrimitiveValueOrProperties($type);
-			} else {
-				$result[self::OR][] = $this->convertNestedToArray($type);
-			}
+			if (!$this->isPrimitive($type)) {
 		}
 		$notNested = true;
statusReason: 1) SuccessResponseDataHelperTest: Union type return will fail
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testUnionTypeReturnWillFail
Failed asserting that exception with message "Допустим только один тип или набор значений(исключение null)" is thrown
#1  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 13, Assertions: 33, Failures: 1.

[Killed] TrueValue
PhpDocParser.php:524:3
 				$result[self::OR][] = $this->convertNestedToArray($type);
 			}
 		}
-		$notNested = true;
+		$notNested = false;
 		foreach ($result[self::OR] as $item) {
 			if (is_array($item)) {
statusReason: 1) SuccessResponseDataHelperTest: Nullable return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testNullableReturn
Failed asserting that '#/components/schemas/entities_TestObject' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:222
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 2, Assertions: 3

[Survived] Foreach_
PhpDocParser.php:525:3
 			}
 		}
 		$notNested = true;
-		foreach ($result[self::OR] as $item) {
-			if (is_array($item)) {
-				$notNested = false;
-			}
-		}
+		foreach (array() as $item) {
 		return $notNested ? implode('|', array_unique($result[self::OR])) : $result;
 	}

[Killed] IfNegation
PhpDocParser.php:526:4
 		}
 		$notNested = true;
 		foreach ($result[self::OR] as $item) {
-			if (is_array($item)) {
-				$notNested = false;
-			}
+			if (!is_array($item)) {
 		}
 		return $notNested ? implode('|', array_unique($result[self::OR])) : $result;
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
                                                                                    
  [TypeError] explode(): Argument #2 ($string) must be of type string, array given  
                                                                                    
#1  /var/w

[NoCoverage] FalseValue
PhpDocParser.php:527:5
 		$notNested = true;
 		foreach ($result[self::OR] as $item) {
 			if (is_array($item)) {
-				$notNested = false;
+				$notNested = true;
 			}
 		}

[Killed] Ternary
PhpDocParser.php:530:3
 				$notNested = false;
 			}
 		}
-		return $notNested ? implode('|', array_unique($result[self::OR])) : $result;
+		return $notNested ? $result : implode('|', array_unique($result[self::OR]));
 	}
 
statusReason: 1) SuccessResponseDataHelperTest: Nullable return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testNullableReturn
Failed asserting that '#/components/schemas/entities_TestObject' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:222
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 4, Assertions: 1

[Survived] UnwrapArrayUnique
PhpDocParser.php:530:3
 				$notNested = false;
 			}
 		}
-		return $notNested ? implode('|', array_unique($result[self::OR])) : $result;
+		return $notNested ? implode('|', $result[self::OR]) : $result;
 	}
 

[NoCoverage] Ternary
PhpDocParser.php:536:3
 	private function convertUnionTypeToKey(UnionTypeNode $keyNode): ?string
 	{
 		$converted = $this->convertUnionTypeToArray($keyNode);
-		return is_string($converted) ? $converted : null;
+		return is_string($converted) ? null : $converted;
 	}
 

[NoCoverage] InstanceOf_
PhpDocParser.php:541:3
 
 	private function convertThrowsTypeToClassNames(ThrowsTagValueNode $node): array
 	{
-		if ($node->type instanceof IdentifierTypeNode) {
+		if (false) {
 			return $this->getPrimitiveValueOrProperties($node->type);
 		} elseif ($node->type instanceof UnionTypeNode) {

[NoCoverage] InstanceOf_
PhpDocParser.php:541:3
 
 	private function convertThrowsTypeToClassNames(ThrowsTagValueNode $node): array
 	{
-		if ($node->type instanceof IdentifierTypeNode) {
+		if (true) {
 			return $this->getPrimitiveValueOrProperties($node->type);
 		} elseif ($node->type instanceof UnionTypeNode) {

[NoCoverage] InstanceOf_
PhpDocParser.php:543:3
 	{
 		if ($node->type instanceof IdentifierTypeNode) {
 			return $this->getPrimitiveValueOrProperties($node->type);
-		} elseif ($node->type instanceof UnionTypeNode) {
+		} elseif (true) {
 			return $this->convert($node);
 		}

[NoCoverage] InstanceOf_
PhpDocParser.php:543:3
 	{
 		if ($node->type instanceof IdentifierTypeNode) {
 			return $this->getPrimitiveValueOrProperties($node->type);
-		} elseif ($node->type instanceof UnionTypeNode) {
+		} elseif (false) {
 			return $this->convert($node);
 		}

[NoCoverage] Throw_
PhpDocParser.php:546:3
 		} elseif ($node->type instanceof UnionTypeNode) {
 			return $this->convert($node);
 		}
-		throw new Exception("Недопустимый тип!");
+		new Exception("Недопустимый тип!");
 	}
 }
