[Killed] PublicVisibility
ReferenceCollection.php:15:2
 	/** @var array<string, Schema>  */
 	private array $collection = [];
 
-	public function add(string $className, Schema $properties): void
+	protected function add(string $className, Schema $properties) : void
 	{
 		$this->collection[$className] = $properties;
statusReason: 1) ExceptionsResponsesHelperTest: Throwed exceptions
 Test  tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:testThrowedExceptions
Failed asserting that actual size 0 matches expected size 6.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/ExceptionsResponsesHelperTest.php:27
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 3, Assertions: 7, Failures: 1.

[NoCoverage] Throw_
ReferenceCollection.php:32:3
 
 	public function offsetSet(mixed $offset, mixed $value): void
 	{
-		throw new Exception('Forbidden');
+		new Exception('Forbidden');
 	}
 
