[Killed] MethodCallRemoval
RequestDataHelper.php:39:3
 
 	public function __construct(private TypeResolver $resolver)
 	{
-		$this->setMessageTranslator(__DIR__ . '/../../vendor/yiisoft/validator/messages');
+		
 	}
 
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                                            
  [Error] Typed property OpenApi\RequestDataHelper::$translator must not be accessed before initialization

[Survived] Concat
RequestDataHelper.php:39:3
 
 	public function __construct(private TypeResolver $resolver)
 	{
-		$this->setMessageTranslator(__DIR__ . '/../../vendor/yiisoft/validator/messages');
+		$this->setMessageTranslator('/../../vendor/yiisoft/validator/messages' . __DIR__);
 	}
 

[Survived] MethodCallRemoval
RequestDataHelper.php:51:3
 		);
 
 		$translator = new Translator(locale: 'ru');
-		$translator->addCategorySources($categorySource);
+		
 		$this->translator = $translator;
 	}

[Killed] PublicVisibility
RequestDataHelper.php:55:2
 		$this->translator = $translator;
 	}
 
-	public function getRequestData(string $methodNamespace): RequestBody
+	protected function getRequestData(string $methodNamespace) : RequestBody
 	{
 		return new RequestBody(['content' => ['application/json' => $this->getMediaType($methodNamespace)]]);
statusReason: 1) RequestDataHelperTest: Empty dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testEmptyDto
                                                                                                                              
  [Error] Call to protected method OpenApi\RequestDataHelper::getRequestData() from scope Unit\OpenApi\RequestDataHelperTest

[Killed] ArrayItemRemoval
RequestDataHelper.php:57:3
 
 	public function getRequestData(string $methodNamespace): RequestBody
 	{
-		return new RequestBody(['content' => ['application/json' => $this->getMediaType($methodNamespace)]]);
+		return new RequestBody(['content' => []]);
 	}
 
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
Failed asserting that 'string' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTest.php:37
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] MethodCallRemoval
RequestDataHelper.php:66:3
 		$dtoNamespace = $reflection->getMethod('getMethodDTO')->getReturnType()->getName();
 		$dtoReflection = new \ReflectionClass($dtoNamespace);
 		$dtoReflectionProperties = $dtoReflection->getProperties();
-		$this->setDtoAttributes($dtoReflectionProperties);
+		
 		$rules = $this->getDtoValidations($dtoReflection);
 		$this->checkPropertyRulesMapping($dtoReflectionProperties, $rules);
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
Failed asserting that 'string' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTest.php:37
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 2, Assertions: 1, Failures: 1.

[Survived] MethodCallRemoval
RequestDataHelper.php:68:3
 		$dtoReflectionProperties = $dtoReflection->getProperties();
 		$this->setDtoAttributes($dtoReflectionProperties);
 		$rules = $this->getDtoValidations($dtoReflection);
-		$this->checkPropertyRulesMapping($dtoReflectionProperties, $rules);
+		
 		$this->setPermissions($this->getPermissions($reflection));
 		$this->setPreparedValidationMessagesForAttributes($rules);

[Survived] MethodCallRemoval
RequestDataHelper.php:69:3
 		$this->setDtoAttributes($dtoReflectionProperties);
 		$rules = $this->getDtoValidations($dtoReflection);
 		$this->checkPropertyRulesMapping($dtoReflectionProperties, $rules);
-		$this->setPermissions($this->getPermissions($reflection));
+		
 		$this->setPreparedValidationMessagesForAttributes($rules);
 		$result = $this->getRequest($dtoNamespace);

[Killed] MethodCallRemoval
RequestDataHelper.php:70:3
 		$rules = $this->getDtoValidations($dtoReflection);
 		$this->checkPropertyRulesMapping($dtoReflectionProperties, $rules);
 		$this->setPermissions($this->getPermissions($reflection));
-		$this->setPreparedValidationMessagesForAttributes($rules);
+		
 		$result = $this->getRequest($dtoNamespace);
 		return new MediaType(['schema' => $result]);
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                                                                       
  [Exception] В массиве свойства enumCollection необходимо указать тип элементов! DTO: Unit\OpenApi\RequestsExamples\dtos\AllRulesDto

[Survived] Foreach_
RequestDataHelper.php:82:3
 	private function setPermissions(array $permissions): void
 	{
 		$collectedPermissions = [];
-		foreach ($permissions as $permission) {
-			$collectedPermissions[] = $permission->value;
-		}
+		foreach (array() as $permission) {
 		$this->permissions = $collectedPermissions;
 	}

[Killed] InstanceOf_
RequestDataHelper.php:94:4
 		$properties = [];
 		$required = [];
 		foreach ($this->dtoPropertiesArray as $propertyName => $propertyData) {
-			if ($propertyData->getType() instanceof Schema) {
+			if (false) {
 				$shemaType = $propertyData->getType();
 				$shemaType->nullable = $propertyData->isNullable();
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
'string' does not match expected type "object".
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTest.php:37
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 2, Assertions: 1, Failures: 1.

[Killed] InstanceOf_
RequestDataHelper.php:94:4
 		$properties = [];
 		$required = [];
 		foreach ($this->dtoPropertiesArray as $propertyName => $propertyData) {
-			if ($propertyData->getType() instanceof Schema) {
+			if (true) {
 				$shemaType = $propertyData->getType();
 				$shemaType->nullable = $propertyData->isNullable();
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                           
  [Error] Attempt to assign property "nullable" on string  
                                                           
#1  /var/www/kernel-api-framework/OpenApi/RequestDataHelper.php:82
#2  /var/www/kernel-api-framework/OpenApi/Req

[Killed] ArrayItemRemoval
RequestDataHelper.php:98:5
 				$shemaType = $propertyData->getType();
 				$shemaType->nullable = $propertyData->isNullable();
 			} else {
-				$shemaType = new Schema([
-					'type' => $propertyData->getType(),
-					'nullable' => $propertyData->isNullable()
-				]);
+				$shemaType = new Schema(['nullable' => $propertyData->isNullable()]);
 			}
 			$properties[$propertyName] = $shemaType;
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
Failed asserting that 'string' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTest.php:49
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] ArrayItem
RequestDataHelper.php:99:6
 				$shemaType->nullable = $propertyData->isNullable();
 			} else {
 				$shemaType = new Schema([
-					'type' => $propertyData->getType(),
+					$shemaType = new Schema(['type' > $propertyData->getType(), 'nullable' => $propertyData->isNullable()]);
 					'nullable' => $propertyData->isNullable()
 				]);
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
Failed asserting that 'string' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTest.php:49
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 2, Assertions: 1, Failures: 1.

[Killed] ArrayItem
RequestDataHelper.php:100:6
 			} else {
 				$shemaType = new Schema([
 					'type' => $propertyData->getType(),
-					'nullable' => $propertyData->isNullable()
+					$shemaType = new Schema(['type' => $propertyData->getType(), 'nullable' > $propertyData->isNullable()]);
 				]);
 			}
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
Failed asserting that null is false.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTest.php:50
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] LogicalNot
RequestDataHelper.php:104:4
 				]);
 			}
 			$properties[$propertyName] = $shemaType;
-			if (!empty($propertyData->getMessages())) {
+			if (empty($propertyData->getMessages())) {
 				$properties[$propertyName]->description = implode(PHP_EOL, $propertyData->getMessages());
 			}
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
Failed asserting that 'Буквы - русский/латиница, возможность использовать дефис, запрет на использование скриптов и спец. символов, от 2-50 символа. Первый символ начинается с буквы. Запрещено использование двух "-" или "_" подряд ' matches expected null.
#1  /var/www/kernel-api-framework/te

[Killed] IfNegation
RequestDataHelper.php:107:4
 			if (!empty($propertyData->getMessages())) {
 				$properties[$propertyName]->description = implode(PHP_EOL, $propertyData->getMessages());
 			}
-			if ($propertyData->isRequired()) {
-				$required[] = $propertyName;
-			}
+			if (!$propertyData->isRequired()) {
 			if ($properties[$propertyName]->type === Type::ARRAY) {
 				if (empty($propertyData->getArrayType()) && empty($propertyData->getEnumItems())) {
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
Failed asserting that false is true.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTest.php:41
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] Identical
RequestDataHelper.php:110:4
 			if ($propertyData->isRequired()) {
 				$required[] = $propertyName;
 			}
-			if ($properties[$propertyName]->type === Type::ARRAY) {
+			if ($properties[$propertyName]->type !== Type::ARRAY) {
 				if (empty($propertyData->getArrayType()) && empty($propertyData->getEnumItems())) {
 					throw new \Exception("В массиве свойства " . $propertyName . " необходимо указать тип элементов! DTO: " . $dtoNamespace);
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                                                              
  [Exception] В массиве свойства regex необходимо указать тип элементов! DTO: Unit\OpenApi\RequestsExamples\dtos\AllRulesDto

[Killed] LogicalAndAllSubExprNegation
RequestDataHelper.php:111:5
 				$required[] = $propertyName;
 			}
 			if ($properties[$propertyName]->type === Type::ARRAY) {
-				if (empty($propertyData->getArrayType()) && empty($propertyData->getEnumItems())) {
+				if (!empty($propertyData->getArrayType()) && !empty($propertyData->getEnumItems())) {
 					throw new \Exception("В массиве свойства " . $propertyName . " необходимо указать тип элементов! DTO: " . $dtoNamespace);
 				}
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                                                                       
  [Exception] В массиве свойства enumCollection необходимо указать тип элементов! DTO: Unit\OpenApi\RequestsExamples\dtos\AllRulesDto

[Killed] LogicalAnd
RequestDataHelper.php:111:5
 				$required[] = $propertyName;
 			}
 			if ($properties[$propertyName]->type === Type::ARRAY) {
-				if (empty($propertyData->getArrayType()) && empty($propertyData->getEnumItems())) {
+				if (empty($propertyData->getArrayType()) || empty($propertyData->getEnumItems())) {
 					throw new \Exception("В массиве свойства " . $propertyName . " необходимо указать тип элементов! DTO: " . $dtoNamespace);
 				}
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                                                                     
  [Exception] В массиве свойства indexedArray необходимо указать тип элементов! DTO: Unit\OpenApi\RequestsExamples\dtos\AllRulesDto

[NoCoverage] Concat
RequestDataHelper.php:112:6
 			}
 			if ($properties[$propertyName]->type === Type::ARRAY) {
 				if (empty($propertyData->getArrayType()) && empty($propertyData->getEnumItems())) {
-					throw new \Exception("В массиве свойства " . $propertyName . " необходимо указать тип элементов! DTO: " . $dtoNamespace);
+					throw new \Exception($propertyName . "В массиве свойства " . " необходимо указать тип элементов! DTO: " . $dtoNamespace);
 				}
 				$arrayScheme = new Schema([]);

[NoCoverage] Concat
RequestDataHelper.php:112:6
 			}
 			if ($properties[$propertyName]->type === Type::ARRAY) {
 				if (empty($propertyData->getArrayType()) && empty($propertyData->getEnumItems())) {
-					throw new \Exception("В массиве свойства " . $propertyName . " необходимо указать тип элементов! DTO: " . $dtoNamespace);
+					throw new \Exception("В массиве свойства " . " необходимо указать тип элементов! DTO: " . $propertyName . $dtoNamespace);
 				}
 				$arrayScheme = new Schema([]);

[Killed] LogicalNot
RequestDataHelper.php:115:5
 					throw new \Exception("В массиве свойства " . $propertyName . " необходимо указать тип элементов! DTO: " . $dtoNamespace);
 				}
 				$arrayScheme = new Schema([]);
-				if (!empty($propertyData->getArrayType())) {
+				if (empty($propertyData->getArrayType())) {
 					$arrayScheme->type = $propertyData->getArrayType();
 				}
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
Failed asserting that 'string' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTest.php:84
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 2, Assertions: 1, Failures: 1.

[Killed] LogicalNot
RequestDataHelper.php:118:5
 				if (!empty($propertyData->getArrayType())) {
 					$arrayScheme->type = $propertyData->getArrayType();
 				}
-				if (!empty($propertyData->getEnumItems())) {
+				if (empty($propertyData->getEnumItems())) {
 					$arrayScheme->enum = $propertyData->getEnumItems();
 				}
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
[...] does not match expected type "NULL".
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTest.php:60
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 2, Assertions: 1, Failures: 1.

[Killed] LogicalNot
RequestDataHelper.php:122:4
 					$arrayScheme->enum = $propertyData->getEnumItems();
 				}
 				$properties[$propertyName]->items = $arrayScheme;
-			} elseif (!empty($propertyData->getEnumItems())) {
+			} elseif (empty($propertyData->getEnumItems())) {
 				$properties[$propertyName]->enum = $propertyData->getEnumItems();
 			}
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
[...] does not match expected type "NULL".
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTest.php:53
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] LogicalNot
RequestDataHelper.php:127:3
 			}
 		}
 		$schema->properties = $properties;
-		if (!empty($required)) {
+		if (empty($required)) {
 			$schema->required = $required;
 		}
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                     
  [TypeError] in_array(): Argument #2 ($haystack) must be of type array, null given  
                                                                                     
#1  /var/www/kernel-api-framework/

[Survived] LogicalNot
RequestDataHelper.php:130:3
 		if (!empty($required)) {
 			$schema->required = $required;
 		}
-		if (!empty($this->validationMessagesWithoutProperties)) {
+		if (empty($this->validationMessagesWithoutProperties)) {
 			$messages = [];
 			foreach ($this->validationMessagesWithoutProperties as $property) {

[NoCoverage] Foreach_
RequestDataHelper.php:132:4
 		}
 		if (!empty($this->validationMessagesWithoutProperties)) {
 			$messages = [];
-			foreach ($this->validationMessagesWithoutProperties as $property) {
-				$messages[] = implode(PHP_EOL, $property->getMessages());
-			}
+			foreach (array() as $property) {
 			$schema->description = implode(PHP_EOL, $messages);
 		}

[Killed] Foreach_
RequestDataHelper.php:146:3
 	 */
 	private function setDtoAttributes(array $reflectionAttributes): void
 	{
-		foreach ($reflectionAttributes as $reflectionPropertyProperty) {
-			if ($reflectionPropertyProperty->getName() === 'arrayData') {
-				continue;
-			}
-			$dtoProperty = new DtoPropertyData();
-			$type = $reflectionPropertyProperty->getType();
-			if ($type instanceof ReflectionNamedType) {
-				$dtoProperty->setType($this->resolvePropertyType($type->getName()));
-				$dtoProperty->setIsNullable($type->allowsNull());
-			} else {
-				throw new \Exception("Не поддерживается работа с множественными типами(за исключением null)");
-			}
-			$this->dtoPropertiesArray[$reflectionPropertyProperty->getName()] = $dtoProperty;
-		}
+		foreach (array() as $reflectionPropertyProperty) {
 	}
 
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
Failed asserting that 'string' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTest.php:37
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 2, Assertions: 1, Failures: 1.

[Killed] Identical
RequestDataHelper.php:147:4
 	private function setDtoAttributes(array $reflectionAttributes): void
 	{
 		foreach ($reflectionAttributes as $reflectionPropertyProperty) {
-			if ($reflectionPropertyProperty->getName() === 'arrayData') {
+			if ($reflectionPropertyProperty->getName() !== 'arrayData') {
 				continue;
 			}
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
Failed asserting that 'string' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTest.php:37
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Survived] Continue_
RequestDataHelper.php:148:5
 	{
 		foreach ($reflectionAttributes as $reflectionPropertyProperty) {
 			if ($reflectionPropertyProperty->getName() === 'arrayData') {
-				continue;
+				break;
 			}
 			$dtoProperty = new DtoPropertyData();

[Killed] InstanceOf_
RequestDataHelper.php:152:4
 			}
 			$dtoProperty = new DtoPropertyData();
 			$type = $reflectionPropertyProperty->getType();
-			if ($type instanceof ReflectionNamedType) {
+			if (false) {
 				$dtoProperty->setType($this->resolvePropertyType($type->getName()));
 				$dtoProperty->setIsNullable($type->allowsNull());
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                     
  [Exception] Не поддерживается работа с множественными типами(за исключением null)  
                                                                                     
#1  /var/www/kernel-api-framework/

[Survived] InstanceOf_
RequestDataHelper.php:152:4
 			}
 			$dtoProperty = new DtoPropertyData();
 			$type = $reflectionPropertyProperty->getType();
-			if ($type instanceof ReflectionNamedType) {
+			if (true) {
 				$dtoProperty->setType($this->resolvePropertyType($type->getName()));
 				$dtoProperty->setIsNullable($type->allowsNull());

[Killed] MethodCallRemoval
RequestDataHelper.php:153:5
 			$dtoProperty = new DtoPropertyData();
 			$type = $reflectionPropertyProperty->getType();
 			if ($type instanceof ReflectionNamedType) {
-				$dtoProperty->setType($this->resolvePropertyType($type->getName()));
+				
 				$dtoProperty->setIsNullable($type->allowsNull());
 			} else {
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                                    
  [Error] Typed property OpenApi\DtoPropertyData::$type must not be accessed before initialization

[Killed] MethodCallRemoval
RequestDataHelper.php:154:5
 			$type = $reflectionPropertyProperty->getType();
 			if ($type instanceof ReflectionNamedType) {
 				$dtoProperty->setType($this->resolvePropertyType($type->getName()));
-				$dtoProperty->setIsNullable($type->allowsNull());
+				
 			} else {
 				throw new \Exception("Не поддерживается работа с множественными типами(за исключением null)");
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
Failed asserting that false is true.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTest.php:57
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 2, Assertions: 1, Failures: 1.

[NoCoverage] Throw_
RequestDataHelper.php:156:5
 				$dtoProperty->setType($this->resolvePropertyType($type->getName()));
 				$dtoProperty->setIsNullable($type->allowsNull());
 			} else {
-				throw new \Exception("Не поддерживается работа с множественными типами(за исключением null)");
+				new \Exception("Не поддерживается работа с множественными типами(за исключением null)");
 			}
 			$this->dtoPropertiesArray[$reflectionPropertyProperty->getName()] = $dtoProperty;

[Killed] IfNegation
RequestDataHelper.php:164:3
 
 	private function resolvePropertyType(string $typeString): string|Schema
 	{
-		if (enum_exists($typeString)) {
-			/** @var \BackedEnum $typeString */
-			return is_string($typeString::cases()[0]->value) ? 'string' : 'integer';
-		}
+		if (!enum_exists($typeString)) {
 		if (is_subclass_of($typeString, EnumCollection::class) || $typeString === UploadedFileCollection::class) {
 			return 'array';
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                    
  [Error] Class "string" not found  
                                    
#1  /var/www/kernel-api-framework/OpenApi/RequestDataHelper.php:146
#2  /var/www/kernel-api-framework/OpenApi/RequestDataHelper.php:134
#3  /var/www/kernel-api-framework/OpenApi/Req

[Killed] Ternary
RequestDataHelper.php:166:4
 	{
 		if (enum_exists($typeString)) {
 			/** @var \BackedEnum $typeString */
-			return is_string($typeString::cases()[0]->value) ? 'string' : 'integer';
+			return is_string($typeString::cases()[0]->value) ? 'integer' : 'string';
 		}
 		if (is_subclass_of($typeString, EnumCollection::class) || $typeString === UploadedFileCollection::class) {
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'integer'
+'string'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTest.php:49

[Survived] IncrementInteger
RequestDataHelper.php:166:4
 	{
 		if (enum_exists($typeString)) {
 			/** @var \BackedEnum $typeString */
-			return is_string($typeString::cases()[0]->value) ? 'string' : 'integer';
+			return is_string($typeString::cases()[1]->value) ? 'string' : 'integer';
 		}
 		if (is_subclass_of($typeString, EnumCollection::class) || $typeString === UploadedFileCollection::class) {

[Killed] LogicalOrSingleSubExprNegation
RequestDataHelper.php:168:3
 			/** @var \BackedEnum $typeString */
 			return is_string($typeString::cases()[0]->value) ? 'string' : 'integer';
 		}
-		if (is_subclass_of($typeString, EnumCollection::class) || $typeString === UploadedFileCollection::class) {
+		if (!is_subclass_of($typeString, EnumCollection::class) || $typeString === UploadedFileCollection::class) {
 			return 'array';
 		}
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                                                              
  [Exception] В массиве свойства regex необходимо указать тип элементов! DTO: Unit\OpenApi\RequestsExamples\dtos\AllRulesDto

[Killed] LogicalOrNegation
RequestDataHelper.php:168:3
 			/** @var \BackedEnum $typeString */
 			return is_string($typeString::cases()[0]->value) ? 'string' : 'integer';
 		}
-		if (is_subclass_of($typeString, EnumCollection::class) || $typeString === UploadedFileCollection::class) {
+		if (!(is_subclass_of($typeString, EnumCollection::class) || $typeString === UploadedFileCollection::class)) {
 			return 'array';
 		}
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                                                              
  [Exception] В массиве свойства regex необходимо указать тип элементов! DTO: Unit\OpenApi\RequestsExamples\dtos\AllRulesDto

[Killed] Identical
RequestDataHelper.php:171:3
 		if (is_subclass_of($typeString, EnumCollection::class) || $typeString === UploadedFileCollection::class) {
 			return 'array';
 		}
-		if ($typeString === KernelUploadedFileInterface::class) {
+		if ($typeString !== KernelUploadedFileInterface::class) {
 			return 'string';
 		}
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'string'
+'object'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTest.php:63

[Killed] IfNegation
RequestDataHelper.php:174:3
 		if ($typeString === KernelUploadedFileInterface::class) {
 			return 'string';
 		}
-		if (is_subclass_of($typeString, AbstractValueObject::class)) {
-			return $this->convertValueObjectToType($typeString);
-		}
+		if (!is_subclass_of($typeString, AbstractValueObject::class)) {
 		return $this->resolver->resolve($typeString);
 	}
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                       
  [ReflectionException] Class "string" does not exist  
                                                       
#1  /var/www/kernel-api-framework/OpenApi/RequestDataHelper.php:161
#2  /var/www/kernel-api-framework/OpenApi/RequestDataHel

[Killed] IncrementInteger
RequestDataHelper.php:184:3
 	{
 		$reflection = new ReflectionClass($className);
 		$properties = $reflection->getProperties();
-		if (count($properties) === 1) {
+		if (count($properties) === 2) {
 			$reflectionType = $properties[0]->getType();
 			if ($reflectionType instanceof ReflectionNamedType) {
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'object'
+'string'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTest.php:43

[Killed] Identical
RequestDataHelper.php:184:3
 	{
 		$reflection = new ReflectionClass($className);
 		$properties = $reflection->getProperties();
-		if (count($properties) === 1) {
+		if (count($properties) !== 1) {
 			$reflectionType = $properties[0]->getType();
 			if ($reflectionType instanceof ReflectionNamedType) {
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'object'
+'string'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTest.php:43

[Killed] IncrementInteger
RequestDataHelper.php:185:4
 		$reflection = new ReflectionClass($className);
 		$properties = $reflection->getProperties();
 		if (count($properties) === 1) {
-			$reflectionType = $properties[0]->getType();
+			$reflectionType = $properties[1]->getType();
 			if ($reflectionType instanceof ReflectionNamedType) {
 				return $this->resolver->resolve($reflectionType->getName());
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                       
  [Error] Call to a member function getType() on null  
                                                       
#1  /var/www/kernel-api-framework/OpenApi/RequestDataHelper.php:164
#2  /var/www/kernel-api-framework/OpenApi/RequestDataHel
