[Killed] InstanceOf_
RequestDataHelper.php:186:4
 		$properties = $reflection->getProperties();
 		if (count($properties) === 1) {
 			$reflectionType = $properties[0]->getType();
-			if ($reflectionType instanceof ReflectionNamedType) {
+			if (false) {
 				return $this->resolver->resolve($reflectionType->getName());
 			}
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                     
  [Exception] Не поддерживается работа с множественными типами(за исключением null)  
                                                                                     
#1  /var/www/kernel-api-framework/

[Survived] InstanceOf_
RequestDataHelper.php:186:4
 		$properties = $reflection->getProperties();
 		if (count($properties) === 1) {
 			$reflectionType = $properties[0]->getType();
-			if ($reflectionType instanceof ReflectionNamedType) {
+			if (true) {
 				return $this->resolver->resolve($reflectionType->getName());
 			}

[NoCoverage] Throw_
RequestDataHelper.php:189:4
 			if ($reflectionType instanceof ReflectionNamedType) {
 				return $this->resolver->resolve($reflectionType->getName());
 			}
-			throw new \Exception("Не поддерживается работа с множественными типами(за исключением null)");
+			new \Exception("Не поддерживается работа с множественными типами(за исключением null)");
 		}
 		

[Killed] Foreach_
RequestDataHelper.php:193:3
 		}
 		
 		$items = [];
-		foreach ($properties as $property) {
-			$propertyScheme = $this->resolver->resolve($property->getType()->getName());
-			if ($property->getType() instanceof ReflectionNamedType && $property->getType()->allowsNull()) {
-				$propertyScheme->nullable = true;
-			}
-			$items[$property->getName()] = $propertyScheme;
-		}
+		foreach (array() as $property) {
 		return new Schema([
 			'type' => Type::OBJECT,
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
Failed asserting that 'integer' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTest.php:67
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] LogicalAndSingleSubExprNegation
RequestDataHelper.php:195:4
 		$items = [];
 		foreach ($properties as $property) {
 			$propertyScheme = $this->resolver->resolve($property->getType()->getName());
-			if ($property->getType() instanceof ReflectionNamedType && $property->getType()->allowsNull()) {
+			if ($property->getType() instanceof ReflectionNamedType && !$property->getType()->allowsNull()) {
 				$propertyScheme->nullable = true;
 			}
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
Failed asserting that null is true.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTest.php:150
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 2, Assertions: 1, Failures: 1.

[Killed] LogicalAndAllSubExprNegation
RequestDataHelper.php:195:4
 		$items = [];
 		foreach ($properties as $property) {
 			$propertyScheme = $this->resolver->resolve($property->getType()->getName());
-			if ($property->getType() instanceof ReflectionNamedType && $property->getType()->allowsNull()) {
+			if (!$property->getType() instanceof ReflectionNamedType && !$property->getType()->allowsNull()) {
 				$propertyScheme->nullable = true;
 			}
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
Failed asserting that null is true.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTest.php:150
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 2, Assertions: 1, Failures: 1.

[Killed] TrueValue
RequestDataHelper.php:196:5
 		foreach ($properties as $property) {
 			$propertyScheme = $this->resolver->resolve($property->getType()->getName());
 			if ($property->getType() instanceof ReflectionNamedType && $property->getType()->allowsNull()) {
-				$propertyScheme->nullable = true;
+				$propertyScheme->nullable = false;
 			}
 			$items[$property->getName()] = $propertyScheme;
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
Failed asserting that false is true.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTest.php:150
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 2, Assertions: 1, Failures: 1.

[Killed] ArrayItemRemoval
RequestDataHelper.php:200:3
 			}
 			$items[$property->getName()] = $propertyScheme;
 		}
-		return new Schema([
-			'type' => Type::OBJECT,
-			'properties' => $items
-		]);
+		return new Schema(['properties' => $items]);
 	}
 
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
Failed asserting that 'object' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTest.php:63
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] InstanceOf_
RequestDataHelper.php:218:3
 	private function getPermissions(ReflectionClass $method): array
 	{
 		$realMethod = (new ReflectionClass($method->getName()))->newInstanceWithoutConstructor();
-		if ($realMethod instanceof RbacInterface) {
+		if (true) {
 			return $method->getMethod('getPermissions')->invoke($realMethod);
 		}
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                                                         
  [ReflectionException] Method Unit\OpenApi\RequestsExamples\RequestTestAllRulesMethod::getPermissions() does not exist

[Survived] InstanceOf_
RequestDataHelper.php:218:3
 	private function getPermissions(ReflectionClass $method): array
 	{
 		$realMethod = (new ReflectionClass($method->getName()))->newInstanceWithoutConstructor();
-		if ($realMethod instanceof RbacInterface) {
+		if (false) {
 			return $method->getMethod('getPermissions')->invoke($realMethod);
 		}

[Killed] Foreach_
RequestDataHelper.php:226:3
 
 	private function setPreparedValidationMessagesForAttributes(array $dtoValidations): void
 	{
-		foreach ($dtoValidations as $attribute => $validation) {
-			if (isset($this->dtoPropertiesArray[$attribute])) {
-				AbstractRuleResolver::resolve( $this->dtoPropertiesArray[$attribute], $validation, $this->translator);
-			} else {
-				$validationMessagesWithoutProperties[$attribute] = new DtoPropertyData();
-				AbstractRuleResolver::resolve($validationMessagesWithoutProperties[$attribute], $validation,
-					$this->translator);
-			}
-		}
+		foreach (array() as $attribute => $validation) {
 	}
 
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                                                                       
  [Exception] В массиве свойства enumCollection необходимо указать тип элементов! DTO: Unit\OpenApi\RequestsExamples\dtos\AllRulesDto

[Killed] MethodCallRemoval
RequestDataHelper.php:228:5
 	{
 		foreach ($dtoValidations as $attribute => $validation) {
 			if (isset($this->dtoPropertiesArray[$attribute])) {
-				AbstractRuleResolver::resolve( $this->dtoPropertiesArray[$attribute], $validation, $this->translator);
+				
 			} else {
 				$validationMessagesWithoutProperties[$attribute] = new DtoPropertyData();
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                                                                       
  [Exception] В массиве свойства enumCollection необходимо указать тип элементов! DTO: Unit\OpenApi\RequestsExamples\dtos\AllRulesDto

[Survived] MethodCallRemoval
RequestDataHelper.php:231:5
 				AbstractRuleResolver::resolve( $this->dtoPropertiesArray[$attribute], $validation, $this->translator);
 			} else {
 				$validationMessagesWithoutProperties[$attribute] = new DtoPropertyData();
-				AbstractRuleResolver::resolve($validationMessagesWithoutProperties[$attribute], $validation,
-					$this->translator);
+				
 			}
 		}

[Survived] UnwrapArrayDiffKey
RequestDataHelper.php:239:3
 
 	private function checkPropertyRulesMapping(array $dtoReflectionProperties, array $rules): void
 	{
-		$diff = array_diff_key($dtoReflectionProperties, $rules);
+		$diff = $dtoReflectionProperties;
 		foreach ($diff as $key => $item) {
 			if (is_int($key)) {

[Killed] Foreach_
RequestDataHelper.php:240:3
 	private function checkPropertyRulesMapping(array $dtoReflectionProperties, array $rules): void
 	{
 		$diff = array_diff_key($dtoReflectionProperties, $rules);
-		foreach ($diff as $key => $item) {
-			if (is_int($key)) {
-				unset($diff[$key]);
-			}
-		}
+		foreach (array() as $key => $item) {
 		if (!empty($diff)) {
 			throw new \Exception("Количество полей в DTO не соответствует количеству правил");
statusReason: 1) RequestDataHelperTest: Empty dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testEmptyDto
                                                                         
  [Exception] Количество полей в DTO не соответствует количеству правил  
                                                                         
#1  /var/www/kernel-api-framework/OpenApi/RequestDataHelper.php:216
#2  /var/

[Killed] IfNegation
RequestDataHelper.php:241:4
 	{
 		$diff = array_diff_key($dtoReflectionProperties, $rules);
 		foreach ($diff as $key => $item) {
-			if (is_int($key)) {
-				unset($diff[$key]);
-			}
+			if (!is_int($key)) {
 		}
 		if (!empty($diff)) {
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                         
  [Exception] Количество полей в DTO не соответствует количеству правил  
                                                                         
#1  /var/www/kernel-api-framework/OpenApi/RequestDataHelper.php:216
#2

[Killed] LogicalNot
RequestDataHelper.php:245:3
 				unset($diff[$key]);
 			}
 		}
-		if (!empty($diff)) {
+		if (empty($diff)) {
 			throw new \Exception("Количество полей в DTO не соответствует количеству правил");
 		}
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                         
  [Exception] Количество полей в DTO не соответствует количеству правил  
                                                                         
#1  /var/www/kernel-api-framework/OpenApi/RequestDataHelper.php:216
#2

[NoCoverage] Throw_
RequestDataHelper.php:246:4
 			}
 		}
 		if (!empty($diff)) {
-			throw new \Exception("Количество полей в DTO не соответствует количеству правил");
+			new \Exception("Количество полей в DTO не соответствует количеству правил");
 		}
 	}

[NoCoverage] PublicVisibility
RequestDataHelper.php:253:2
 	/**
 	 * @return array
 	 */
-	public function getPermissionsCollection(): array
+	protected function getPermissionsCollection() : array
 	{
 		return $this->permissions;
