[Killed] PublicVisibility
RulesResolver/AbstractRuleResolver.php:24:2
 
 abstract class AbstractRuleResolver
 {
-	public static function resolve(
+	protected static function resolve(DtoPropertyData $propertyData, RuleInterface|array $rule, Translator $translator)
 		DtoPropertyData $propertyData,
 		RuleInterface|array $rule,
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                                                               
  [Error] Call to protected method OpenApi\RulesResolver\AbstractRuleResolver::resolve() from scope OpenApi\RequestDataHelper

[Killed] IfNegation
RulesResolver/AbstractRuleResolver.php:29:3
 		RuleInterface|array $rule,
 		Translator $translator
 	) {
-		if (is_array($rule)) {
-			foreach ($rule as $item) {
-				self::resolveSingle($propertyData, $item, $translator);
-			}
-		} else {
-			self::resolveSingle($propertyData, $rule, $translator);
-		}
+		if (!is_array($rule)) {
 
 		self::setRequired($propertyData, $rule);
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                                                                                                                                                                                               
  [TypeError] OpenApi\RulesResolver\

[Killed] Foreach_
RulesResolver/AbstractRuleResolver.php:30:4
 		Translator $translator
 	) {
 		if (is_array($rule)) {
-			foreach ($rule as $item) {
-				self::resolveSingle($propertyData, $item, $translator);
-			}
+			foreach (array() as $item) {
 		} else {
 			self::resolveSingle($propertyData, $rule, $translator);
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                                                                       
  [Exception] В массиве свойства fileCollection необходимо указать тип элементов! DTO: Unit\OpenApi\RequestsExamples\dtos\AllRulesDto

[Killed] MethodCallRemoval
RulesResolver/AbstractRuleResolver.php:31:5
 	) {
 		if (is_array($rule)) {
 			foreach ($rule as $item) {
-				self::resolveSingle($propertyData, $item, $translator);
+				
 			}
 		} else {
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                                                                       
  [Exception] В массиве свойства fileCollection необходимо указать тип элементов! DTO: Unit\OpenApi\RequestsExamples\dtos\AllRulesDto

[Killed] MethodCallRemoval
RulesResolver/AbstractRuleResolver.php:34:4
 				self::resolveSingle($propertyData, $item, $translator);
 			}
 		} else {
-			self::resolveSingle($propertyData, $rule, $translator);
+			
 		}
 
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                                                                       
  [Exception] В массиве свойства enumCollection необходимо указать тип элементов! DTO: Unit\OpenApi\RequestsExamples\dtos\AllRulesDto

[Killed] MethodCallRemoval
RulesResolver/AbstractRuleResolver.php:37:3
 			self::resolveSingle($propertyData, $rule, $translator);
 		}
 
-		self::setRequired($propertyData, $rule);
+		
 	}
 
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                     
  [TypeError] in_array(): Argument #2 ($haystack) must be of type array, null given  
                                                                                     
#1  /var/www/kernel-api-framework/

[Killed] MethodCallRemoval
RulesResolver/AbstractRuleResolver.php:48:5
 		switch ($rule::class) {
 			case Each::class:
 			case IndexedArray::class:
-				IndexedArrayResolver::resolveRule($propertyData, $rule, $translator);
+				
 				break;
 			case Integer::class:
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                                                                       
  [Exception] В массиве свойства enumCollection необходимо указать тип элементов! DTO: Unit\OpenApi\RequestsExamples\dtos\AllRulesDto

[NoCoverage] MethodCallRemoval
RulesResolver/AbstractRuleResolver.php:51:5
 				IndexedArrayResolver::resolveRule($propertyData, $rule, $translator);
 				break;
 			case Integer::class:
-				IntegerResolver::resolveRule($propertyData, $rule, $translator);
+				
 				break;
 			case In::class:

[Killed] MethodCallRemoval
RulesResolver/AbstractRuleResolver.php:54:5
 				IntegerResolver::resolveRule($propertyData, $rule, $translator);
 				break;
 			case In::class:
-				InResolver::resolveRule($propertyData, $rule, $translator);
+				
 				break;
 			case Required::class:
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTest.php:51
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[NoCoverage] MethodCallRemoval
RulesResolver/AbstractRuleResolver.php:57:5
 				InResolver::resolveRule($propertyData, $rule, $translator);
 				break;
 			case Required::class:
-				RequiredResolver::resolveRule($propertyData, $rule, $translator);
+				
 				break;
 			case AtLeast::class:

[Survived] MethodCallRemoval
RulesResolver/AbstractRuleResolver.php:60:5
 				RequiredResolver::resolveRule($propertyData, $rule, $translator);
 				break;
 			case AtLeast::class:
-				AtLeastResolver::resolveRule($propertyData, $rule, $translator);
+				
 				break;
 			case Number::class:

[NoCoverage] MethodCallRemoval
RulesResolver/AbstractRuleResolver.php:63:5
 				AtLeastResolver::resolveRule($propertyData, $rule, $translator);
 				break;
 			case Number::class:
-				NumberResolver::resolveRule($propertyData, $rule, $translator);
+				
 				break;
 			case Length::class:

[Killed] MethodCallRemoval
RulesResolver/AbstractRuleResolver.php:66:5
 				NumberResolver::resolveRule($propertyData, $rule, $translator);
 				break;
 			case Length::class:
-				LengthResolver::resolveRule($propertyData, $rule, $translator);
+				
 				break;
 			case Count::class:
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
Failed asserting that 'The value must be a string.' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTest.php:73
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 2, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
RulesResolver/AbstractRuleResolver.php:69:5
 				LengthResolver::resolveRule($propertyData, $rule, $translator);
 				break;
 			case Count::class:
-				CountResolver::resolveRule($propertyData, $rule, $translator);
+				
 				break;
 			case Composite::class:
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'Значение должно быть целым числом. Значение должно быть не менее: 1 Значение должно быть не более: '
+'Значение должно быть целым числом. Значение должно быть не менее: 1 Значение должно быть не более: \n
+This value

[Killed] MethodCallRemoval
RulesResolver/AbstractRuleResolver.php:72:5
 				CountResolver::resolveRule($propertyData, $rule, $translator);
 				break;
 			case Composite::class:
-				CompositeResolver::resolveRule($propertyData, $rule, $translator);
+				
 				break;
 			default:
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
Failed asserting that 'Значение должно быть целым числом. Значение должно быть не менее: 1 Значение должно быть не более: 1000\n
Значение должно быть числом. Длина числа должна быть ровно 3 цифр' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTes

[Killed] MethodCallRemoval
RulesResolver/AbstractRuleResolver.php:75:5
 				CompositeResolver::resolveRule($propertyData, $rule, $translator);
 				break;
 			default:
-				DefaultMessageResolver::resolveRule($propertyData, $rule, $translator);
+				
 		}
 	}
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
Failed asserting that 'Буквы - русский/латиница, возможность использовать дефис, запрет на использование скриптов и спец. символов, от 2-50 символа. Первый символ начинается с буквы. Запрещено использование двух "-" или "_" подряд ' matches expected null.
#1  /var/www/kernel-api-framework/te

[Killed] IfNegation
RulesResolver/AbstractRuleResolver.php:83:3
 		DtoPropertyData $propertyData,
 		RuleInterface|array $rule
 	): void {
-		if (is_array($rule)) {
-			$required = false;
-			foreach ($rule as $item) {
-				$required = self::isRequired($item);
-			}
-			$propertyData->setRequired($required);
-		} elseif ($rule instanceof Each || $rule instanceof IndexedArray || $rule instanceof Composite) {
-			$required = false;
-			foreach ($rule->getRules() as $item) {
-				$required = self::isRequired($rule);
-			}
-			$propertyData->setRequired($required);
-		} else {
-			$propertyData->setRequired(self::isRequired($rule));
-		}
+		if (!is_array($rule)) {
 	}
 
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                                                                                                                                                                                            
  [TypeError] OpenApi\RulesResolver\Abs

[Survived] FalseValue
RulesResolver/AbstractRuleResolver.php:84:4
 		RuleInterface|array $rule
 	): void {
 		if (is_array($rule)) {
-			$required = false;
+			$required = true;
 			foreach ($rule as $item) {
 				$required = self::isRequired($item);

[Killed] Foreach_
RulesResolver/AbstractRuleResolver.php:85:4
 	): void {
 		if (is_array($rule)) {
 			$required = false;
-			foreach ($rule as $item) {
-				$required = self::isRequired($item);
-			}
+			foreach (array() as $item) {
 			$propertyData->setRequired($required);
 		} elseif ($rule instanceof Each || $rule instanceof IndexedArray || $rule instanceof Composite) {
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
Failed asserting that false is true.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTest.php:105
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] MethodCallRemoval
RulesResolver/AbstractRuleResolver.php:88:4
 			foreach ($rule as $item) {
 				$required = self::isRequired($item);
 			}
-			$propertyData->setRequired($required);
+			
 		} elseif ($rule instanceof Each || $rule instanceof IndexedArray || $rule instanceof Composite) {
 			$required = false;
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
Failed asserting that true is false.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTest.php:125
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] InstanceOf_
RulesResolver/AbstractRuleResolver.php:89:3
 				$required = self::isRequired($item);
 			}
 			$propertyData->setRequired($required);
-		} elseif ($rule instanceof Each || $rule instanceof IndexedArray || $rule instanceof Composite) {
+		} elseif (true || $rule instanceof IndexedArray || $rule instanceof Composite) {
 			$required = false;
 			foreach ($rule->getRules() as $item) {
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                             
  [Error] Call to undefined method Yiisoft\Validator\Rule\Regex::getRules()  
                                                                             
#1  /var/www/kernel-api-framework/OpenApi/RulesResolver/Ab

[Killed] InstanceOf_
RulesResolver/AbstractRuleResolver.php:89:3
 				$required = self::isRequired($item);
 			}
 			$propertyData->setRequired($required);
-		} elseif ($rule instanceof Each || $rule instanceof IndexedArray || $rule instanceof Composite) {
+		} elseif ($rule instanceof Each || $rule instanceof IndexedArray || true) {
 			$required = false;
 			foreach ($rule->getRules() as $item) {
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                             
  [Error] Call to undefined method Yiisoft\Validator\Rule\Regex::getRules()  
                                                                             
#1  /var/www/kernel-api-framework/OpenApi/RulesResolver/Ab

[Survived] FalseValue
RulesResolver/AbstractRuleResolver.php:90:4
 			}
 			$propertyData->setRequired($required);
 		} elseif ($rule instanceof Each || $rule instanceof IndexedArray || $rule instanceof Composite) {
-			$required = false;
+			$required = true;
 			foreach ($rule->getRules() as $item) {
 				$required = self::isRequired($rule);

[Killed] Foreach_
RulesResolver/AbstractRuleResolver.php:91:4
 			$propertyData->setRequired($required);
 		} elseif ($rule instanceof Each || $rule instanceof IndexedArray || $rule instanceof Composite) {
 			$required = false;
-			foreach ($rule->getRules() as $item) {
-				$required = self::isRequired($rule);
-			}
+			foreach (array() as $item) {
 			$propertyData->setRequired($required);
 		} else {
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
Failed asserting that false is true.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTest.php:195
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] MethodCallRemoval
RulesResolver/AbstractRuleResolver.php:96:4
 			}
 			$propertyData->setRequired($required);
 		} else {
-			$propertyData->setRequired(self::isRequired($rule));
+			
 		}
 	}
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
Failed asserting that false is true.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTest.php:41
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 2, Assertions: 1, Failures: 1.

[Killed] InstanceOf_
RulesResolver/AbstractRuleResolver.php:102:3
 
 	private static function isRequired(RuleInterface $rule): bool
 	{
-		if ($rule instanceof RulesNormalizerIterator) {
+		if (true) {
 			$rule = $rule->getIterator()->current();
 		}
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                
  [Error] Call to undefined method Yiisoft\Validator\Rule\Regex::getIterator()  
                                                                                
#1  /var/www/kernel-api-framework/OpenApi/RulesRe

[Survived] InstanceOf_
RulesResolver/AbstractRuleResolver.php:102:3
 
 	private static function isRequired(RuleInterface $rule): bool
 	{
-		if ($rule instanceof RulesNormalizerIterator) {
+		if (false) {
 			$rule = $rule->getIterator()->current();
 		}

[Killed] InstanceOf_
RulesResolver/AbstractRuleResolver.php:106:4
 			$rule = $rule->getIterator()->current();
 		}
 		if (
-			$rule instanceof SkipOnEmptyInterface
+			if (true && ($rule->getSkipOnEmpty() === false || $rule->getSkipOnEmpty() === null || $rule->getSkipOnEmpty() instanceof NeverEmpty)) {
 			&& (
 				$rule->getSkipOnEmpty() === false
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                                         
  [Error] Call to undefined method Kernel\Components\Validation\rules\DateTimeCompare::getSkipOnEmpty()

[Killed] LogicalAndNegation
RulesResolver/AbstractRuleResolver.php:106:4
 			$rule = $rule->getIterator()->current();
 		}
 		if (
-			$rule instanceof SkipOnEmptyInterface
-			&& (
-				$rule->getSkipOnEmpty() === false
-				|| $rule->getSkipOnEmpty() === null
-				|| $rule->getSkipOnEmpty() instanceof NeverEmpty
-			)
+			if (!($rule instanceof SkipOnEmptyInterface && ($rule->getSkipOnEmpty() === false || $rule->getSkipOnEmpty() === null || $rule->getSkipOnEmpty() instanceof NeverEmpty))) {
 		) {
 			return true;
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
Failed asserting that false is true.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTest.php:41
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] LogicalOrNegation
RulesResolver/AbstractRuleResolver.php:108:5
 		if (
 			$rule instanceof SkipOnEmptyInterface
 			&& (
-				$rule->getSkipOnEmpty() === false
-				|| $rule->getSkipOnEmpty() === null
-				|| $rule->getSkipOnEmpty() instanceof NeverEmpty
+				if ($rule instanceof SkipOnEmptyInterface && !($rule->getSkipOnEmpty() === false || $rule->getSkipOnEmpty() === null || $rule->getSkipOnEmpty() instanceof NeverEmpty)) {ceof NeverEmpty
 			)
 		) {
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
Failed asserting that false is true.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTest.php:41
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] Identical
RulesResolver/AbstractRuleResolver.php:108:5
 		if (
 			$rule instanceof SkipOnEmptyInterface
 			&& (
-				$rule->getSkipOnEmpty() === false
+				if ($rule instanceof SkipOnEmptyInterface && ($rule->getSkipOnEmpty() !== false || $rule->getSkipOnEmpty() === null || $rule->getSkipOnEmpty() instanceof NeverEmpty)) {
 				|| $rule->getSkipOnEmpty() === null
 				|| $rule->getSkipOnEmpty() instanceof NeverEmpty
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
Failed asserting that true is false.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTest.php:61
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 2, Assertions: 1, Failures: 1.

[Killed] Identical
RulesResolver/AbstractRuleResolver.php:109:5
 			$rule instanceof SkipOnEmptyInterface
 			&& (
 				$rule->getSkipOnEmpty() === false
-				|| $rule->getSkipOnEmpty() === null
+				if ($rule instanceof SkipOnEmptyInterface && ($rule->getSkipOnEmpty() === false || $rule->getSkipOnEmpty() !== null || $rule->getSkipOnEmpty() instanceof NeverEmpty)) {
 				|| $rule->getSkipOnEmpty() instanceof NeverEmpty
 			)
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
Failed asserting that false is true.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTest.php:41
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] InstanceOf_
RulesResolver/AbstractRuleResolver.php:110:5
 			&& (
 				$rule->getSkipOnEmpty() === false
 				|| $rule->getSkipOnEmpty() === null
-				|| $rule->getSkipOnEmpty() instanceof NeverEmpty
+				if ($rule instanceof SkipOnEmptyInterface && ($rule->getSkipOnEmpty() === false || $rule->getSkipOnEmpty() === null || false)) {
 			)
 		) {
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
Failed asserting that false is true.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTest.php:69
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] InstanceOf_
RulesResolver/AbstractRuleResolver.php:110:5
 			&& (
 				$rule->getSkipOnEmpty() === false
 				|| $rule->getSkipOnEmpty() === null
-				|| $rule->getSkipOnEmpty() instanceof NeverEmpty
+				if ($rule instanceof SkipOnEmptyInterface && ($rule->getSkipOnEmpty() === false || $rule->getSkipOnEmpty() === null || true)) {
 			)
 		) {
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
Failed asserting that true is false.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTest.php:61
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] ProtectedVisibility
RulesResolver/AbstractRuleResolver.php:118:2
 		return false;
 	}
 
-	protected static function translateMessage(string $message, Translator $translator): string
+	private static function translateMessage(string $message, Translator $translator) : string
 	{
 		return $translator->translate($message, category: 'yii-validator');
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                                                                                         
  [Error] Call to private method OpenApi\RulesResolver\AbstractRuleResolver::translateMessage() from scope OpenApi\RulesResolver\DefaultMe
