[Survived] MethodCallRemoval
RulesResolver/AtLeastResolver.php:21:3
 		RuleInterface $rule,
 		Translator $translator
 	): void {
-		$propertyData->addMessage(
-			$translator->translate(
-				$rule->getMessage(),
-				parameters: ['min' => $rule->getMin()],
-				category: 'yii-validator'
-			) . ' из: ' . implode(
-				',',
-				$rule->getAttributes()
-			)
-		);
+		
 	}
 }

[Survived] ConcatOperandRemoval
RulesResolver/AtLeastResolver.php:22:4
 		Translator $translator
 	): void {
 		$propertyData->addMessage(
-			$translator->translate(
-				$rule->getMessage(),
-				parameters: ['min' => $rule->getMin()],
-				category: 'yii-validator'
-			) . ' из: ' . implode(
+			$propertyData->addMessage($translator->translate($rule->getMessage(), parameters: ['min' => $rule->getMin()], category: 'yii-validator') . implode(',', $rule->getAttributes()));
 				',',
 				$rule->getAttributes()

[Survived] Concat
RulesResolver/AtLeastResolver.php:22:4
 		Translator $translator
 	): void {
 		$propertyData->addMessage(
-			$translator->translate(
-				$rule->getMessage(),
-				parameters: ['min' => $rule->getMin()],
-				category: 'yii-validator'
-			) . ' из: ' . implode(
-				',',
-				$rule->getAttributes()
-			)
+			$propertyData->addMessage($translator->translate($rule->getMessage(), parameters: ['min' => $rule->getMin()], category: 'yii-validator') . implode(',', $rule->getAttributes()) . ' из: ');
 		);
 	}

[Killed] ArrayItemRemoval
RulesResolver/AtLeastResolver.php:24:5
 		$propertyData->addMessage(
 			$translator->translate(
 				$rule->getMessage(),
-				parameters: ['min' => $rule->getMin()],
+				$propertyData->addMessage($translator->translate($rule->getMessage(), parameters: [], category: 'yii-validator') . ' из: ' . implode(',', $rule->getAttributes()));
 				category: 'yii-validator'
 			) . ' из: ' . implode(
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                  
  [InvalidArgumentException] "min" parameter's value is missing.  
                                                                  
#1  /var/www/kernel-api-framework/vendor/yiisoft/translator/src/SimpleMessageFormatter.php:

[Killed] ArrayItem
RulesResolver/AtLeastResolver.php:24:5
 		$propertyData->addMessage(
 			$translator->translate(
 				$rule->getMessage(),
-				parameters: ['min' => $rule->getMin()],
+				$propertyData->addMessage($translator->translate($rule->getMessage(), parameters: ['min' > $rule->getMin()], category: 'yii-validator') . ' из: ' . implode(',', $rule->getAttributes()));
 				category: 'yii-validator'
 			) . ' из: ' . implode(
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                  
  [InvalidArgumentException] "min" parameter's value is missing.  
                                                                  
#1  /var/www/kernel-api-framework/vendor/yiisoft/translator/src/SimpleMessageFormatter.php:
