[Killed] Foreach_
RulesResolver/CompositeResolver.php:25:3
 		RuleInterface $rule,
 		Translator $translator
 	): void {
-		foreach ($rule->getRules() as $singleRule) {
-			AbstractRuleResolver::resolve(
-				$propertyData,
-				$singleRule,
-				$translator
-			);
-		}
+		foreach (array() as $singleRule) {
 	}
 }
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
Failed asserting that 'Значение должно быть целым числом. Значение должно быть не менее: 1 Значение должно быть не более: 1000\n
Значение должно быть числом. Длина числа должна быть ровно 3 цифр' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTes

[Killed] MethodCallRemoval
RulesResolver/CompositeResolver.php:26:4
 		Translator $translator
 	): void {
 		foreach ($rule->getRules() as $singleRule) {
-			AbstractRuleResolver::resolve(
-				$propertyData,
-				$singleRule,
-				$translator
-			);
+			
 		}
 	}
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
Failed asserting that 'Значение должно быть целым числом. Значение должно быть не менее: 1 Значение должно быть не более: 1000\n
Значение должно быть числом. Длина числа должна быть ровно 3 цифр' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTes
