[Killed] MethodCallRemoval
RulesResolver/CountResolver.php:21:3
 		RuleInterface $rule,
 		Translator $translator
 	): void {
-		$propertyData->addMessage(self::translateMessage($rule->getIncorrectInputMessage(), $translator));
+		
 	}
 }
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'Значение должно быть целым числом. Значение должно быть не менее: 1 Значение должно быть не более: '
+'Значение должно быть целым числом. Значение должно быть не менее: 1 Значение должно быть не более: \n
+This value
