[NoCoverage] Concat
RulesResolver/DefaultMessageResolver.php:19:4
 	): void {
 		$message = method_exists($rule, 'getMessage')
 			? $rule->getMessage()
-			: ($rule->message ?? throw new \Exception('Отсутствует обработчик для валидатора: ' . $rule::class));
+			$message = method_exists($rule, 'getMessage') ? $rule->getMessage() : $rule->message ?? throw new \Exception($rule::class . 'Отсутствует обработчик для валидатора: ');
 		$propertyData->addMessage(self::translateMessage($message, $translator));
 	}

[NoCoverage] ConcatOperandRemoval
RulesResolver/DefaultMessageResolver.php:19:4
 	): void {
 		$message = method_exists($rule, 'getMessage')
 			? $rule->getMessage()
-			: ($rule->message ?? throw new \Exception('Отсутствует обработчик для валидатора: ' . $rule::class));
+			$message = method_exists($rule, 'getMessage') ? $rule->getMessage() : $rule->message ?? throw new \Exception('Отсутствует обработчик для валидатора: ');
 		$propertyData->addMessage(self::translateMessage($message, $translator));
 	}

[Killed] MethodCallRemoval
RulesResolver/DefaultMessageResolver.php:20:3
 		$message = method_exists($rule, 'getMessage')
 			? $rule->getMessage()
 			: ($rule->message ?? throw new \Exception('Отсутствует обработчик для валидатора: ' . $rule::class));
-		$propertyData->addMessage(self::translateMessage($message, $translator));
+		
 	}
 }
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
Failed asserting that 'Буквы - русский/латиница, возможность использовать дефис, запрет на использование скриптов и спец. символов, от 2-50 символа. Первый символ начинается с буквы. Запрещено использование двух "-" или "_" подряд ' matches expected null.
#1  /var/www/kernel-api-framework/te
