[Killed] ConcatOperandRemoval
RulesResolver/InResolver.php:22:3
 		Translator $translator
 	): void {
 		$enums = $rule->getValues();
-		$propertyData->addMessage('Значение должно быть из следующего списка: ' . implode(',', $enums));
+		$propertyData->addMessage('Значение должно быть из следующего списка: ');
 		$propertyData->setEnumItems($enums);
 	}
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'Значение должно быть из следующего списка: '
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTest.php:51

[Killed] ConcatOperandRemoval
RulesResolver/InResolver.php:22:3
 		Translator $translator
 	): void {
 		$enums = $rule->getValues();
-		$propertyData->addMessage('Значение должно быть из следующего списка: ' . implode(',', $enums));
+		$propertyData->addMessage(implode(',', $enums));
 		$propertyData->setEnumItems($enums);
 	}
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTest.php:51

[Killed] MethodCallRemoval
RulesResolver/InResolver.php:23:3
 	): void {
 		$enums = $rule->getValues();
 		$propertyData->addMessage('Значение должно быть из следующего списка: ' . implode(',', $enums));
-		$propertyData->setEnumItems($enums);
+		
 	}
 }
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
[...] does not match expected type "NULL".
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTest.php:53
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.
