[Killed] Foreach_
RulesResolver/IndexedArrayResolver.php:78:3
 		Translator $translator
 	): void {
 		$rulesArray = $rule->getRules();
-		foreach ($rulesArray as $rule) {
-			$rule = $rule->getIterator()->current();
-			self::resolve($propertyData, $rule, $translator);
-			/** @var RuleInterface $rule */
-			self::resolveArrayType($rule, $propertyData);
-		}
+		foreach (array() as $rule) {
 		$propertyData->setType(Type::ARRAY);
 	}
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                                                                       
  [Exception] В массиве свойства enumCollection необходимо указать тип элементов! DTO: Unit\OpenApi\RequestsExamples\dtos\AllRulesDto

[Killed] MethodCallRemoval
RulesResolver/IndexedArrayResolver.php:80:4
 		$rulesArray = $rule->getRules();
 		foreach ($rulesArray as $rule) {
 			$rule = $rule->getIterator()->current();
-			self::resolve($propertyData, $rule, $translator);
+			
 			/** @var RuleInterface $rule */
 			self::resolveArrayType($rule, $propertyData);
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTest.php:58
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 2, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
RulesResolver/IndexedArrayResolver.php:82:4
 			$rule = $rule->getIterator()->current();
 			self::resolve($propertyData, $rule, $translator);
 			/** @var RuleInterface $rule */
-			self::resolveArrayType($rule, $propertyData);
+			
 		}
 		$propertyData->setType(Type::ARRAY);
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                                                                     
  [Exception] В массиве свойства indexedArray необходимо указать тип элементов! DTO: Unit\OpenApi\RequestsExamples\dtos\AllRulesDto

[Killed] MethodCallRemoval
RulesResolver/IndexedArrayResolver.php:84:3
 			/** @var RuleInterface $rule */
 			self::resolveArrayType($rule, $propertyData);
 		}
-		$propertyData->setType(Type::ARRAY);
+		
 	}
 
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'string'
+'array'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTest.php:82

[Killed] IfNegation
RulesResolver/IndexedArrayResolver.php:89:3
 
 	private static function resolveArrayType(RuleInterface $rule, DtoPropertyData $propertyData): void
 	{
-		if (in_array($rule::class, self::INTEGER_VALIDATION_RULES, true)) {
-			$propertyData->setArrayType('integer');
-		}
+		if (!in_array($rule::class, self::INTEGER_VALIDATION_RULES, true)) {
 		if (in_array($rule::class, self::FLOAT_VALIDATION_RULES, true)) {
 			$propertyData->setArrayType('number');
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                                                                       
  [Exception] В массиве свойства arrayWithCount необходимо указать тип элементов! DTO: Unit\OpenApi\RequestsExamples\dtos\AllRulesDto

[Killed] MethodCallRemoval
RulesResolver/IndexedArrayResolver.php:90:4
 	private static function resolveArrayType(RuleInterface $rule, DtoPropertyData $propertyData): void
 	{
 		if (in_array($rule::class, self::INTEGER_VALIDATION_RULES, true)) {
-			$propertyData->setArrayType('integer');
+			
 		}
 		if (in_array($rule::class, self::FLOAT_VALIDATION_RULES, true)) {
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                                                                       
  [Exception] В массиве свойства arrayWithCount необходимо указать тип элементов! DTO: Unit\OpenApi\RequestsExamples\dtos\AllRulesDto

[Killed] IfNegation
RulesResolver/IndexedArrayResolver.php:92:3
 		if (in_array($rule::class, self::INTEGER_VALIDATION_RULES, true)) {
 			$propertyData->setArrayType('integer');
 		}
-		if (in_array($rule::class, self::FLOAT_VALIDATION_RULES, true)) {
-			$propertyData->setArrayType('number');
-		}
+		if (!in_array($rule::class, self::FLOAT_VALIDATION_RULES, true)) {
 		if (in_array($rule::class, self::STRING_VALIDATION_RULES, true)) {
 			$propertyData->setArrayType('string');
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'number'
+'integer'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTest.php:102

[NoCoverage] MethodCallRemoval
RulesResolver/IndexedArrayResolver.php:93:4
 			$propertyData->setArrayType('integer');
 		}
 		if (in_array($rule::class, self::FLOAT_VALIDATION_RULES, true)) {
-			$propertyData->setArrayType('number');
+			
 		}
 		if (in_array($rule::class, self::STRING_VALIDATION_RULES, true)) {

[Killed] IfNegation
RulesResolver/IndexedArrayResolver.php:95:3
 		if (in_array($rule::class, self::FLOAT_VALIDATION_RULES, true)) {
 			$propertyData->setArrayType('number');
 		}
-		if (in_array($rule::class, self::STRING_VALIDATION_RULES, true)) {
-			$propertyData->setArrayType('string');
-		}
+		if (!in_array($rule::class, self::STRING_VALIDATION_RULES, true)) {
 		if (in_array($rule::class, self::BOOL_VALIDATION_RULES, true)) {
 			$propertyData->setArrayType('boolean');
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                                                                     
  [Exception] В массиве свойства indexedArray необходимо указать тип элементов! DTO: Unit\OpenApi\RequestsExamples\dtos\AllRulesDto

[Killed] MethodCallRemoval
RulesResolver/IndexedArrayResolver.php:96:4
 			$propertyData->setArrayType('number');
 		}
 		if (in_array($rule::class, self::STRING_VALIDATION_RULES, true)) {
-			$propertyData->setArrayType('string');
+			
 		}
 		if (in_array($rule::class, self::BOOL_VALIDATION_RULES, true)) {
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                                                                     
  [Exception] В массиве свойства indexedArray необходимо указать тип элементов! DTO: Unit\OpenApi\RequestsExamples\dtos\AllRulesDto

[Killed] IfNegation
RulesResolver/IndexedArrayResolver.php:98:3
 		if (in_array($rule::class, self::STRING_VALIDATION_RULES, true)) {
 			$propertyData->setArrayType('string');
 		}
-		if (in_array($rule::class, self::BOOL_VALIDATION_RULES, true)) {
-			$propertyData->setArrayType('boolean');
-		}
+		if (!in_array($rule::class, self::BOOL_VALIDATION_RULES, true)) {
 		if (in_array($rule::class, self::FILE_VALIDATION_RULES, true)) {
 			$propertyData->setArrayType('string');
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'boolean'
+'string'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTest.php:84

[NoCoverage] MethodCallRemoval
RulesResolver/IndexedArrayResolver.php:99:4
 			$propertyData->setArrayType('string');
 		}
 		if (in_array($rule::class, self::BOOL_VALIDATION_RULES, true)) {
-			$propertyData->setArrayType('boolean');
+			
 		}
 		if (in_array($rule::class, self::FILE_VALIDATION_RULES, true)) {

[Killed] IfNegation
RulesResolver/IndexedArrayResolver.php:101:3
 		if (in_array($rule::class, self::BOOL_VALIDATION_RULES, true)) {
 			$propertyData->setArrayType('boolean');
 		}
-		if (in_array($rule::class, self::FILE_VALIDATION_RULES, true)) {
-			$propertyData->setArrayType('string');
-		}
+		if (!in_array($rule::class, self::FILE_VALIDATION_RULES, true)) {
 		if ($rule instanceof In) {
 			$value = $rule->getValues()[0];
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                                                                       
  [Exception] В массиве свойства fileCollection необходимо указать тип элементов! DTO: Unit\OpenApi\RequestsExamples\dtos\AllRulesDto

[Killed] MethodCallRemoval
RulesResolver/IndexedArrayResolver.php:102:4
 			$propertyData->setArrayType('boolean');
 		}
 		if (in_array($rule::class, self::FILE_VALIDATION_RULES, true)) {
-			$propertyData->setArrayType('string');
+			
 		}
 		if ($rule instanceof In) {
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                                                                       
  [Exception] В массиве свойства fileCollection необходимо указать тип элементов! DTO: Unit\OpenApi\RequestsExamples\dtos\AllRulesDto

[Killed] InstanceOf_
RulesResolver/IndexedArrayResolver.php:104:3
 		if (in_array($rule::class, self::FILE_VALIDATION_RULES, true)) {
 			$propertyData->setArrayType('string');
 		}
-		if ($rule instanceof In) {
+		if (true) {
 			$value = $rule->getValues()[0];
 			if (is_int($value)) {
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                                                                    
  [Error] Call to undefined method Yiisoft\Validator\Rule\StringValue::getValues()  
                                                                                    
#1  /var/www/kernel-api-framework/Ope

[Survived] InstanceOf_
RulesResolver/IndexedArrayResolver.php:104:3
 		if (in_array($rule::class, self::FILE_VALIDATION_RULES, true)) {
 			$propertyData->setArrayType('string');
 		}
-		if ($rule instanceof In) {
+		if (false) {
 			$value = $rule->getValues()[0];
 			if (is_int($value)) {

[Survived] IncrementInteger
RulesResolver/IndexedArrayResolver.php:105:4
 			$propertyData->setArrayType('string');
 		}
 		if ($rule instanceof In) {
-			$value = $rule->getValues()[0];
+			$value = $rule->getValues()[1];
 			if (is_int($value)) {
 				$propertyData->setArrayType('integer');

[Survived] IfNegation
RulesResolver/IndexedArrayResolver.php:106:4
 		}
 		if ($rule instanceof In) {
 			$value = $rule->getValues()[0];
-			if (is_int($value)) {
-				$propertyData->setArrayType('integer');
-			} elseif (is_float($value)) {
-				$propertyData->setArrayType('number');
-			} elseif (is_string($value)) {
-				$propertyData->setArrayType('string');
-			} elseif (is_bool($value)) {
-				$propertyData->setArrayType('boolean');
-			} else {
-				throw new \Exception('Не поддерживаемый!');
-			}
+			if (!is_int($value)) {
 		}
 	}

[NoCoverage] MethodCallRemoval
RulesResolver/IndexedArrayResolver.php:107:5
 		if ($rule instanceof In) {
 			$value = $rule->getValues()[0];
 			if (is_int($value)) {
-				$propertyData->setArrayType('integer');
+				
 			} elseif (is_float($value)) {
 				$propertyData->setArrayType('number');

[Survived] ElseIfNegation
RulesResolver/IndexedArrayResolver.php:108:4
 			$value = $rule->getValues()[0];
 			if (is_int($value)) {
 				$propertyData->setArrayType('integer');
-			} elseif (is_float($value)) {
-				$propertyData->setArrayType('number');
-			} elseif (is_string($value)) {
+			} elseif (!is_float($value)) {{
 				$propertyData->setArrayType('string');
 			} elseif (is_bool($value)) {

[NoCoverage] MethodCallRemoval
RulesResolver/IndexedArrayResolver.php:109:5
 			if (is_int($value)) {
 				$propertyData->setArrayType('integer');
 			} elseif (is_float($value)) {
-				$propertyData->setArrayType('number');
+				
 			} elseif (is_string($value)) {
 				$propertyData->setArrayType('string');

[Killed] ElseIfNegation
RulesResolver/IndexedArrayResolver.php:110:4
 				$propertyData->setArrayType('integer');
 			} elseif (is_float($value)) {
 				$propertyData->setArrayType('number');
-			} elseif (is_string($value)) {
-				$propertyData->setArrayType('string');
-			} elseif (is_bool($value)) {
+			} elseif (!is_string($value)) {
 				$propertyData->setArrayType('boolean');
 			} else {
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
                                  
  [Exception] Не поддерживаемый!  
                                  
#1  /var/www/kernel-api-framework/OpenApi/RulesResolver/IndexedArrayResolver.php:79
#2  /var/www/kernel-api-framework/OpenApi/RulesResolver/IndexedArrayResolver.php:47
#3  /var/www/kernel

[Survived] MethodCallRemoval
RulesResolver/IndexedArrayResolver.php:111:5
 			} elseif (is_float($value)) {
 				$propertyData->setArrayType('number');
 			} elseif (is_string($value)) {
-				$propertyData->setArrayType('string');
+				
 			} elseif (is_bool($value)) {
 				$propertyData->setArrayType('boolean');

[NoCoverage] ElseIfNegation
RulesResolver/IndexedArrayResolver.php:112:4
 				$propertyData->setArrayType('number');
 			} elseif (is_string($value)) {
 				$propertyData->setArrayType('string');
-			} elseif (is_bool($value)) {
-				$propertyData->setArrayType('boolean');
-			} else {
+			} elseif (!is_bool($value)) {
 				throw new \Exception('Не поддерживаемый!');
 			}

[NoCoverage] MethodCallRemoval
RulesResolver/IndexedArrayResolver.php:113:5
 			} elseif (is_string($value)) {
 				$propertyData->setArrayType('string');
 			} elseif (is_bool($value)) {
-				$propertyData->setArrayType('boolean');
+				
 			} else {
 				throw new \Exception('Не поддерживаемый!');

[NoCoverage] Throw_
RulesResolver/IndexedArrayResolver.php:115:5
 			} elseif (is_bool($value)) {
 				$propertyData->setArrayType('boolean');
 			} else {
-				throw new \Exception('Не поддерживаемый!');
+				new \Exception('Не поддерживаемый!');
 			}
 		}
