[NoCoverage] TrueValue
RulesResolver/RequiredResolver.php:21:3
 		RuleInterface $rule,
 		Translator $translator
 	): void {
-		$propertyData->setRequired(true);
+		$propertyData->setRequired(false);
 	}
 }

[NoCoverage] MethodCallRemoval
RulesResolver/RequiredResolver.php:21:3
 		RuleInterface $rule,
 		Translator $translator
 	): void {
-		$propertyData->setRequired(true);
+		
 	}
 }
