[Killed] PublicVisibility
SuccessResponseDataHelper.php:20:2
 	) {
 	}
 
-	public function getSuccessResponse(string $methodNameSpace): Response
+	protected function getSuccessResponse(string $methodNameSpace) : Response
 	{
 		$successResponseResult = $this->getMethodReturnByDocBlock($methodNameSpace);
statusReason: 1) SuccessResponseDataHelperTest: Object collection return will fail
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testObjectCollectionReturnWillFail
Failed asserting that exception message 'Call to protected method OpenApi\SuccessResponseDataHelper::getSuccessResponse() from scope Unit\OpenApi\SuccessResponseDataHelperTest' contains 'Допустим только один тип или набор значений(исклю

[Killed] ArrayItemRemoval
SuccessResponseDataHelper.php:23:3
 	public function getSuccessResponse(string $methodNameSpace): Response
 	{
 		$successResponseResult = $this->getMethodReturnByDocBlock($methodNameSpace);
-		return new Response([
-			'content' => ['application/json' => $successResponseResult],
-			'description' => 'Response description'
-		]);
+		return new Response(['description' => 'Response description']);
 	}
 
statusReason: 1) SuccessResponseDataHelperTest: Int return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testIntReturn
Failed asserting that 'integer' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:72
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] LogicalNot
SuccessResponseDataHelper.php:32:3
 	private function getMethodReturnByDocBlock(string $methodNamespace): MediaType
 	{
 		$parser = new PhpDocParser($methodNamespace);
-		if (!is_subclass_of($methodNamespace, ExecuteInterface::class)) {
+		if (is_subclass_of($methodNamespace, ExecuteInterface::class)) {
 			throw new \Exception('Метод не имплементирует ExecuteInterface!');
 		}
statusReason: 1) SuccessResponseDataHelperTest: Method without doc blocks will fail
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testMethodWithoutDocBlocksWillFail
Failed asserting that exception message 'Метод не имплементирует ExecuteInterface!' contains 'Метод не содержит docBlock!'.
#1  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] Throw_
SuccessResponseDataHelper.php:33:4
 	{
 		$parser = new PhpDocParser($methodNamespace);
 		if (!is_subclass_of($methodNamespace, ExecuteInterface::class)) {
-			throw new \Exception('Метод не имплементирует ExecuteInterface!');
+			new \Exception('Метод не имплементирует ExecuteInterface!');
 		}
 		$phpDocNode = $parser->getPhpDocNode($parser->getMethodDocs('execute'));
statusReason: 1) SuccessResponseDataHelperTest: Without execute interface name space will fail
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testWithoutExecuteInterfaceNameSpaceWillFail
Failed asserting that exception message 'Unable to find property: execute recursively in class: Unit\OpenApi\ResponseExamples\TestMethodWithoutExecuteInterface' contains 'Метод не имплементирует ExecuteInterface!'.

[Killed] LogicalNot
SuccessResponseDataHelper.php:36:3
 			throw new \Exception('Метод не имплементирует ExecuteInterface!');
 		}
 		$phpDocNode = $parser->getPhpDocNode($parser->getMethodDocs('execute'));
-		if (!empty($phpDocNode->getReturnTagValues('@psalm-return'))) {
+		if (empty($phpDocNode->getReturnTagValues('@psalm-return'))) {
 			$node = $phpDocNode->getReturnTagValues('@psalm-return')[0];
 		} elseif (!empty($phpDocNode->getReturnTagValues('@return'))) {
statusReason: 1) SuccessResponseDataHelperTest: Nullable return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testNullableReturn
                                                                                                                                                                                                                                             
  [TypeError] OpenApi\PhpDocParse

[NoCoverage] IncrementInteger
SuccessResponseDataHelper.php:37:4
 		}
 		$phpDocNode = $parser->getPhpDocNode($parser->getMethodDocs('execute'));
 		if (!empty($phpDocNode->getReturnTagValues('@psalm-return'))) {
-			$node = $phpDocNode->getReturnTagValues('@psalm-return')[0];
+			$node = $phpDocNode->getReturnTagValues('@psalm-return')[1];
 		} elseif (!empty($phpDocNode->getReturnTagValues('@return'))) {
 			$node = $phpDocNode->getReturnTagValues('@return')[0];

[Killed] LogicalNot
SuccessResponseDataHelper.php:38:3
 		$phpDocNode = $parser->getPhpDocNode($parser->getMethodDocs('execute'));
 		if (!empty($phpDocNode->getReturnTagValues('@psalm-return'))) {
 			$node = $phpDocNode->getReturnTagValues('@psalm-return')[0];
-		} elseif (!empty($phpDocNode->getReturnTagValues('@return'))) {
+		} elseif (empty($phpDocNode->getReturnTagValues('@return'))) {
 			$node = $phpDocNode->getReturnTagValues('@return')[0];
 		} elseif (!empty($phpDocNode->getReturnTagValues('@phpstan-return'))) {
statusReason: 1) SuccessResponseDataHelperTest: Associative array return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testAssociativeArrayReturn
Failed asserting that '#/components/schemas/entities_TestObject' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:118
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests:

[Killed] IncrementInteger
SuccessResponseDataHelper.php:39:4
 		if (!empty($phpDocNode->getReturnTagValues('@psalm-return'))) {
 			$node = $phpDocNode->getReturnTagValues('@psalm-return')[0];
 		} elseif (!empty($phpDocNode->getReturnTagValues('@return'))) {
-			$node = $phpDocNode->getReturnTagValues('@return')[0];
+			$node = $phpDocNode->getReturnTagValues('@return')[1];
 		} elseif (!empty($phpDocNode->getReturnTagValues('@phpstan-return'))) {
 			$node = $phpDocNode->getReturnTagValues('@phpstan-return')[0];
statusReason: 1) SuccessResponseDataHelperTest: Union type return will fail
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testUnionTypeReturnWillFail
#1  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[NoCoverage] LogicalNot
SuccessResponseDataHelper.php:40:3
 			$node = $phpDocNode->getReturnTagValues('@psalm-return')[0];
 		} elseif (!empty($phpDocNode->getReturnTagValues('@return'))) {
 			$node = $phpDocNode->getReturnTagValues('@return')[0];
-		} elseif (!empty($phpDocNode->getReturnTagValues('@phpstan-return'))) {
+		} elseif (empty($phpDocNode->getReturnTagValues('@phpstan-return'))) {
 			$node = $phpDocNode->getReturnTagValues('@phpstan-return')[0];
 		} else {

[NoCoverage] IncrementInteger
SuccessResponseDataHelper.php:41:4
 		} elseif (!empty($phpDocNode->getReturnTagValues('@return'))) {
 			$node = $phpDocNode->getReturnTagValues('@return')[0];
 		} elseif (!empty($phpDocNode->getReturnTagValues('@phpstan-return'))) {
-			$node = $phpDocNode->getReturnTagValues('@phpstan-return')[0];
+			$node = $phpDocNode->getReturnTagValues('@phpstan-return')[1];
 		} else {
 			return new MediaType([]);
