[Killed] PublicVisibility
TypeResolver.php:24:2
 		'mixed'
 	];
 
-	public function resolve(array|string $resolvingType, array $resolvedClass = []): Schema
+	protected function resolve(array|string $resolvingType, array $resolvedClass = []) : Schema
 	{
 		if (is_string($resolvingType)) {
statusReason: 1) SuccessResponseDataHelperTest: List of objects return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testListOfObjectsReturn
                                                                                                                 
  [Error] Call to protected method OpenApi\TypeResolver::resolve() from scope OpenApi\SuccessResponseDataHelper

[Killed] IfNegation
TypeResolver.php:26:3
 
 	public function resolve(array|string $resolvingType, array $resolvedClass = []): Schema
 	{
-		if (is_string($resolvingType)) {
-			return $this->resolveString($resolvingType, $resolvedClass);
-		} else {
-			return $this->resolveArray($resolvingType, $resolvedClass);
-		}
+		if (!is_string($resolvingType)) {
 	}
 
statusReason: 1) SuccessResponseDataHelperTest: List of enum values with astrix return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testListOfEnumValuesWithAstrixReturn
                                                                                                                                                                                                    
  [TypeError] OpenApi\TypeResolve

[Killed] IfNegation
TypeResolver.php:35:3
 
 	private function resolveString(string $resolvingType, array $resolvedClass): Schema
 	{
-		if ($this->isUnion($resolvingType)) {
-			return $this->resolveUnionTypes($resolvingType, $resolvedClass);
-		} elseif (class_exists($resolvingType)) {
-			return $this->resolveObject($resolvingType, $resolvedClass);
-		} elseif ($resolvingType === 'string') {
-			return new Schema(['type' => Type::STRING]);
-		} elseif ($resolvingType === 'null') {
-			return new Schema(['nullable' => true]);
-		} elseif (in_array($resolvingType, self::PRIMARY_TYPES, true)) {
-			return new Schema(['type' => $this->convertTypeToOpenApi($resolvingType)]);
-		}
+		if (!$this->isUnion($resolvingType)) {
 		return new Schema(['type' => Type::STRING, 'enum' => [$resolvingType]]);
 	}
statusReason: 1) SuccessResponseDataHelperTest: Union type return will fail
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testUnionTypeReturnWillFail
Failed asserting that exception with message "Допустим только один тип или набор значений(исключение null)" is thrown
#1  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 5, Assertions: 9, Failures: 1.

[Killed] ElseIfNegation
TypeResolver.php:37:3
 	{
 		if ($this->isUnion($resolvingType)) {
 			return $this->resolveUnionTypes($resolvingType, $resolvedClass);
-		} elseif (class_exists($resolvingType)) {
-			return $this->resolveObject($resolvingType, $resolvedClass);
-		} elseif ($resolvingType === 'string') {
+		} elseif (!class_exists($resolvingType)) {
 			return new Schema(['type' => Type::STRING]);
 		} elseif ($resolvingType === 'null') {
statusReason: 1) SuccessResponseDataHelperTest: Object const return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testObjectConstReturn
                                                    
  [ReflectionException] Class "abc" does not exist  
                                                    
#1  /var/www/kernel-api-framework/OpenApi/TypeResolver.php:201
#2  /var/www/kernel-api-framework/OpenApi/

[Killed] Identical
TypeResolver.php:39:3
 			return $this->resolveUnionTypes($resolvingType, $resolvedClass);
 		} elseif (class_exists($resolvingType)) {
 			return $this->resolveObject($resolvingType, $resolvedClass);
-		} elseif ($resolvingType === 'string') {
+		} elseif ($resolvingType !== 'string') {
 			return new Schema(['type' => Type::STRING]);
 		} elseif ($resolvingType === 'null') {
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'string'
+'integer'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTest.php:67

[Killed] Identical
TypeResolver.php:41:3
 			return $this->resolveObject($resolvingType, $resolvedClass);
 		} elseif ($resolvingType === 'string') {
 			return new Schema(['type' => Type::STRING]);
-		} elseif ($resolvingType === 'null') {
+		} elseif ($resolvingType !== 'null') {
 			return new Schema(['nullable' => true]);
 		} elseif (in_array($resolvingType, self::PRIMARY_TYPES, true)) {
statusReason: 1) RequestDataHelperTest: All rules dto
 Test  tests/Unit/OpenApi/RequestDataHelperTest.php:testAllRulesDto
Failed asserting that 'integer' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/RequestDataHelperTest.php:67
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[NoCoverage] TrueValue
TypeResolver.php:42:4
 		} elseif ($resolvingType === 'string') {
 			return new Schema(['type' => Type::STRING]);
 		} elseif ($resolvingType === 'null') {
-			return new Schema(['nullable' => true]);
+			return new Schema(['nullable' => false]);
 		} elseif (in_array($resolvingType, self::PRIMARY_TYPES, true)) {
 			return new Schema(['type' => $this->convertTypeToOpenApi($resolvingType)]);

[Killed] ElseIfNegation
TypeResolver.php:43:3
 			return new Schema(['type' => Type::STRING]);
 		} elseif ($resolvingType === 'null') {
 			return new Schema(['nullable' => true]);
-		} elseif (in_array($resolvingType, self::PRIMARY_TYPES, true)) {
-			return new Schema(['type' => $this->convertTypeToOpenApi($resolvingType)]);
-		}
+		} elseif (!in_array($resolvingType, self::PRIMARY_TYPES, true)) {
 		return new Schema(['type' => Type::STRING, 'enum' => [$resolvingType]]);
 	}
statusReason: 1) SuccessResponseDataHelperTest: Float return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testFloatReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'string'
+'number'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:90

[Killed] TrueValue
TypeResolver.php:51:3
 
 	private function resolveUnionTypes(string $unionTypes, array $resolvedClasses): Schema
 	{
-		$enum = true;
+		$enum = false;
 		$types = array_unique(explode('|', $unionTypes));
 		/**
statusReason: 1) SuccessResponseDataHelperTest: Object all constants return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testObjectAllConstantsReturn
Failed asserting that 'string' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:244
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 9, Assertions: 27, Failures:

[Survived] UnwrapArrayUnique
TypeResolver.php:52:3
 	private function resolveUnionTypes(string $unionTypes, array $resolvedClasses): Schema
 	{
 		$enum = true;
-		$types = array_unique(explode('|', $unionTypes));
+		$types = explode('|', $unionTypes);
 		/**
 		 * Допустимые варианты типов и константа:

[Killed] MethodCallRemoval
TypeResolver.php:57:3
 		 * Допустимые варианты типов и константа:
 		 *'11|12|13', '11|12|14|13|null', 'string|null', "StatusClass|null", "null|StatusClass"
 		 **/
-		$this->checkIfAllowedNumberOfTypes($types);
+		
 		$enums = [];
 		$schema = new Schema([]);
statusReason: 1) SuccessResponseDataHelperTest: One of return will fail
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testOneOfReturnWillFail
Failed asserting that exception with message "Допустим только один тип или набор значений(исключение null)" is thrown
#1  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 3, Assertions: 21, Failures: 1.

[Killed] Foreach_
TypeResolver.php:60:3
 		$this->checkIfAllowedNumberOfTypes($types);
 		$enums = [];
 		$schema = new Schema([]);
-		foreach ($types as $type) {
-			if (class_exists($type)) {
-				$enum = false;
-				$schema = $this->resolveObject($type, $resolvedClasses);
-			} elseif (in_array($type, self::PRIMARY_TYPES, true) && $type !== 'null') {
-				$enum = false;
-				$schema->type = $this->convertTypeToOpenApi($type);
-			} elseif ($type === 'null') {
-				$schema->nullable = true;
-			} else {
-				$enums[] = (string)$type;
-			}
-		}
+		foreach (array() as $type) {
 		if ($enum) {
 			$schema->type = Type::STRING;
statusReason: 1) SuccessResponseDataHelperTest: Array shape return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testArrayShapeReturn
Failed asserting that null is true.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:207
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 3, Assertions: 3, Failures: 1.

[Killed] IfNegation
TypeResolver.php:61:4
 		$enums = [];
 		$schema = new Schema([]);
 		foreach ($types as $type) {
-			if (class_exists($type)) {
-				$enum = false;
-				$schema = $this->resolveObject($type, $resolvedClasses);
-			} elseif (in_array($type, self::PRIMARY_TYPES, true) && $type !== 'null') {
-				$enum = false;
-				$schema->type = $this->convertTypeToOpenApi($type);
-			} elseif ($type === 'null') {
-				$schema->nullable = true;
-			} else {
-				$enums[] = (string)$type;
-			}
+			if (!class_exists($type)) {
 		}
 		if ($enum) {
statusReason: 1) SuccessResponseDataHelperTest: Array shape return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testArrayShapeReturn
                                                                        
  [ReflectionException] Class "oAccessBookmakerCabinet" does not exist  
                                                                        
#1  /var/www/kernel-api-framework/OpenApi/TypeR

[Survived] FalseValue
TypeResolver.php:62:5
 		$schema = new Schema([]);
 		foreach ($types as $type) {
 			if (class_exists($type)) {
-				$enum = false;
+				$enum = true;
 				$schema = $this->resolveObject($type, $resolvedClasses);
 			} elseif (in_array($type, self::PRIMARY_TYPES, true) && $type !== 'null') {

[Killed] NotIdentical
TypeResolver.php:64:4
 			if (class_exists($type)) {
 				$enum = false;
 				$schema = $this->resolveObject($type, $resolvedClasses);
-			} elseif (in_array($type, self::PRIMARY_TYPES, true) && $type !== 'null') {
+			} elseif (in_array($type, self::PRIMARY_TYPES, true) && $type === 'null') {
 				$enum = false;
 				$schema->type = $this->convertTypeToOpenApi($type);
statusReason: 1) SuccessResponseDataHelperTest: Array shape return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testArrayShapeReturn
Failed asserting that null is true.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:207
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 19, Assertions: 48, Failures: 1.

[Killed] LogicalAndNegation
TypeResolver.php:64:4
 			if (class_exists($type)) {
 				$enum = false;
 				$schema = $this->resolveObject($type, $resolvedClasses);
-			} elseif (in_array($type, self::PRIMARY_TYPES, true) && $type !== 'null') {
+			} elseif (!(in_array($type, self::PRIMARY_TYPES, true) && $type !== 'null')) {
 				$enum = false;
 				$schema->type = $this->convertTypeToOpenApi($type);
statusReason: 1) SuccessResponseDataHelperTest: Array shape return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testArrayShapeReturn
Failed asserting that null is true.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:207
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 6, Assertions: 19, Failures: 1.

[NoCoverage] FalseValue
TypeResolver.php:65:5
 				$enum = false;
 				$schema = $this->resolveObject($type, $resolvedClasses);
 			} elseif (in_array($type, self::PRIMARY_TYPES, true) && $type !== 'null') {
-				$enum = false;
+				$enum = true;
 				$schema->type = $this->convertTypeToOpenApi($type);
 			} elseif ($type === 'null') {

[Killed] Identical
TypeResolver.php:67:4
 			} elseif (in_array($type, self::PRIMARY_TYPES, true) && $type !== 'null') {
 				$enum = false;
 				$schema->type = $this->convertTypeToOpenApi($type);
-			} elseif ($type === 'null') {
+			} elseif ($type !== 'null') {
 				$schema->nullable = true;
 			} else {
statusReason: 1) SuccessResponseDataHelperTest: Object all constants return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testObjectAllConstantsReturn
Failed asserting that two arrays are equal.
- Expected | + Actual
@@ @@
Array (
+    0 => 'abc'
+    1 => 'bca'

[Killed] TrueValue
TypeResolver.php:68:5
 				$enum = false;
 				$schema->type = $this->convertTypeToOpenApi($type);
 			} elseif ($type === 'null') {
-				$schema->nullable = true;
+				$schema->nullable = false;
 			} else {
 				$enums[] = (string)$type;
statusReason: 1) SuccessResponseDataHelperTest: Nullable return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testNullableReturn
Failed asserting that false is true.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:224
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 5, Assertions: 15, Failures: 1.

[Killed] IfNegation
TypeResolver.php:73:3
 				$enums[] = (string)$type;
 			}
 		}
-		if ($enum) {
-			$schema->type = Type::STRING;
-			$schema->enum = $enums;
-		}
+		if (!$enum) {
 		return $schema;
 	}
statusReason: 1) SuccessResponseDataHelperTest: Object all constants return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testObjectAllConstantsReturn
Failed asserting that 'string' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:244
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 2, Assertions: 3, Failures:

[Killed] DecrementInteger
TypeResolver.php:82:3
 
 	private function checkIfAllowedNumberOfTypes(array $types): void
 	{
-		$count = 0;
+		$count = -1;
 		foreach ($types as $type) {
 			if ((in_array($type, self::PRIMARY_TYPES, true) || class_exists($type)) && $type !== 'null') {
statusReason: 1) SuccessResponseDataHelperTest: Object collection return will fail
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testObjectCollectionReturnWillFail
Failed asserting that exception with message "Допустим только один тип или набор значений(исключение null)" is thrown
#1  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 14, Assertions: 49, Failures: 1.

[Killed] Foreach_
TypeResolver.php:83:3
 	private function checkIfAllowedNumberOfTypes(array $types): void
 	{
 		$count = 0;
-		foreach ($types as $type) {
-			if ((in_array($type, self::PRIMARY_TYPES, true) || class_exists($type)) && $type !== 'null') {
-				$count++;
-			}
-		}
+		foreach (array() as $type) {
 		if ($count > 1) {
 			throw new \Exception('Допустим только один тип или набор значений(исключение null)');
statusReason: 1) SuccessResponseDataHelperTest: Union type return will fail
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testUnionTypeReturnWillFail
Failed asserting that exception with message "Допустим только один тип или набор значений(исключение null)" is thrown
#1  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 10, Assertions: 38, Failures: 1.

[Killed] LogicalOrAllSubExprNegation
TypeResolver.php:84:4
 	{
 		$count = 0;
 		foreach ($types as $type) {
-			if ((in_array($type, self::PRIMARY_TYPES, true) || class_exists($type)) && $type !== 'null') {
+			if ((!in_array($type, self::PRIMARY_TYPES, true) || !class_exists($type)) && $type !== 'null') {
 				$count++;
 			}
statusReason: 1) SuccessResponseDataHelperTest: Keys is constants return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testKeysIsConstantsReturn
                                                                            
  [Exception] Допустим только один тип или набор значений(исключение null)  
                                                                            
#1  /var/www/kernel-api-

[Killed] LogicalOrNegation
TypeResolver.php:84:4
 	{
 		$count = 0;
 		foreach ($types as $type) {
-			if ((in_array($type, self::PRIMARY_TYPES, true) || class_exists($type)) && $type !== 'null') {
+			if (!(in_array($type, self::PRIMARY_TYPES, true) || class_exists($type)) && $type !== 'null') {
 				$count++;
 			}
statusReason: 1) SuccessResponseDataHelperTest: Keys is constants return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testKeysIsConstantsReturn
                                                                            
  [Exception] Допустим только один тип или набор значений(исключение null)  
                                                                            
#1  /var/www/kernel-api-

[Killed] Increment
TypeResolver.php:85:5
 		$count = 0;
 		foreach ($types as $type) {
 			if ((in_array($type, self::PRIMARY_TYPES, true) || class_exists($type)) && $type !== 'null') {
-				$count++;
+				$count--;
 			}
 		}
statusReason: 1) SuccessResponseDataHelperTest: One of return will fail
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testOneOfReturnWillFail
Failed asserting that exception with message "Допустим только один тип или набор значений(исключение null)" is thrown
#1  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 6, Assertions: 15, Failures: 1.

[Killed] GreaterThanNegotiation
TypeResolver.php:88:3
 				$count++;
 			}
 		}
-		if ($count > 1) {
+		if ($count <= 1) {
 			throw new \Exception('Допустим только один тип или набор значений(исключение null)');
 		}
statusReason: 1) SuccessResponseDataHelperTest: Keys is constants return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testKeysIsConstantsReturn
                                                                            
  [Exception] Допустим только один тип или набор значений(исключение null)  
                                                                            
#1  /var/www/kernel-api-

[Killed] GreaterThan
TypeResolver.php:88:3
 				$count++;
 			}
 		}
-		if ($count > 1) {
+		if ($count >= 1) {
 			throw new \Exception('Допустим только один тип или набор значений(исключение null)');
 		}
statusReason: 1) SuccessResponseDataHelperTest: Associative array return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testAssociativeArrayReturn
                                                                            
  [Exception] Допустим только один тип или набор значений(исключение null)  
                                                                            
#1  /var/www/kernel-api

[Killed] Throw_
TypeResolver.php:89:4
 			}
 		}
 		if ($count > 1) {
-			throw new \Exception('Допустим только один тип или набор значений(исключение null)');
+			new \Exception('Допустим только один тип или набор значений(исключение null)');
 		}
 
statusReason: 1) SuccessResponseDataHelperTest: Union type return will fail
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testUnionTypeReturnWillFail
Failed asserting that exception with message "Допустим только один тип или набор значений(исключение null)" is thrown
#1  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 3, Assertions: 5, Failures: 1.

[Survived] Foreach_
TypeResolver.php:93:3
 		}
 
 		$enum = null;
-		foreach ($types as $type) {
-			if (in_array($type, self::PRIMARY_TYPES, true)) {
-				if ($type !== 'null') {
-					if ($enum === true) {
-						throw new \Exception('Допустим только один тип или набор значений(исключение null)');
-					}
-					$enum = false;
-				}
-			} else {
-				if ($enum === false) {
-					throw new \Exception('Допустим только один тип или набор значений(исключение null)');
-				}
-				$enum = true;
-			}
-		}
+		foreach (array() as $type) {
 	}
 

[Killed] IfNegation
TypeResolver.php:94:4
 
 		$enum = null;
 		foreach ($types as $type) {
-			if (in_array($type, self::PRIMARY_TYPES, true)) {
-				if ($type !== 'null') {
-					if ($enum === true) {
-						throw new \Exception('Допустим только один тип или набор значений(исключение null)');
-					}
-					$enum = false;
-				}
-			} else {
-				if ($enum === false) {
-					throw new \Exception('Допустим только один тип или набор значений(исключение null)');
-				}
-				$enum = true;
-			}
+			if (!in_array($type, self::PRIMARY_TYPES, true)) {
 		}
 	}
statusReason: 1) SuccessResponseDataHelperTest: Array shape return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testArrayShapeReturn
                                                                            
  [Exception] Допустим только один тип или набор значений(исключение null)  
                                                                            
#1  /var/www/kernel-api-framework/O

[Killed] NotIdentical
TypeResolver.php:95:5
 		$enum = null;
 		foreach ($types as $type) {
 			if (in_array($type, self::PRIMARY_TYPES, true)) {
-				if ($type !== 'null') {
+				if ($type === 'null') {
 					if ($enum === true) {
 						throw new \Exception('Допустим только один тип или набор значений(исключение null)');
statusReason: 1) SuccessResponseDataHelperTest: Nullable return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testNullableReturn
                                                                            
  [Exception] Допустим только один тип или набор значений(исключение null)  
                                                                            
#1  /var/www/kernel-api-framework/OpenAp

[Killed] Identical
TypeResolver.php:96:6
 		foreach ($types as $type) {
 			if (in_array($type, self::PRIMARY_TYPES, true)) {
 				if ($type !== 'null') {
-					if ($enum === true) {
+					if ($enum !== true) {
 						throw new \Exception('Допустим только один тип или набор значений(исключение null)');
 					}
statusReason: 1) SuccessResponseDataHelperTest: Associative array return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testAssociativeArrayReturn
                                                                            
  [Exception] Допустим только один тип или набор значений(исключение null)  
                                                                            
#1  /var/www/kernel-api

[Survived] TrueValue
TypeResolver.php:96:6
 		foreach ($types as $type) {
 			if (in_array($type, self::PRIMARY_TYPES, true)) {
 				if ($type !== 'null') {
-					if ($enum === true) {
+					if ($enum === false) {
 						throw new \Exception('Допустим только один тип или набор значений(исключение null)');
 					}

[NoCoverage] Throw_
TypeResolver.php:97:7
 			if (in_array($type, self::PRIMARY_TYPES, true)) {
 				if ($type !== 'null') {
 					if ($enum === true) {
-						throw new \Exception('Допустим только один тип или набор значений(исключение null)');
+						new \Exception('Допустим только один тип или набор значений(исключение null)');
 					}
 					$enum = false;

[Survived] FalseValue
TypeResolver.php:99:6
 					if ($enum === true) {
 						throw new \Exception('Допустим только один тип или набор значений(исключение null)');
 					}
-					$enum = false;
+					$enum = true;
 				}
 			} else {

[Killed] FalseValue
TypeResolver.php:102:5
 					$enum = false;
 				}
 			} else {
-				if ($enum === false) {
+				if ($enum === true) {
 					throw new \Exception('Допустим только один тип или набор значений(исключение null)');
 				}
statusReason: 1) SuccessResponseDataHelperTest: Array shape return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testArrayShapeReturn
                                                                            
  [Exception] Допустим только один тип или набор значений(исключение null)  
                                                                            
#1  /var/www/kernel-api-framework/O

[Killed] Identical
TypeResolver.php:102:5
 					$enum = false;
 				}
 			} else {
-				if ($enum === false) {
+				if ($enum !== false) {
 					throw new \Exception('Допустим только один тип или набор значений(исключение null)');
 				}
statusReason: 1) SuccessResponseDataHelperTest: Object all constants return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testObjectAllConstantsReturn
                                                                            
  [Exception] Допустим только один тип или набор значений(исключение null)  
                                                                            
#1  /var/www/kerne

[NoCoverage] Throw_
TypeResolver.php:103:6
 				}
 			} else {
 				if ($enum === false) {
-					throw new \Exception('Допустим только один тип или набор значений(исключение null)');
+					new \Exception('Допустим только один тип или набор значений(исключение null)');
 				}
 				$enum = true;

[Killed] TrueValue
TypeResolver.php:105:5
 				if ($enum === false) {
 					throw new \Exception('Допустим только один тип или набор значений(исключение null)');
 				}
-				$enum = true;
+				$enum = false;
 			}
 		}
statusReason: 1) SuccessResponseDataHelperTest: Array shape return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testArrayShapeReturn
                                                                            
  [Exception] Допустим только один тип или набор значений(исключение null)  
                                                                            
#1  /var/www/kernel-api-framework/O

[Survived] PublicVisibility
TypeResolver.php:110:2
 		}
 	}
 
-	public function convertTypeToOpenApi(string $resolvingType): string
+	protected function convertTypeToOpenApi(string $resolvingType) : string
 	{
 		return match ($resolvingType) {

[Killed] MatchArmRemoval
TypeResolver.php:112:3
 
 	public function convertTypeToOpenApi(string $resolvingType): string
 	{
-		return match ($resolvingType) {
-			'int' => 'integer',
-			'bool' => 'boolean',
-			'float' => 'number',
-			'mixed' => throw new \Exception("Тип mixed запрещен в возвращаемых или получаемых значениях!"),
-			default => $resolvingType
-		};
+		
 	}
 
statusReason: 1) SuccessResponseDataHelperTest: Keys is constants return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testKeysIsConstantsReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'int'
+'integer'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:259

[Killed] IfNegation
TypeResolver.php:128:3
 
 	private function resolveArray(array $resolvingType, array $resolvedClass): Schema
 	{
-		if ($this->isAssociativeArray($resolvingType)) {
-			if (array_key_exists('OR', $resolvingType)) {
-				return $this->resolveOR($resolvingType, $resolvedClass);
-			}
-			return $this->resolveAssociativeArray($resolvingType, $resolvedClass);
-		}
+		if (!$this->isAssociativeArray($resolvingType)) {
 		return $this->resolveNotAssociativeArray($resolvingType, $resolvedClass);
 	}
statusReason: 1) SuccessResponseDataHelperTest: Array shape return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testArrayShapeReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'array'
+'object'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:200

[Killed] IfNegation
TypeResolver.php:129:4
 	private function resolveArray(array $resolvingType, array $resolvedClass): Schema
 	{
 		if ($this->isAssociativeArray($resolvingType)) {
-			if (array_key_exists('OR', $resolvingType)) {
-				return $this->resolveOR($resolvingType, $resolvedClass);
-			}
+			if (!array_key_exists('OR', $resolvingType)) {
 			return $this->resolveAssociativeArray($resolvingType, $resolvedClass);
 		}
statusReason: 1) SuccessResponseDataHelperTest: Associative array return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testAssociativeArrayReturn
Failed asserting that '#/components/schemas/entities_TestObject' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:118
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests:

[Killed] Foreach_
TypeResolver.php:139:3
 
 	private function isAssociativeArray(array $result): bool
 	{
-		foreach ($result as $key => $item) {
-			if (is_string($key) && $key !== 'int') {
-				return true;
-			}
-		}
+		foreach (array() as $key => $item) {
 		return false;
 	}
statusReason: 1) SuccessResponseDataHelperTest: Associative array return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testAssociativeArrayReturn
Failed asserting that '#/components/schemas/entities_TestObject' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:118
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests:

[Killed] NotIdentical
TypeResolver.php:140:4
 	private function isAssociativeArray(array $result): bool
 	{
 		foreach ($result as $key => $item) {
-			if (is_string($key) && $key !== 'int') {
+			if (is_string($key) && $key === 'int') {
 				return true;
 			}
statusReason: 1) SuccessResponseDataHelperTest: Keys is constants return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testKeysIsConstantsReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'array'
+'object'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:254
