[Killed] LogicalAndNegation
TypeResolver.php:140:4
 	private function isAssociativeArray(array $result): bool
 	{
 		foreach ($result as $key => $item) {
-			if (is_string($key) && $key !== 'int') {
+			if (!(is_string($key) && $key !== 'int')) {
 				return true;
 			}
statusReason: 1) SuccessResponseDataHelperTest: List of enum values with astrix return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testListOfEnumValuesWithAstrixReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'object'
+'array'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:167

[Killed] TrueValue
TypeResolver.php:141:5
 	{
 		foreach ($result as $key => $item) {
 			if (is_string($key) && $key !== 'int') {
-				return true;
+				return false;
 			}
 		}
statusReason: 1) SuccessResponseDataHelperTest: Keys is constants return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testKeysIsConstantsReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'array'
+'object'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:254

[NoCoverage] Foreach_
TypeResolver.php:150:3
 	private function resolveOR(array $resolvingType, array $resolvedClass): Schema
 	{
 		$result = [];
-		foreach ($resolvingType['OR'] as $data) {
-			$result[] = $this->resolve($data, $resolvedClass);
-		}
+		foreach (array() as $data) {
 		return new Schema(['oneOf' => $result]);
 	}

[Killed] MethodCallRemoval
TypeResolver.php:161:4
 		$result = [];
 		foreach ($resolvingType as $key => $item) {
 			$newKey = null;
-			$this->checkIfAllowedNumberOfTypes(array_unique(explode('|', $key)));
+			
 			if ($this->isNotRequiredField($key)) {
 				$newKey = substr($key, 0, -1);
statusReason: 1) SuccessResponseDataHelperTest: Object collection return will fail
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testObjectCollectionReturnWillFail
Failed asserting that exception with message "Допустим только один тип или набор значений(исключение null)" is thrown
#1  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 16, Assertions: 51, Failures: 1.

[Killed] IfNegation
TypeResolver.php:162:4
 		foreach ($resolvingType as $key => $item) {
 			$newKey = null;
 			$this->checkIfAllowedNumberOfTypes(array_unique(explode('|', $key)));
-			if ($this->isNotRequiredField($key)) {
-				$newKey = substr($key, 0, -1);
-			}
+			if (!$this->isNotRequiredField($key)) {
 			$schema = $this->resolve($item, $resolvedClasses);
 			if ($this->isNotRequiredField($key)) {
statusReason: 1) SuccessResponseDataHelperTest: Associative array return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testAssociativeArrayReturn
Failed asserting that '#/components/schemas/entities_TestObject' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:118
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests:

[Killed] DecrementInteger
TypeResolver.php:163:5
 			$newKey = null;
 			$this->checkIfAllowedNumberOfTypes(array_unique(explode('|', $key)));
 			if ($this->isNotRequiredField($key)) {
-				$newKey = substr($key, 0, -1);
+				$newKey = substr($key, -1, -1);
 			}
 			$schema = $this->resolve($item, $resolvedClasses);
statusReason: 1) SuccessResponseDataHelperTest: Array shape return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testArrayShapeReturn
Failed asserting that '#/components/schemas/entities_TestObject' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:203
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 14, Asserti

[Killed] UnwrapSubstr
TypeResolver.php:163:5
 			$newKey = null;
 			$this->checkIfAllowedNumberOfTypes(array_unique(explode('|', $key)));
 			if ($this->isNotRequiredField($key)) {
-				$newKey = substr($key, 0, -1);
+				$newKey = $key;
 			}
 			$schema = $this->resolve($item, $resolvedClasses);
statusReason: 1) SuccessResponseDataHelperTest: Array shape return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testArrayShapeReturn
Failed asserting that '#/components/schemas/entities_TestObject' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:203
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 10, Asserti

[Killed] IfNegation
TypeResolver.php:166:4
 				$newKey = substr($key, 0, -1);
 			}
 			$schema = $this->resolve($item, $resolvedClasses);
-			if ($this->isNotRequiredField($key)) {
-				if (!empty($schema->getSerializableData()->{'$ref'})) {
-					$newSchema = new Schema(['nullable' => true]);
-					$schema = new Schema([
-						'allOf' => [$schema, $newSchema]
-					]);
-				} else {
-					$schema->nullable = true;
-				}
-			}
+			if (!$this->isNotRequiredField($key)) {
 			if ($this->isUnion($key) && !str_contains($key, 'null') && !str_contains($key, '?')) {
statusReason: 1) SuccessResponseDataHelperTest: Associative array return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testAssociativeArrayReturn
Failed asserting that '#/components/schemas/entities_TestObject' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:118
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests:

[Killed] LogicalNot
TypeResolver.php:167:5
 			}
 			$schema = $this->resolve($item, $resolvedClasses);
 			if ($this->isNotRequiredField($key)) {
-				if (!empty($schema->getSerializableData()->{'$ref'})) {
+				if (empty($schema->getSerializableData()->{'$ref'})) {
 					$newSchema = new Schema(['nullable' => true]);
 					$schema = new Schema([
statusReason: 1) SuccessResponseDataHelperTest: Array shape return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testArrayShapeReturn
Failed asserting that '#/components/schemas/entities_TestObject' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:203
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 6, Assertio

[Killed] TrueValue
TypeResolver.php:168:6
 			$schema = $this->resolve($item, $resolvedClasses);
 			if ($this->isNotRequiredField($key)) {
 				if (!empty($schema->getSerializableData()->{'$ref'})) {
-					$newSchema = new Schema(['nullable' => true]);
+					$newSchema = new Schema(['nullable' => false]);
 					$schema = new Schema([
 						'allOf' => [$schema, $newSchema]
statusReason: 1) SuccessResponseDataHelperTest: Array shape return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testArrayShapeReturn
Failed asserting that false is true.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:204
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 4, Assertions: 9, Failures: 1.

[Killed] ArrayItemRemoval
TypeResolver.php:169:6
 			if ($this->isNotRequiredField($key)) {
 				if (!empty($schema->getSerializableData()->{'$ref'})) {
 					$newSchema = new Schema(['nullable' => true]);
-					$schema = new Schema([
-						'allOf' => [$schema, $newSchema]
-					]);
+					$schema = new Schema([]);
 				} else {
 					$schema->nullable = true;
statusReason: 1) SuccessResponseDataHelperTest: Array shape return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testArrayShapeReturn
Failed asserting that '#/components/schemas/entities_TestObject' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:203
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 10, Asserti

[Survived] TrueValue
TypeResolver.php:173:6
 						'allOf' => [$schema, $newSchema]
 					]);
 				} else {
-					$schema->nullable = true;
+					$schema->nullable = false;
 				}
 			}

[Killed] LogicalAndSingleSubExprNegation
TypeResolver.php:177:4
 				}
 			}
-			if ($this->isUnion($key) && !str_contains($key, 'null') && !str_contains($key, '?')) {
+			if (!$this->isUnion($key) && !str_contains($key, 'null') && !str_contains($key, '?')) {
 				foreach (explode('|', $key) as $value){
 					$schema->nullable = true;
statusReason: 1) SuccessResponseDataHelperTest: Keys is constants return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testKeysIsConstantsReturn
Failed asserting that two arrays are equal.
- Expected | + Actual
@@ @@
Array (
-    0 => 'oAccessBookmakerCabinet'
-    1 => 'oAccessPartnerCabinet'

[Killed] LogicalNot
TypeResolver.php:177:4
 				}
 			}
-			if ($this->isUnion($key) && !str_contains($key, 'null') && !str_contains($key, '?')) {
+			if ($this->isUnion($key) && !str_contains($key, 'null') && str_contains($key, '?')) {
 				foreach (explode('|', $key) as $value){
 					$schema->nullable = true;
statusReason: 1) SuccessResponseDataHelperTest: Keys is constants return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testKeysIsConstantsReturn
Failed asserting that two arrays are equal.
- Expected | + Actual
@@ @@
Array (
-    0 => 'oAccessBookmakerCabinet'
-    1 => 'oAccessPartnerCabinet'

[Killed] Foreach_
TypeResolver.php:178:5
 			}
 			if ($this->isUnion($key) && !str_contains($key, 'null') && !str_contains($key, '?')) {
-				foreach (explode('|', $key) as $value){
-					$schema->nullable = true;
-					$result[$value] = $schema;
-				}
+				foreach (array() as $value) {
 			} else {
 				$result[$newKey ?? $key] = $schema;
statusReason: 1) SuccessResponseDataHelperTest: Keys is constants return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testKeysIsConstantsReturn
Failed asserting that two arrays are equal.
- Expected | + Actual
@@ @@
Array (
-    0 => 'oAccessBookmakerCabinet'
-    1 => 'oAccessPartnerCabinet'

[Killed] TrueValue
TypeResolver.php:179:6
 			if ($this->isUnion($key) && !str_contains($key, 'null') && !str_contains($key, '?')) {
 				foreach (explode('|', $key) as $value){
-					$schema->nullable = true;
+					$schema->nullable = false;
 					$result[$value] = $schema;
 				}
statusReason: 1) SuccessResponseDataHelperTest: Keys is constants return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testKeysIsConstantsReturn
Failed asserting that false is true.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:261
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 9, Assertions: 24, Failures: 1.

[Killed] Coalesce
TypeResolver.php:183:5
 					$result[$value] = $schema;
 				}
 			} else {
-				$result[$newKey ?? $key] = $schema;
+				$result[$key ?? $newKey] = $schema;
 			}
 		}
statusReason: 1) SuccessResponseDataHelperTest: Array shape return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testArrayShapeReturn
Failed asserting that '#/components/schemas/entities_TestObject' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:203
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 5, Assertio

[Survived] LogicalNot
TypeResolver.php:192:3
 			'properties' => $result,
 		]);
 		$keys = $this->getRequiredKeys($resolvingType);
-		if (!empty($keys)) {
+		if (empty($keys)) {
 			$schema->required = $keys;
 		}

[Killed] Foreach_
TypeResolver.php:201:3
 	private function resolveNotAssociativeArray(array $resolvingType, array $resolvedClasses): Schema
 	{
 		$result = [];
-		foreach ($resolvingType as $item) {
-			$result[] = $this->resolve($item, $resolvedClasses);
-		}
+		foreach (array() as $item) {
 		return new Schema([
 			'type' => Type::ARRAY,
statusReason: 1) SuccessResponseDataHelperTest: Object return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testObjectReturn
Failed asserting that '#/components/schemas/RBAC_Permissions' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:108
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failu

[Killed] ArrayItemRemoval
TypeResolver.php:204:3
 		foreach ($resolvingType as $item) {
 			$result[] = $this->resolve($item, $resolvedClasses);
 		}
-		return new Schema([
-			'type' => Type::ARRAY,
-			'items' => count($result) > 1
-				? new Schema(['allOf' => $result])
-				: $result[0]
-		]);
+		return new Schema(['items' => count($result) > 1 ? new Schema(['allOf' => $result]) : $result[0]]);
 	}
 
statusReason: 1) SuccessResponseDataHelperTest: Keys is constants return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testKeysIsConstantsReturn
Failed asserting that 'array' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:257
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, Assertions: 0, Failures: 1.

[Killed] GreaterThanNegotiation
TypeResolver.php:206:4
 		}
 		return new Schema([
 			'type' => Type::ARRAY,
-			'items' => count($result) > 1
+			return new Schema(['type' => Type::ARRAY, 'items' => count($result) <= 1 ? new Schema(['allOf' => $result]) : $result[0]]);
 				? new Schema(['allOf' => $result])
 				: $result[0]
statusReason: 1) SuccessResponseDataHelperTest: List of objects return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testListOfObjectsReturn
Failed asserting that '#/components/schemas/entities_TestObject' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:142
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, A

[Killed] Ternary
TypeResolver.php:206:4
 		}
 		return new Schema([
 			'type' => Type::ARRAY,
-			'items' => count($result) > 1
-				? new Schema(['allOf' => $result])
-				: $result[0]
+			return new Schema(['type' => Type::ARRAY, 'items' => count($result) > 1 ? $result[0] : new Schema(['allOf' => $result])]);
 		]);
 	}
statusReason: 1) SuccessResponseDataHelperTest: List of enum values with astrix return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testListOfEnumValuesWithAstrixReturn
Failed asserting that '#/components/schemas/RBAC_Permissions' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:168
#2  /var/www/kernel-api-framework/vendor/bin/codecept:

[Killed] IncrementInteger
TypeResolver.php:208:5
 			'type' => Type::ARRAY,
 			'items' => count($result) > 1
 				? new Schema(['allOf' => $result])
-				: $result[0]
+				return new Schema(['type' => Type::ARRAY, 'items' => count($result) > 1 ? new Schema(['allOf' => $result]) : $result[1]]);
 		]);
 	}
statusReason: 1) SuccessResponseDataHelperTest: List of objects return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testListOfObjectsReturn
Failed asserting that '#/components/schemas/entities_TestObject' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:142
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 1, A

[Killed] IfNegation
TypeResolver.php:220:3
 			return new Schema(['$ref' => $ref]);
 		}
 
-		if (in_array($className, $resolvedClasses, true)) {
-			return new Schema(['description' => 'Объект не распарсился т.к содержит рекурсивную зависимость']);
-		}
+		if (!in_array($className, $resolvedClasses, true)) {
 		$resolvedClasses = $resolvedClasses + [$className];
 
statusReason: 1) SuccessResponseDataHelperTest: Associative array return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testAssociativeArrayReturn
Failed asserting that '#/components/schemas/entities_TestObject' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:118
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests:

[NoCoverage] ArrayItemRemoval
TypeResolver.php:221:4
 		}
 
 		if (in_array($className, $resolvedClasses, true)) {
-			return new Schema(['description' => 'Объект не распарсился т.к содержит рекурсивную зависимость']);
+			return new Schema([]);
 		}
 		$resolvedClasses = $resolvedClasses + [$className];

[Killed] IfNegation
TypeResolver.php:225:3
 		}
 		$resolvedClasses = $resolvedClasses + [$className];
 
-		if (enum_exists($className)) {
-			$result = $this->resolveEnum($className);
-		} else {
-			$result = $this->resolveClass($className, $resolvedClasses);
-		}
+		if (!enum_exists($className)) {
 
 		//Добавляем в коллекцию объект
statusReason: 1) SuccessResponseDataHelperTest: Indexed array return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testIndexedArrayReturn
                                                                              
  [Error] Call to undefined method Unit\OpenApi\entities\TestObject::cases()  
                                                                              
#1  /var/www/kernel-api-f

[Killed] MethodCallRemoval
TypeResolver.php:232:3
 		}
 
 		//Добавляем в коллекцию объект
-		$this->collection->add($ref, $result);
+		
 		return new Schema(['$ref' => $ref]);
 	}
statusReason: 1) SuccessResponseDataHelperTest: Indexed array return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testIndexedArrayReturn
                                                                                                                              
  [TypeError] OpenApi\ReferenceCollection::offsetGet(): Return value must be of type cebe\openapi\spec\Schema, null returned

[Killed] Foreach_
TypeResolver.php:240:3
 	{
 		$reflectionClass = new \ReflectionClass($className);
 		$result = [];
-		foreach ($reflectionClass->getProperties() as $property) {
-			$result[$property->getName()] = $this->resolveProperty($property, $className, $resolvedClasses);
-		}
+		foreach (array() as $property) {
 		return new Schema(['type' => Type::OBJECT, 'properties' => $result]);
 	}
statusReason: 1) SuccessResponseDataHelperTest: Object return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testObjectReturn
Failed asserting that 'string' matches expected null.
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:103
#2  /var/www/kernel-api-framework/vendor/bin/codecept:120

FAILURES!
Tests: 18, Assertions: 41, Failures: 1.

[Killed] NotIdentical
TypeResolver.php:249:3
 	private function resolveProperty(\ReflectionProperty $property, string $className, array $resolvedClasses): Schema
 	{
 		$result = $this->getPropertySchemaByTag($property, $className, $resolvedClasses);
-		if ($result !== null) {
+		if ($result === null) {
 			return $result;
 		}
statusReason: 1) SuccessResponseDataHelperTest: Object return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testObjectReturn
                                                                                                                             
  [TypeError] OpenApi\TypeResolver::resolveProperty(): Return value must be of type cebe\openapi\spec\Schema, null returned

[Killed] LogicalNot
TypeResolver.php:253:3
 			return $result;
 		}
 		$type = $property->getType();
-		if (!$type instanceof \ReflectionNamedType) {
+		if ($type instanceof \ReflectionNamedType) {
 			throw new \Exception('Не допускается несколько типов у свойства(за исключением null)');
 		}
statusReason: 1) SuccessResponseDataHelperTest: Nullable return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testNullableReturn
                                                                              
  [Exception] Не допускается несколько типов у свойства(за исключением null)  
                                                                              
#1  /var/www/kernel-api-framework/

[Killed] InstanceOf_
TypeResolver.php:253:3
 			return $result;
 		}
 		$type = $property->getType();
-		if (!$type instanceof \ReflectionNamedType) {
+		if (!false) {
 			throw new \Exception('Не допускается несколько типов у свойства(за исключением null)');
 		}
statusReason: 1) SuccessResponseDataHelperTest: Object return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testObjectReturn
                                                                              
  [Exception] Не допускается несколько типов у свойства(за исключением null)  
                                                                              
#1  /var/www/kernel-api-framework/Open

[NoCoverage] Throw_
TypeResolver.php:254:4
 		}
 		$type = $property->getType();
 		if (!$type instanceof \ReflectionNamedType) {
-			throw new \Exception('Не допускается несколько типов у свойства(за исключением null)');
+			new \Exception('Не допускается несколько типов у свойства(за исключением null)');
 		}
 		$schema = $this->resolve($type->getName(), $resolvedClasses);

[Survived] IfNegation
TypeResolver.php:257:3
 			throw new \Exception('Не допускается несколько типов у свойства(за исключением null)');
 		}
 		$schema = $this->resolve($type->getName(), $resolvedClasses);
-		if ($type->allowsNull()) {
-			if (!empty($schema->getSerializableData()->{'$ref'})) {
-				$newSchema = new Schema(['nullable' => true]);
-				$schema = new Schema([
-					'allOf' => [$schema, $newSchema]
-				]);
-			} else {
-				$schema->nullable = true;
-			}
-		}
+		if (!$type->allowsNull()) {
 		return $schema;
 	}

[NoCoverage] LogicalNot
TypeResolver.php:258:4
 		}
 		$schema = $this->resolve($type->getName(), $resolvedClasses);
 		if ($type->allowsNull()) {
-			if (!empty($schema->getSerializableData()->{'$ref'})) {
+			if (empty($schema->getSerializableData()->{'$ref'})) {
 				$newSchema = new Schema(['nullable' => true]);
 				$schema = new Schema([

[NoCoverage] ArrayItemRemoval
TypeResolver.php:259:5
 		$schema = $this->resolve($type->getName(), $resolvedClasses);
 		if ($type->allowsNull()) {
 			if (!empty($schema->getSerializableData()->{'$ref'})) {
-				$newSchema = new Schema(['nullable' => true]);
+				$newSchema = new Schema([]);
 				$schema = new Schema([
 					'allOf' => [$schema, $newSchema]

[Killed] Identical
TypeResolver.php:277:3
 	): ?Schema {
 		$parser = new PhpDocParser($className);
 		$doc = $property->getDocComment();
-		if ($doc === false) {
+		if ($doc !== false) {
 			return null;
 		}
statusReason: 1) SuccessResponseDataHelperTest: Associative array return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testAssociativeArrayReturn
                                           
  [Exception] Метод не содержит docBlock!  
                                           
#1  /var/www/kernel-api-framework/OpenApi/PhpDocParser.php:98
#2  /var/www/kernel-api-framework/OpenApi/TypeResolver.php:2

[Killed] FalseValue
TypeResolver.php:277:3
 	): ?Schema {
 		$parser = new PhpDocParser($className);
 		$doc = $property->getDocComment();
-		if ($doc === false) {
+		if ($doc === true) {
 			return null;
 		}
statusReason: 1) SuccessResponseDataHelperTest: Associative array return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testAssociativeArrayReturn
                                           
  [Exception] Метод не содержит docBlock!  
                                           
#1  /var/www/kernel-api-framework/OpenApi/PhpDocParser.php:98
#2  /var/www/kernel-api-framework/OpenApi/TypeResolver.php:2

[Killed] IncrementInteger
TypeResolver.php:282:3
 		}
 		$node = $parser->getPhpDocNode($doc)->getVarTagValues();
 
-		if (isset($node[0])) {
+		if (isset($node[1])) {
 			return $this->resolve($parser->convert($node[0]), $resolvedClasses);
 		}
statusReason: 1) SuccessResponseDataHelperTest: Object return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testObjectReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'string'
+'array'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:107

[Killed] IncrementInteger
TypeResolver.php:283:4
 		$node = $parser->getPhpDocNode($doc)->getVarTagValues();
 
 		if (isset($node[0])) {
-			return $this->resolve($parser->convert($node[0]), $resolvedClasses);
+			return $this->resolve($parser->convert($node[1]), $resolvedClasses);
 		}
 		return null;
statusReason: 1) SuccessResponseDataHelperTest: Array shape return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testArrayShapeReturn
                                                                                                                                                                                                                                 
  [TypeError] OpenApi\PhpDocParser::conv

[Killed] Concat
TypeResolver.php:293:3
 		$array = explode('\\', $className);
 		$class = array_pop($array);
 		$folder = array_pop($array);
-		return '#/components/schemas/' . $folder . '_' . $class;
+		return '#/components/schemas/' . '_' . $folder . $class;
 	}
 
statusReason: 1) SuccessResponseDataHelperTest: Object return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testObjectReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'#/components/schemas/_entitiesTestObject'
+'#/components/schemas/entities_TestObject'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:99

[Killed] ConcatOperandRemoval
TypeResolver.php:293:3
 		$array = explode('\\', $className);
 		$class = array_pop($array);
 		$folder = array_pop($array);
-		return '#/components/schemas/' . $folder . '_' . $class;
+		return $folder . '_' . $class;
 	}
 
statusReason: 1) SuccessResponseDataHelperTest: Object return
 Test  tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:testObjectReturn
Failed asserting that two strings are equal.
- Expected | + Actual
@@ @@
-'entities_TestObject'
+'#/components/schemas/entities_TestObject'
#1  /var/www/kernel-api-framework/tests/Unit/OpenApi/SuccessResponseDataHelperTest.php:99

[Survived] IncrementInteger
TypeResolver.php:308:3
 	 */
 	private function getEnumTypeByClassName(string $className): string
 	{
-		return is_int($className::cases()[0]->value) ? 'integer' : 'string';
+		return is_int($className::cases()[1]->value) ? 'integer' : 'string';
 	}
 

[Survived] Ternary
TypeResolver.php:308:3
 	 */
 	private function getEnumTypeByClassName(string $className): string
 	{
-		return is_int($className::cases()[0]->value) ? 'integer' : 'string';
+		return is_int($className::cases()[0]->value) ? 'string' : 'integer';
 	}
 

[Survived] Foreach_
TypeResolver.php:314:3
 	private function getRequiredKeys(array $resolvingType): array
 	{
 		$result = [];
-		foreach ($resolvingType as $key => $value) {
-			if (!$this->isNotRequiredField($key) && !$this->isUnion($key)) {
-				$result[] = $key;
-			}
-		}
+		foreach (array() as $key => $value) {
 		return $result;
 	}

[Survived] LogicalAnd
TypeResolver.php:315:4
 	{
 		$result = [];
 		foreach ($resolvingType as $key => $value) {
-			if (!$this->isNotRequiredField($key) && !$this->isUnion($key)) {
+			if (!$this->isNotRequiredField($key) || !$this->isUnion($key)) {
 				$result[] = $key;
 			}

[Survived] LogicalNot
TypeResolver.php:315:4
 	{
 		$result = [];
 		foreach ($resolvingType as $key => $value) {
-			if (!$this->isNotRequiredField($key) && !$this->isUnion($key)) {
+			if ($this->isNotRequiredField($key) && !$this->isUnion($key)) {
 				$result[] = $key;
 			}
